{
	"animation-help": "CSS анимациите са изключително удобни, когато искате да разнообразите страницата си. Предоставили сме ви няколко предварителни настройки. Трябва да ги поставите в атрибута `style` на вашия компонент, например animation: 'anim-fade-in 3s'.",
	"back-in-editor": "Ето че сме на съответната линия от лявата страна. По магически начин създадохме този малък полароид. Със същата лекота можехте да напишете този текст тук. Но за да ви улесним, ние сме го взели от ръцете ви.",
	"change-online-mode": "Тук можете да определите дали вашият урок взаимодейства със сървъра в редактора (онлайн). За целта обаче е необходимо сървърът да е посочен в преамбюла. Ако това не е така, бутонът е сив - т.е. не може да се избере.",
	"click-button-to-jump": "Просто щракнете върху този малък елемент - така ще преминете към съответния ред в редактора.",
	"component-wizard-0": "В съветника за компоненти имате пълен контрол върху вашия компонент. Можете да видите как работи, кои атрибути можете да променяте - и ако резултатът ви харесва, можете да натиснете бутона \"Вмъкни\" и промененият компонент ще се копира в редактора.",
	"component-wizard-1": "Тук можете да видите кода, който определя външния вид на компонента. Можете да го редактирате ръчно. Той също така се актуализира автоматично, когато щракнете върху нов атрибут, например. Просто му обърнете внимание!",
	"component-wizard-10": "Някои компоненти са огромни и може да е трудно да се намери атрибут. Тук можете да го потърсите. Предимството на това е, че можете да се съсредоточите върху това, което ви интересува.",
	"component-wizard-11": "Просто опитайте, добавете атрибут и променете стойността му. Нищо не може да се обърка!",
	"component-wizard-12": "Ако щракнете тук, компонентът ще бъде актуализиран в редактора и ще изглежда така, както искате.",
	"component-wizard-13": "Ако промените не ви харесват, можете да ги отмените тук. Компонентът изглежда точно както преди да отворите съветника.",
	"component-wizard-14": "Ако щракнете тук, ще затворите съветника за компоненти, но нищо няма да бъде записано.",
	"component-wizard-2": "Това е разделът за предварителен преглед. Точно така ще изглежда компонентът по-късно в редактора.",
	"component-wizard-3": "Тук можете да намерите всички атрибути, които са налични за компонента.",
	"component-wizard-4": "С едно кликване можете да зададете дали съответният атрибут да се използва или не. Просто щракнете върху него и вижте как ще се промени кодът.",
	"component-wizard-5": "При някои атрибути не е ясно какво правят. Това описание ви го обяснява.",
	"component-wizard-6": "За активните атрибути можете да промените стойността и да наблюдавате актуализирания компонент в кода и в предварителния преглед.",
	"component-wizard-7": "Това е информационно поле, в което се посочва типът данни на атрибута. Например, булева стойност е `true` или `false`, масив се отнася за списък от елементи",
	"component-wizard-8": "Тук ще намерите стойността по подразбиране, която се задава, ако не сте задали атрибута ръчно.",
	"component-wizard-9": "Тук можете да филтрирате списъка с атрибути, за да се показват само използваните в момента или все още неизползваните атрибути. Имате избор!",
	"header-preview-button": "С бутона за предварителен преглед имате бутон, с който можете да видите страницата във вида, в който тя се появява в уеб. Ако го натиснете отново, ще се върнете към изгледа на редактора.",
	"header-role-in-preview": "Тук можете да изберете ролята си и да видите страницата като анонимен потребител, регистриран потребител, собственик на курс или студент, който е записан в даден курс.",
	"keyboard-shortcuts": "Ако искате да ускорите процесите, преките пътища са от голяма полза. Можете да ги намерите в списъка тук.",
	"link-docs": "Тук се отваря документацията на ISLE, която можете да намерите и в интернет на адрес https://isledocs.com/.",
	"link-export": "Този бутон отваря страница, на която можете да качите урока си на сървъра. За да направите това, трябва да разполагате с адреса на сървъра и данните за достъп. - За да продължите с урока, моля, щракнете върху бутона Назад към редактора.",
	"link-settings": "Страницата с настройките показва под какъв потребителски имейл сте свързани към кой сървър. Интеграцията с GitHub (която изисква да сте потребител на Github) ви позволява да изтегляте шаблони и да качвате собствени фрагменти код като gists. В раздела с настройки можете да зададете езика на редактора, размера на шрифта на записа и някои други важни настройки.",
	"linting-and-spelling": "Редакторът има вградена програма за проверка на правописа и ви показва дали сте направили правописна грешка. Linting се отнася до начина, по който поддържате кода си чист. Това повишава четимостта и гарантира, че стилът на кода ви е последователен.",
	"live-preview": "Тук можете да намерите визуализацията в реално време - т.е. това, което потребителите ви виждат. Принципът е познат. WYSIWYG! Преведено обратно на български език: Това, което виждате, е това, което получавате!",
	"markdown-help": "Научаването на езика за маркиране Markdown не е трудно, което е предимство пред HTML. Той е много по-лесен за четене - и ускорява работата изключително много.",
	"monaco-editor": "В лявата част се намира базата с кодове. Всъщност тя е доста позната, ако вече сте се занимавали с HTML или Markdown. Но не се притеснявайте: Цялото нещо се отваря бързо - и колкото и страшно да изглежда, ще го научите лесно.",
	"opened-wizard": "Този прозорец показва и обяснява всички атрибути, които има нашият Polaroid. Ако кликнете върху даден атрибут, той ще бъде използван в нашия код. В нашия случай досега това не е нищо повече от атрибута image, който съдържа url.",
	"polaroid-double-click": "Кликнете два пъти върху думата Polaroid. Сега съответният елемент вдясно ще бъде маркиран.",
	"polaroid-hover": "Опитайте да задържите мишката върху думата \"Polaroid\". Ще видите: Появява се малко обяснение. Можете също така да преминете с мишката върху атрибутите на елемента. За изображението виждате, че то е низ, който очевидно сочи към URL адрес. Ако искате, можете да замените изображението. - Всеки елемент в редактора може да бъде изследван по този начин.",
	"polaroid-lightbulb": "Ако щракнете върху името \"Polaroid\", над кода на компонента Polaroid ще се появи малка лампичка. Ако щракнете върху нея, ще имате няколко възможности. Първо, можете да накарате изгледа да направи компонента видим или можете да подадете конкретни проблеми и да предложите подобрения в GitHub.",
	"polaroid-wizard": "Ако поставите курсора на мишката върху елемента, се появява малка червена рамка с няколко бутона в горния десен ъгъл, с които можете да правите различни неща. За да персонализираме Polaroid, щракваме върху първия бутон с икона на зъбно колело, за да се отвори \"Съветник за компоненти\".",
	"translate-lesson": "Имате възможност да преведете целия урок на език по ваш избор - предлагаме общо 10 езика. Освен това можете да превеждате и отделни пасажи. За да направите това, трябва да маркирате текста, да щракнете с десния бутон на мишката и да изберете командата \"Превод\" от контекстното меню.",
	"two-panes": "Както можете да видите: Редакторът е разделен на две части (можете дори да преместите лентата в средата). По този начин можете да определите колко място да заема съответният панел."
}
