{
	"animation-help": "Animace CSS jsou neuvěřitelně užitečné, když chcete stránku ozvláštnit. Poskytli jsme vám několik předvoleb. Musíte je vložit do atributu `style` své komponenty, např. animation: 'anim-fade-in 3s'.",
	"back-in-editor": "Jsme tedy na příslušné linii na levé straně. Kouzlem jsme vytvořili tento malý polaroid. Stejně dobře jste mohli tento text napsat sem. Ale abychom vám to usnadnili, sebrali jsme vám to z rukou.",
	"change-online-mode": "Zde můžete určit, zda vaše lekce komunikuje se serverem v editoru (online). To však vyžaduje, aby byl server uveden v preambuli. Pokud tomu tak není, je tlačítko šedé - tj. nelze jej vybrat.",
	"click-button-to-jump": "Stačí kliknout na tento malý prvek - a přejdete na příslušný řádek v editoru.",
	"component-wizard-0": "V Průvodci komponentou máte nad komponentou plnou kontrolu. Vidíte, jak funguje, které atributy můžete měnit - a pokud se vám výsledek líbí, můžete stisknout tlačítko `Vložit` a změněná komponenta se zkopíruje do editoru.",
	"component-wizard-1": "Zde vidíte kód, který definuje vzhled komponenty. Můžete jej upravit ručně. Také se automaticky aktualizuje, když například kliknete na nový atribut. Stačí mu věnovat pozornost!",
	"component-wizard-10": "Některé komponenty jsou obrovské a může být obtížné najít jejich atribut. Zde jej můžete vyhledat. Výhodou je, že se můžete zaměřit na to, co vás zajímá.",
	"component-wizard-11": "Stačí si to vyzkoušet, přidat atribut a změnit jeho hodnotu. Nic se nemůže pokazit!",
	"component-wizard-12": "Pokud kliknete sem, komponenta se v editoru aktualizuje a bude vypadat podle vašich představ.",
	"component-wizard-13": "Pokud se vám změny nelíbí, můžete je zde zrušit. Komponenta vypadá přesně tak, jak vypadala před otevřením průvodce.",
	"component-wizard-14": "Kliknete-li zde, zavřete průvodce komponentou - nic se však neuloží.",
	"component-wizard-2": "Toto je sekce náhledu. Přesně tak bude komponenta později vypadat v editoru.",
	"component-wizard-3": "Zde najdete všechny atributy, které jsou pro danou komponentu k dispozici.",
	"component-wizard-4": "Jedním kliknutím můžete nastavit, zda se má daný atribut použít, nebo ne. Stačí na něj kliknout a uvidíte, jak se kód změní.",
	"component-wizard-5": "U některých atributů není hned jasné, k čemu slouží. Tento popis vám to vysvětlí.",
	"component-wizard-6": "U aktivních atributů můžete zde změnit hodnotu a sledovat aktualizovanou komponentu v kódu a náhledu.",
	"component-wizard-7": "Jedná se o informační pole, které určuje datový typ atributu. Například boolean je hodnota `true` nebo `false`, pole označuje seznam prvků.",
	"component-wizard-8": "Zde najdete výchozí hodnotu, která je nastavena, pokud jste atribut nenastavili ručně.",
	"component-wizard-9": "Zde můžete filtrovat seznam atributů tak, aby se zobrazovaly pouze aktuálně používané nebo dosud nepoužívané atributy. Máte možnost volby!",
	"header-preview-button": "Pomocí tlačítka náhledu můžete zobrazit stránku tak, jak se zobrazuje na webu. Pokud jej stisknete znovu, přejdete zpět do zobrazení editoru.",
	"header-role-in-preview": "Zde si můžete vybrat svou roli - a zobrazit stránku tak, jak by ji viděl anonymní uživatel, registrovaný uživatel, vlastník kurzu nebo student zapsaný do konkrétního kurzu.",
	"keyboard-shortcuts": "Pokud chcete procesy urychlit, jsou vám skvělým pomocníkem zkratky. Jejich seznam najdete zde.",
	"link-docs": "Zde otevřete dokumentaci ISLE, kterou najdete také na internetu na adrese https://isledocs.com/.",
	"link-export": "Toto tlačítko otevře stránku, na kterou můžete nahrát lekci na server. K tomu musíte mít adresu serveru a přihlašovací údaje. - Chcete-li pokračovat ve výuce, klikněte na tlačítko Zpět do editoru.",
	"link-settings": "Na stránce nastavení se zobrazí, pod jakým uživatelským e-mailem jste připojeni k jakému serveru. Integrace s GitHubem (která vyžaduje, abyste byli uživateli Githubu) umožňuje stahovat šablony a nahrávat vlastní úryvky kódu jako gisty. V části nastavení můžete nastavit jazyk editoru, velikost písma záznamu a některá další důležitá nastavení.",
	"linting-and-spelling": "Editor má vestavěnou kontrolu pravopisu - a zobrazí vám, zda jste udělali překlep. Linting označuje způsob, jakým udržujete kód čistý. Zvyšuje čitelnost a zajišťuje konzistentní styl vašeho kódu.",
	"live-preview": "Zde najdete živý náhled - tedy to, co uvidí vaši uživatelé. Princip je známý. WYSIWYG! Přeloženo zpět do češtiny: To, co vidíte, to také dostanete!",
	"markdown-help": "Naučit se značkovací jazyk Markdown není obtížné, což je oproti HTML výhoda. Je mnohem přehlednější - a nesmírně urychluje práci.",
	"monaco-editor": "Zde na levé straně najdete základnu kódu. Vlastně docela známý, pokud jste se již zabývali HTML nebo Markdown. Ale nebojte se: Celé se to rychle otevře - a jakkoli to vypadá děsivě, naučíte se to snadno.",
	"opened-wizard": "Toto okno zobrazuje a vysvětluje všechny atributy, které náš Polaroid má. Pokud na některý atribut kliknete, bude použit v našem kódu. V našem případě to zatím není nic jiného než atribut image, který obsahuje url.",
	"polaroid-double-click": "Dvakrát klikněte na slovo Polaroid. Nyní se zvýrazní příslušný prvek vpravo.",
	"polaroid-hover": "Zkuste myší najet na slovo \"Polaroid\". Uvidíte: Zobrazí se malé vysvětlení. Můžete také najet myší na atributy prvku. U obrázku vidíte, že se jedná o řetězec, který zjevně odkazuje na adresu URL. Pokud chcete, můžete obrázek nahradit. - Tímto způsobem lze prozkoumat každý prvek v editoru.",
	"polaroid-lightbulb": "Pokud kliknete na název Polaroid, zobrazí se nad kódem komponenty Polaroid malá žárovka. Pokud na ni kliknete, zobrazí se několik možností. Zaprvé můžete zviditelnit zobrazení komponenty, nebo můžete na GitHubu zadat konkrétní problémy a navrhnout vylepšení.",
	"polaroid-wizard": "Pokud na prvek najedete myší, zobrazí se v pravém horním rohu malý červený rámeček s několika tlačítky, pomocí kterých můžete provádět různé úkony. Chceme-li Polaroid přizpůsobit, klikneme na první tlačítko s ikonou ozubeného kolečka, čímž otevřeme \"Průvodce komponentami\".",
	"translate-lesson": "Máte možnost přeložit si celou lekci do jazyka, který si vyberete - nabízíme celkem 10 jazyků. Kromě toho můžete překládat i jednotlivé pasáže. K tomu je třeba zvýraznit text, kliknout pravým tlačítkem myši a z kontextové nabídky vybrat příkaz přeložit.",
	"two-panes": "Jak vidíte: Editor je rozdělen na dvě části (můžete dokonce přesunout lištu uprostřed). Tímto způsobem můžete definovat, kolik místa má příslušný panel zabírat."
}
