{
	"animation-help": "CSS-animationer er utroligt praktiske, når du vil pifte din side op. Vi har lavet nogle forudindstillinger til dig. Du skal indsætte dem i `style`-attributten for din komponent, f.eks. animation: 'anim-fade-in 3s'.",
	"back-in-editor": "Så her er vi ved den respektive linje på venstre side. Vi har på magisk vis skabt dette lille polaroid. Du kunne lige så godt have skrevet denne tekst her. Men for at gøre det nemt, har vi taget det fra dig.",
	"change-online-mode": "Her kan du angive, om din lektion skal interagere med serveren i editoren (online). Dette kræver dog, at serveren er angivet i præamblen. Hvis dette ikke er tilfældet, er knappen grå - dvs. den kan ikke vælges.",
	"click-button-to-jump": "Du skal blot klikke på dette lille element - det vil springe til den pågældende linje i editoren.",
	"component-wizard-0": "I guiden Komponent har du fuld kontrol over din komponent. Du kan se, hvordan den fungerer, hvilke attributter du kan ændre - og hvis du kan lide resultatet, kan du trykke på knappen `Insert`, og den ændrede komponent kopieres ind i editoren.",
	"component-wizard-1": "Her kan du se den kode, der definerer komponentens udseende. Du kan redigere den manuelt. Den opdateres også automatisk, når du f.eks. klikker på en ny attribut. Du skal bare være opmærksom på det!",
	"component-wizard-10": "Nogle komponenter er enorme, og det kan være svært at finde en attribut. Her kan du søge efter den. Fordelen ved dette er, at du kan fokusere på det, du er interesseret i.",
	"component-wizard-11": "Prøv det bare, tilføj en attribut og ændr dens værdi. Intet kan gå galt!",
	"component-wizard-12": "Hvis du klikker her, vil komponenten blive opdateret i editoren og se ud, som du ønsker.",
	"component-wizard-13": "Hvis du ikke kan lide dine ændringer, kan du fortryde dem her. Komponenten ser nøjagtig ud, som den gjorde, før du åbnede guiden.",
	"component-wizard-14": "Hvis du klikker her, lukker du komponentguiden - men der bliver ikke gemt noget.",
	"component-wizard-2": "Dette er afsnittet med forhåndsvisning. Det er præcis sådan, som komponenten vil se ud senere i editoren.",
	"component-wizard-3": "Her kan du finde alle de attributter, der er tilgængelige for komponenten.",
	"component-wizard-4": "Med et enkelt klik kan du indstille, om den pågældende attribut skal bruges eller ej. Du skal blot klikke på den og se, hvordan koden ændres.",
	"component-wizard-5": "For nogle attributter er det ikke umiddelbart klart, hvad de gør. Denne beskrivelse forklarer det for dig.",
	"component-wizard-6": "For aktive attributter kan du her ændre værdien og se den opdaterede komponent i koden og i forhåndsvisningen.",
	"component-wizard-7": "Dette er et infofelt, der angiver datatypen for attributten. En boolean er f.eks. en `true` eller `false`-værdi, et array henviser til en liste af elementer",
	"component-wizard-8": "Her finder du den standardværdi, der er indstillet, hvis du ikke har indstillet attributten manuelt.",
	"component-wizard-9": "Her kan du filtrere listen over attributter for kun at få vist de attributter, der bruges i øjeblikket eller endnu ikke er brugt. Du har valget!",
	"header-preview-button": "Med preview-knappen har du en knap, hvor du kan se siden, som den vises på nettet. Hvis du trykker på den igen, springer den tilbage til redigeringsvisningen.",
	"header-role-in-preview": "Her kan du vælge din rolle - og se siden som en anonym bruger ville se den, som en registreret bruger, som kursusejer eller som den studerende, der er tilmeldt et bestemt kursus.",
	"keyboard-shortcuts": "Hvis du ønsker at fremskynde processer, er genveje en stor hjælp. Du kan finde dem på listen her.",
	"link-docs": "Her åbner du ISLE-dokumentationen, som du også kan finde på internettet på https://isledocs.com/",
	"link-export": "Denne knap åbner en side, hvor du kan uploade din lektion til serveren. Du skal have serveradressen og legitimationsoplysningerne for at kunne gøre dette. - Hvis du vil fortsætte med undervisningen, skal du klikke på knappen Tilbage til redaktør.",
	"link-settings": "Indstillingssiden viser dig, hvilken brugermail du er forbundet til hvilken server under hvilken brugermail. GitHub-integrationen (som kræver, at du er Github-bruger) giver dig mulighed for at downloade skabeloner og uploade dine egne kodestumper som gists. I indstillingsafsnittet kan du indstille editorsproget, registrere skriftstørrelsen og nogle andre vigtige indstillinger.",
	"linting-and-spelling": "Redigeringsprogrammet har en indbygget stavekontrol - og viser dig, hvis du har lavet en stavefejl. Linting henviser til den måde, du holder din kode ren på. Dette øger læsbarheden og sikrer, at stilen i din kode er ensartet.",
	"live-preview": "Her kan du finde live preview - det vil sige, hvad dine brugere får at se. Princippet er velkendt. WYSIWYG! Oversat tilbage til engelsk: Hvad du ser, er hvad du får!",
	"markdown-help": "Det er ikke svært at lære Markdown-markupsproget, hvilket er en fordel i forhold til HTML. Det er meget nemmere at læse - og det gør arbejdet meget hurtigere.",
	"monaco-editor": "Her i venstre side finder du kodebasen. Egentlig ret velkendt, hvis du allerede har beskæftiget dig med HTML eller Markdown. Men bare rolig: Det hele åbner sig hurtigt - og hvor skræmmende det end ser ud, så lærer du det nemt.",
	"opened-wizard": "Dette vindue viser og forklarer alle de egenskaber, som vores Polaroid har. Hvis der klikkes på en attribut, vil den blive brugt i vores kode. I vores tilfælde er det indtil videre ikke andet end image-attributten, som indeholder en url.",
	"polaroid-double-click": "Dobbeltklik på ordet Polaroid. Nu vil det tilsvarende element til højre blive fremhævet.",
	"polaroid-hover": "Prøv at holde musen hen over ordet \"Polaroid\". Du kan se det: En lille forklaring vises. Du kan også holde musen hen over elementets attributter. For billedet kan du se, at det er en streng, der tydeligvis peger på en URL-adresse. Hvis du vil, kan du erstatte billedet. - Alle elementer i editoren kan udforskes på denne måde.",
	"polaroid-lightbulb": "Hvis du klikker på navnet \"Polaroid\", vises en lille pære over Polaroid-komponentkoden. Hvis du klikker på den, har du flere muligheder. For det første kan du få visningen til at gøre komponenten synlig, eller du kan indsende specifikke problemer og foreslå forbedringer på GitHub.",
	"polaroid-wizard": "Hvis du holder musen over elementet, vises en lille rød ramme med et par knapper i øverste højre hjørne, som du kan bruge til forskellige ting. For at tilpasse polaroidet klikker vi på den første knap med tandhjulsikonet for at åbne \"Component Wizard\".",
	"translate-lesson": "Du har mulighed for at oversætte hele din lektion til et sprog efter eget valg - vi tilbyder i alt 10 sprog. Derudover kan du også oversætte enkelte passager. For at gøre dette skal du markere en tekst, højreklikke og vælge kommandoen oversætte fra kontekstmenuen.",
	"two-panes": "Som du kan se: Editoren er opdelt i to dele (du kan endda flytte bjælken i midten). På denne måde kan du definere, hvor meget plads den respektive rude skal fylde."
}
