{
	"animation-help": "CSS-Animationen sind unglaublich praktisch, wenn Sie Ihre Seite aufpeppen wollen. Wir haben einige Voreinstellungen für Sie bereitgestellt. Sie müssen sie in das `style`-Attribut Ihrer Komponente setzen, z. B. animation: 'anim-fade-in 3s'.",
	"back-in-editor": "Hier sind wir also an der jeweiligen Linie auf der linken Seite. Wir haben auf magische Weise dieses kleine Polaroid erzeugt. Sie hätten diesen Text genauso gut hier eintippen können. Aber um es einfach zu machen, haben wir es Ihnen abgenommen.",
	"change-online-mode": "Hier können Sie angeben, ob Ihre Lektion mit dem Server im Editor interagiert (online). Dies setzt allerdings voraus, dass der Server in der Präambel angegeben ist. Ist dies nicht der Fall, ist die Schaltfläche ausgegraut - also nicht anwählbar.",
	"click-button-to-jump": "Klicken Sie einfach auf dieses kleine Element - das springt dann im Editor in die entsprechende Zeile.",
	"component-wizard-0": "Im Komponenten-Assistenten haben Sie die volle Kontrolle über Ihre Komponente. Sie können sehen, wie sie funktioniert, welche Attribute Sie ändern können - und wenn Ihnen das Ergebnis gefällt, können Sie auf die Schaltfläche `Einfügen` drücken und die geänderte Komponente wird in den Editor kopiert.",
	"component-wizard-1": "Hier sehen Sie den Code, der das Aussehen der Komponente definiert. Sie können ihn manuell bearbeiten. Er aktualisiert sich auch automatisch, wenn Sie z. B. auf ein neues Attribut klicken. Achten Sie einfach darauf!",
	"component-wizard-10": "Einige Komponenten sind riesig und es kann schwierig sein, ein Attribut zu finden. Hier können Sie danach suchen. Das hat den Vorteil, dass Sie sich auf das konzentrieren können, was Sie interessiert.",
	"component-wizard-11": "Probieren Sie es einfach aus, fügen Sie ein Attribut hinzu und ändern Sie dessen Wert. Es kann nichts schief gehen!",
	"component-wizard-12": "Wenn Sie hier klicken, wird die Komponente im Editor aktualisiert und sieht so aus, wie Sie es wünschen.",
	"component-wizard-13": "Wenn Ihnen Ihre Änderungen nicht gefallen, können Sie sie hier rückgängig machen. Die Komponente sieht genauso aus, wie sie vor dem Öffnen des Assistenten aussah.",
	"component-wizard-14": "Wenn Sie hier klicken, schließen Sie den Komponentenassistenten - es wird aber nichts gespeichert.",
	"component-wizard-2": "Dies ist der Vorschaubereich. Genau so wird die Komponente später im Editor aussehen.",
	"component-wizard-3": "Hier finden Sie alle Attribute, die für die Komponente verfügbar sind.",
	"component-wizard-4": "Mit einem Klick können Sie einstellen, ob das betreffende Attribut verwendet werden soll oder nicht. Klicken Sie einfach darauf und sehen Sie, wie sich der Code ändert.",
	"component-wizard-5": "Bei einigen Attributen ist nicht sofort klar, was sie bewirken. Diese Beschreibung erklärt es Ihnen.",
	"component-wizard-6": "Bei aktiven Attributen können Sie hier den Wert ändern und die aktualisierte Komponente im Code und in der Vorschau beobachten.",
	"component-wizard-7": "Dies ist ein Infofeld, das den Datentyp des Attributs angibt. Zum Beispiel ist ein Boolean ein `true` oder `false` Wert, ein Array bezieht sich auf eine Liste von Elementen",
	"component-wizard-8": "Hier finden Sie den Standardwert, der gesetzt wird, wenn Sie das Attribut nicht manuell gesetzt haben.",
	"component-wizard-9": "Hier können Sie die Liste der Attribute filtern, um nur die aktuell verwendeten oder noch nicht verwendeten Attribute anzuzeigen. Sie haben die Wahl!",
	"header-preview-button": "Mit der Schaltfläche \"Vorschau\" haben Sie eine Schaltfläche, mit der Sie die Seite so sehen können, wie sie im Web erscheint. Wenn Sie sie erneut drücken, springt sie zurück in die Editoransicht.",
	"header-role-in-preview": "Hier können Sie Ihre Rolle auswählen - und die Seite so sehen, wie ein anonymer Benutzer sie sehen würde, ein registrierter Benutzer, der Kursbesitzer oder der Student, der in einem bestimmten Kurs eingeschrieben ist.",
	"keyboard-shortcuts": "Wenn Sie Prozesse beschleunigen wollen, sind Shortcuts eine große Hilfe. Sie finden sie hier aufgelistet.",
	"link-docs": "Hier öffnen Sie die ISLE-Dokumentation, die Sie auch im Internet unter https://isledocs.com/ finden.",
	"link-export": "Diese Schaltfläche öffnet eine Seite, auf der Sie Ihre Lektion auf den Server hochladen können. Dazu müssen Sie die Serveradresse und die Anmeldedaten haben. - Um mit dem Lernprogramm fortzufahren, klicken Sie bitte auf die Schaltfläche Zurück zum Editor.",
	"link-settings": "Die Einstellungsseite zeigt Ihnen, unter welcher Benutzer-E-Mail Sie mit welchem Server verbunden sind. Die GitHub-Integration (für die Sie ein Github-Benutzer sein müssen) ermöglicht es Ihnen, Vorlagen herunterzuladen und eigene Codeschnipsel als Gists hochzuladen. Im Bereich \"Einstellungen\" können Sie die Sprache des Editors, die Schriftgröße des Datensatzes und einige andere wichtige Einstellungen festlegen.",
	"linting-and-spelling": "Der Editor hat eine eingebaute Rechtschreibprüfung - und zeigt Ihnen, wenn Sie einen Tippfehler gemacht haben. Linting bezieht sich auf die Art und Weise, wie Sie Ihren Code sauber halten. Dies erhöht die Lesbarkeit und stellt sicher, dass der Stil Ihres Codes konsistent ist.",
	"live-preview": "Hier finden Sie die Live-Vorschau - also das, was Ihre Benutzer zu sehen bekommen. Das Prinzip ist bekannt. WYSIWYG! Zurückübersetzt ins Englische: What you see is what you get!",
	"markdown-help": "Das Erlernen der Markdown-Auszeichnungssprache ist nicht schwierig, was ein Vorteil gegenüber HTML ist. Sie ist viel einfacher zu lesen - und beschleunigt die Arbeit immens.",
	"monaco-editor": "Hier auf der linken Seite finden Sie die Codebasis. Eigentlich ganz vertraut, wenn Sie sich schon mit HTML oder Markdown beschäftigt haben. Aber keine Sorge: Das Ganze erschließt sich schnell - und so beängstigend es auch aussieht, Sie werden es leicht lernen.",
	"opened-wizard": "Dieses Fenster zeigt und erklärt alle Attribute, die unser Polaroid hat. Wenn ein Attribut angeklickt wird, wird es in unserem Code verwendet. In unserem Fall ist es bisher nichts weiter als das Attribut image, das eine url enthält.",
	"polaroid-double-click": "Bitte doppelklicken Sie auf das Wort Polaroid. Nun wird das entsprechende Element auf der rechten Seite hervorgehoben.",
	"polaroid-hover": "Versuchen Sie, mit der Maus über das Wort \"Polaroid\" zu fahren. Sie sehen: Es erscheint eine kleine Erklärung. Sie können auch mit der Maus über die Attribute des Elements fahren. Bei dem Bild sehen Sie, dass es sich um eine Zeichenkette handelt, die offensichtlich auf eine URL-Adresse verweist. Wenn Sie wollen, können Sie das Bild ersetzen. - Jedes Element im Editor kann auf diese Weise erkundet werden.",
	"polaroid-lightbulb": "Wenn Sie auf den Namen \"Polaroid\" klicken, erscheint eine kleine Glühbirne über dem Polaroid-Komponentencode. Wenn Sie darauf klicken, haben Sie mehrere Optionen. Zunächst können Sie die Ansicht die Komponente sichtbar machen, oder Sie können auf GitHub bestimmte Probleme ablegen und Verbesserungen vorschlagen.",
	"polaroid-wizard": "Wenn Sie mit dem Mauszeiger über das Element fahren, erscheint ein kleiner roter Rahmen mit ein paar Schaltflächen in der rechten oberen Ecke, mit denen Sie verschiedene Dinge tun können. Um das Polaroid anzupassen, klicken wir auf die erste Schaltfläche mit Zahnradsymbol, um den \"Komponenten-Assistenten\" zu öffnen.",
	"translate-lesson": "Sie haben die Möglichkeit, die gesamte Lektion in eine Sprache Ihrer Wahl zu übersetzen - wir bieten insgesamt 10 Sprachen an. Darüber hinaus können Sie auch einzelne Passagen übersetzen. Dazu müssen Sie einen Text markieren, mit der rechten Maustaste klicken und im Kontextmenü den Befehl Übersetzen wählen.",
	"two-panes": "Wie Sie sehen können: Der Editor ist zweigeteilt (Sie können den Balken in der Mitte sogar verschieben)"
}
