{
	"animation-help": "Τα κινούμενα σχέδια CSS είναι απίστευτα χρήσιμα όταν θέλετε να κάνετε τη σελίδα σας πιο πικάντικη. Σας παρέχουμε μερικές προεπιλογές. Θα πρέπει να τις τοποθετήσετε στο χαρακτηριστικό `style` του συστατικού σας, π.χ. animation: 'anim-fade-in 3s'.",
	"back-in-editor": "Βρισκόμαστε λοιπόν στην αντίστοιχη γραμμή στην αριστερή πλευρά. Δημιουργήσαμε με μαγικό τρόπο αυτό το μικρό Polaroid. Θα μπορούσατε εξίσου εύκολα να έχετε πληκτρολογήσει αυτό το κείμενο εδώ. Αλλά για να σας διευκολύνουμε, σας το αφαιρέσαμε από τα χέρια σας.",
	"change-online-mode": "Εδώ μπορείτε να καθορίσετε αν το μάθημά σας αλληλεπιδρά με τον διακομιστή στον επεξεργαστή (online). Ωστόσο, αυτό προϋποθέτει ότι ο διακομιστής έχει καθοριστεί στο προοίμιο. Εάν αυτό δεν συμβαίνει, το κουμπί είναι γκριζαρισμένο - δηλαδή δεν μπορεί να επιλεγεί.",
	"click-button-to-jump": "Απλά κάντε κλικ σε αυτό το μικρό στοιχείο - αυτό θα μεταβεί στην αντίστοιχη γραμμή στον επεξεργαστή.",
	"component-wizard-0": "Στον Οδηγό συστατικών έχετε πλήρη έλεγχο του συστατικού σας. Μπορείτε να δείτε πώς λειτουργεί, ποιες ιδιότητες μπορείτε να αλλάξετε - και αν σας αρέσει το αποτέλεσμα, μπορείτε να πατήσετε το κουμπί \"Εισαγωγή\" και το τροποποιημένο συστατικό θα αντιγραφεί στον επεξεργαστή.",
	"component-wizard-1": "Εδώ μπορείτε να δείτε τον κώδικα που ορίζει την εμφάνιση του στοιχείου. Μπορείτε να τον επεξεργαστείτε χειροκίνητα. Ενημερώνεται επίσης αυτόματα όταν κάνετε κλικ σε ένα νέο χαρακτηριστικό, για παράδειγμα. Απλά δώστε προσοχή!",
	"component-wizard-10": "Ορισμένα εξαρτήματα είναι τεράστια και μπορεί να είναι δύσκολο να βρείτε ένα χαρακτηριστικό. Εδώ μπορείτε να το αναζητήσετε. Το πλεονέκτημα αυτού είναι ότι μπορείτε να επικεντρωθείτε σε αυτό που σας ενδιαφέρει.",
	"component-wizard-11": "Απλά δοκιμάστε το, προσθέστε ένα χαρακτηριστικό και αλλάξτε την τιμή του. Τίποτα δεν μπορεί να πάει στραβά!",
	"component-wizard-12": "Αν κάνετε κλικ εδώ, το στοιχείο θα ενημερωθεί στον επεξεργαστή και θα έχει την εμφάνιση που θέλετε.",
	"component-wizard-13": "Αν δεν σας αρέσουν οι αλλαγές σας, μπορείτε να τις αναιρέσετε εδώ. Το εξάρτημα φαίνεται ακριβώς όπως ήταν πριν ανοίξετε τον οδηγό.",
	"component-wizard-14": "Αν κάνετε κλικ εδώ, θα κλείσετε τον οδηγό συστατικών - αλλά δεν θα αποθηκευτεί τίποτα.",
	"component-wizard-2": "Αυτό είναι το τμήμα προεπισκόπησης. Έτσι ακριβώς θα φαίνεται το στοιχείο αργότερα στον επεξεργαστή.",
	"component-wizard-3": "Εδώ μπορείτε να βρείτε όλα τα χαρακτηριστικά που είναι διαθέσιμα για το στοιχείο.",
	"component-wizard-4": "Με ένα κλικ μπορείτε να ορίσετε αν το εν λόγω χαρακτηριστικό θα πρέπει να χρησιμοποιείται ή όχι. Απλά κάντε κλικ σε αυτό και δείτε πώς αλλάζει ο κώδικας.",
	"component-wizard-5": "Με ορισμένα χαρακτηριστικά δεν είναι άμεσα σαφές τι κάνουν. Αυτή η περιγραφή σας το εξηγεί.",
	"component-wizard-6": "Για τα ενεργά χαρακτηριστικά, μπορείτε εδώ να αλλάξετε την τιμή και να παρατηρήσετε το ενημερωμένο στοιχείο στον κώδικα και την προεπισκόπηση.",
	"component-wizard-7": "Πρόκειται για ένα πεδίο πληροφοριών που καθορίζει τον τύπο δεδομένων του χαρακτηριστικού. Για παράδειγμα, ένα boolean είναι η τιμή \"αληθής\" ή \"ψευδής\", ένας πίνακας αναφέρεται σε μια λίστα στοιχείων.",
	"component-wizard-8": "Εδώ θα βρείτε την προεπιλεγμένη τιμή που ορίζεται εάν δεν έχετε ορίσει χειροκίνητα το χαρακτηριστικό.",
	"component-wizard-9": "Εδώ μπορείτε να φιλτράρετε τη λίστα των χαρακτηριστικών για να εμφανίσετε μόνο τα χαρακτηριστικά που χρησιμοποιούνται ή δεν χρησιμοποιούνται ακόμη. Έχετε την επιλογή!",
	"header-preview-button": "Με το κουμπί προεπισκόπησης έχετε ένα κουμπί με το οποίο μπορείτε να δείτε τη σελίδα όπως εμφανίζεται στον ιστό. Αν το πατήσετε ξανά, επιστρέφετε στην προβολή του επεξεργαστή.",
	"header-role-in-preview": "Εδώ μπορείτε να επιλέξετε το ρόλο σας - και να δείτε τη σελίδα όπως θα την έβλεπε ένας ανώνυμος χρήστης, ένας εγγεγραμμένος χρήστης, ο ιδιοκτήτης του μαθήματος ή ο φοιτητής που είναι εγγεγραμμένος σε ένα συγκεκριμένο μάθημα.",
	"keyboard-shortcuts": "Αν θέλετε να επιταχύνετε τις διαδικασίες, οι συντομεύσεις είναι μεγάλη βοήθεια. Μπορείτε να τις βρείτε εδώ.",
	"link-docs": "Εδώ ανοίγετε την τεκμηρίωση του ISLE, την οποία μπορείτε επίσης να βρείτε στο Διαδίκτυο στη διεύθυνση https://isledocs.com/.",
	"link-export": "Αυτό το κουμπί ανοίγει μια σελίδα όπου μπορείτε να ανεβάσετε το μάθημά σας στο διακομιστή. Πρέπει να έχετε τη διεύθυνση και τα διαπιστευτήρια του διακομιστή για να το κάνετε αυτό. - Για να συνεχίσετε με το σεμινάριο, κάντε κλικ στο κουμπί Επιστροφή στον συντάκτη.",
	"link-settings": "Η σελίδα ρυθμίσεων σας δείχνει με ποιο email χρήστη είστε συνδεδεμένοι σε ποιον διακομιστή. Η ενσωμάτωση του GitHub (η οποία απαιτεί να είστε χρήστης του Github) σας επιτρέπει να κατεβάζετε πρότυπα και να ανεβάζετε τα δικά σας αποσπάσματα κώδικα ως gists. Στην ενότητα ρυθμίσεων μπορείτε να ορίσετε τη γλώσσα του επεξεργαστή, το μέγεθος της γραμματοσειράς εγγραφής και ορισμένες άλλες σημαντικές ρυθμίσεις.",
	"linting-and-spelling": "Ο συντάκτης διαθέτει ενσωματωμένο ορθογραφικό έλεγχο - και σας δείχνει αν κάνατε κάποιο τυπογραφικό λάθος. Το Linting αναφέρεται στον τρόπο με τον οποίο διατηρείτε τον κώδικά σας καθαρό. Αυτό αυξάνει την αναγνωσιμότητα και διασφαλίζει ότι το στυλ του κώδικά σας είναι συνεπές.",
	"live-preview": "Εδώ μπορείτε να βρείτε τη ζωντανή προεπισκόπηση, δηλαδή αυτό που βλέπουν οι χρήστες σας. Η αρχή είναι γνωστή. WYSIWYG! Μεταφρασμένο στα αγγλικά: Αυτό που βλέπετε είναι αυτό που παίρνετε!",
	"markdown-help": "Η εκμάθηση της γλώσσας σήμανσης Markdown δεν είναι δύσκολη, γεγονός που αποτελεί πλεονέκτημα έναντι της HTML. Είναι πολύ πιο εύκολο να διαβαστεί - και επιταχύνει πάρα πολύ την εργασία.",
	"monaco-editor": "Εδώ στην αριστερή πλευρά θα βρείτε τη βάση κώδικα. Στην πραγματικότητα αρκετά οικεία, αν έχετε ήδη ασχοληθεί με HTML ή Markdown. Αλλά μην ανησυχείτε: Το όλο θέμα ανοίγει γρήγορα - και όσο τρομακτικό κι αν φαίνεται, θα το μάθετε εύκολα.",
	"opened-wizard": "Αυτό το παράθυρο δείχνει και εξηγεί όλα τα χαρακτηριστικά που διαθέτει η Polaroid μας. Εάν κάνετε κλικ σε ένα χαρακτηριστικό, θα χρησιμοποιηθεί στον κώδικά μας. Στην περίπτωσή μας, μέχρι στιγμής, δεν είναι τίποτα περισσότερο από το χαρακτηριστικό image, το οποίο περιέχει ένα url.",
	"polaroid-double-click": "Κάντε διπλό κλικ στη λέξη Polaroid. Τώρα θα επισημανθεί το αντίστοιχο στοιχείο στα δεξιά.",
	"polaroid-hover": "Δοκιμάστε να περάσετε με το ποντίκι σας πάνω από τη λέξη \"Polaroid\". Βλέπετε: Εμφανίζεται μια μικρή επεξήγηση. Μπορείτε επίσης να περάσετε με το ποντίκι πάνω από τα χαρακτηριστικά του στοιχείου. Για την εικόνα, βλέπετε ότι πρόκειται για μια συμβολοσειρά που προφανώς παραπέμπει σε μια διεύθυνση URL. Αν θέλετε, μπορείτε να αντικαταστήσετε την εικόνα. - Κάθε στοιχείο στον επεξεργαστή μπορεί να εξερευνηθεί με αυτόν τον τρόπο.",
	"polaroid-lightbulb": "Αν κάνετε κλικ στο όνομα \"Polaroid\", εμφανίζεται ένα λαμπάκι πάνω από τον κωδικό του στοιχείου Polaroid. Αν κάνετε κλικ σε αυτήν, έχετε διάφορες επιλογές. Πρώτον, μπορείτε να κάνετε την προβολή να κάνει το συστατικό ορατό ή μπορείτε να καταθέσετε συγκεκριμένα ζητήματα και να προτείνετε βελτιώσεις στο GitHub.",
	"polaroid-wizard": "Αν περάσετε το ποντίκι πάνω από το στοιχείο, εμφανίζεται ένα μικρό κόκκινο πλαίσιο με μερικά κουμπιά στην επάνω δεξιά γωνία, με τα οποία μπορείτε να κάνετε διάφορα πράγματα. Για να προσαρμόσουμε το Polaroid, κάνουμε κλικ στο πρώτο κουμπί με το εικονίδιο του οδοντωτού τροχού για να ανοίξει ο \"Οδηγός στοιχείων\".",
	"translate-lesson": "Έχετε τη δυνατότητα να μεταφράσετε ολόκληρο το μάθημά σας σε μια γλώσσα της επιλογής σας - παρέχουμε συνολικά 10 γλώσσες. Επιπλέον, μπορείτε επίσης να μεταφράσετε μεμονωμένα αποσπάσματα. Για να το κάνετε αυτό, πρέπει να επισημάνετε ένα κείμενο, να κάνετε δεξί κλικ και να επιλέξετε την εντολή μετάφρασης από το μενού περιβάλλοντος.",
	"two-panes": "Όπως μπορείτε να δείτε: Ο επεξεργαστής χωρίζεται σε δύο μέρη (μπορείτε ακόμη και να μετακινήσετε τη μπάρα στη μέση). Με αυτόν τον τρόπο μπορείτε να ορίσετε πόσο χώρο θα καταλαμβάνει το εκάστοτε παράθυρο."
}
