{
	"animation-help": "CSS animations are incredibly handy when you want to spice up your page. We have provided some presets for you. You need to put them in the `style` attribute of your component, e.g. animation: 'anim-fade-in 3s'.",
	"back-in-editor": "So here we are at the respective line on the left-side. We magically created this  little Polaroid. You could just as easily have typed this text here. But to make it easy, we've taken it off your hands.",
	"change-online-mode": "Here you can specify whether your lesson interacts with the server in the editor (online). However, this requires that the server is specified in the preamble. If this is not the case, the button is grayed out - i.e. not selectable.",
	"click-button-to-jump": "Just click on this small element - that will jump to the respective line in the editor.",
	"component-wizard-0": "In the Component Wizard you have full control over your component. You can see how it works, which attributes you can change - and if you like the result, you may press `Insert` button and the changed component will be copied into the editor.",
	"component-wizard-1": "Here you can see the code that defines the appearance of the component. You can edit it manually. It also updates automatically when you click on a new attribute, for example. Just pay attention to it!",
	"component-wizard-10": "Some components are huge and it can be hard to find an attribute. Here you can search for it. The advantage of this is that you can focus on what you are interested in.",
	"component-wizard-11": "Just try it, add an attribute and change its value. Nothing can go wrong!",
	"component-wizard-12": "If you click here, the component will be updated in the editor and will look as you want.",
	"component-wizard-13": "If you don't like your changes, you can undo them here. The component looks exactly as it did before you opened the wizard.",
	"component-wizard-14": "If you click here, you will close the component wizard - but nothing will be saved.",
	"component-wizard-2": "This is the preview section. This is exactly how the component will look later in the editor.",
	"component-wizard-3": "Here you can find all the attributes that are available for the component.",
	"component-wizard-4": "With one click you can set whether the attribute in question should be used or not. Just click on it and see how the code changes.",
	"component-wizard-5": "With some attributes it is not immediately clear what they do. This description explains it to you.",
	"component-wizard-6": "For active attributes, you can here change the value and observe the updated component in the code and preview.",
	"component-wizard-7": "This is an info field that specifies the data type of the attribute. For example, a boolean is `true` or `false` value, an array refers to a list of elements",
	"component-wizard-8": "Here you will find the default value that is set if you have not manually set the attribute.",
	"component-wizard-9": "Here you can filter the list of attributes to only display the currently used or not yet used attributes. You have the choice!",
	"header-preview-button": "With the preview button you have a button where you can see the page as it appears on the web. If you press it again, it jumps back to the editor view.",
	"header-role-in-preview": "Here you can select your role - and see the page as an anonymous user would see it, a registered user, the course owner, or the student who is enrolled in a particular course.",
	"keyboard-shortcuts": "If you want to speed up processes, shortcuts are a great help. You can find them listed here.",
	"link-docs": "Here you open the ISLE documentation, which you can also find on the Internet at https://isledocs.com/",
	"link-export": "This button opens a page where you can upload your lesson to the server. You must have the server address and credentials to do this. - To continue with the tutorial, please click the Back to Editor button.",
	"link-settings": "The settings page shows you under which user email you are connected to which server. The GitHub integration (which requires you to be a Github user) allows you to download templates and upload your own code snippets as gists. In the settings section you can set the editor language, record font size and some other important settings.",
	"linting-and-spelling": "The editor has a built-in spell checker - and shows you if you made a typo. Linting refers to the way you keep your code clean. This increases readability and ensures that the style of your code is consistent.",
	"live-preview": "Here you can find the live preview - that is, what your users get to see. The principle is familiar. WYSIWYG! Translated back into English: What you see is what you get!",
	"markdown-help": "Learning the Markdown markup language is not difficult, which is an advantage over HTML. It is much easier to read - and speeds up the work immensely.",
	"monaco-editor": "Here on the left side you find the code base. Actually quite familiar, if you have already dealt with HTML or Markdown. But don't worry: The whole thing opens up quickly - and as scary as it looks, you will learn it easily.",
	"opened-wizard": "This window shows and explains all the attributes that our Polaroid has. If an attribute is clicked, it will be used in our code. In our case, so far, it is nothing more than the image attribute, which contains a url.",
	"polaroid-double-click": "Please double-click on the word Polaroid. Now the corresponding element on the right will be highlighted.",
	"polaroid-hover": "Try hovering over the word “Polaroid” with your mouse. You see: A small explanation appears. You can also hover over the attributes of the element. For the image, you see that it is a string that obviously points to a URL address. If you want, you can replace the image. - Every element in the editor can be explored in this way.",
	"polaroid-lightbulb": "If you click on the “Polaroid” name, a little light bulb appears above the Polaroid component code. If you click on it, you have several options. First, you can make the view make the component visible, or you can file specific issues and suggest improvements on GitHub.",
	"polaroid-wizard": "If you hover over the element, a small red frame appears with a few buttons in the top-right corner, with which you can do various things. To customize the Polaroid, we click on the first button with cogwheel icon to open the \"Component Wizard\".",
	"translate-lesson": "You have the option to translate your entire lesson into a language of your choice - we provide a total of 10 languages. In addition, you can also translate individual passages. To do this, you need to highlight a text, right-click and select the translate command from the context menu.",
	"two-panes": "As you can see: The editor is divided into two parts (you can even move the bar in the middle). This way you can define how much space the respective pane should take."
}
