{
	"animation-help": "Las animaciones CSS son increíblemente útiles cuando quieres darle vida a tu página. Hemos proporcionado algunos preajustes para usted. Tienes que ponerlos en el atributo `style` de tu componente, por ejemplo, animation: 'anim-fade-in 3s'.",
	"back-in-editor": "Así que aquí estamos en la línea respectiva del lado izquierdo. Hemos creado mágicamente esta pequeña Polaroid. Podrías haber escrito fácilmente este texto aquí. Pero para hacerlo más fácil, te lo hemos quitado de las manos.",
	"change-online-mode": "Aquí puede especificar si su lección interactúa con el servidor en el editor (en línea). Sin embargo, esto requiere que el servidor esté especificado en el preámbulo. Si no es así, el botón aparece en gris, es decir, no se puede seleccionar.",
	"click-button-to-jump": "Basta con hacer clic en este pequeño elemento para saltar a la línea correspondiente en el editor.",
	"component-wizard-0": "En el Asistente para componentes tiene un control total sobre su componente. Puede ver cómo funciona, qué atributos puede cambiar - y si le gusta el resultado, puede pulsar el botón `Insert` y el componente modificado se copiará en el editor.",
	"component-wizard-1": "Aquí puede ver el código que define la apariencia del componente. Puede editarlo manualmente. También se actualiza automáticamente cuando se hace clic en un nuevo atributo, por ejemplo. ¡Sólo tienes que prestarle atención!",
	"component-wizard-10": "Algunos componentes son enormes y puede ser difícil encontrar un atributo. Aquí puedes buscarlo. La ventaja de esto es que puedes centrarte en lo que te interesa.",
	"component-wizard-11": "Sólo tienes que probarlo, añadir un atributo y cambiar su valor. Nada puede salir mal.",
	"component-wizard-12": "Si hace clic aquí, el componente se actualizará en el editor y tendrá el aspecto deseado.",
	"component-wizard-13": "Si no le gustan los cambios, puede deshacerlos aquí. El componente tiene el mismo aspecto que antes de abrir el asistente.",
	"component-wizard-14": "Si hace clic aquí, cerrará el asistente de componentes, pero no se guardará nada.",
	"component-wizard-2": "Esta es la sección de vista previa. Así es exactamente como se verá el componente más adelante en el editor.",
	"component-wizard-3": "Aquí puede encontrar todos los atributos disponibles para el componente.",
	"component-wizard-4": "Con un solo clic puedes establecer si el atributo en cuestión debe ser utilizado o no. Basta con hacer clic en él y ver cómo cambia el código.",
	"component-wizard-5": "En el caso de algunos atributos no está claro de inmediato lo que hacen. Esta descripción te lo explica.",
	"component-wizard-6": "En el caso de los atributos activos, puede cambiar aquí el valor y observar el componente actualizado en el código y la vista previa.",
	"component-wizard-7": "Es un campo informativo que especifica el tipo de datos del atributo. Por ejemplo, un booleano es un valor `true` o `false`, un array se refiere a una lista de elementos",
	"component-wizard-8": "Aquí encontrará el valor por defecto que se establece si no ha configurado manualmente el atributo.",
	"component-wizard-9": "Aquí puede filtrar la lista de atributos para que sólo se muestren los atributos utilizados actualmente o los que aún no se han utilizado. Usted puede elegir.",
	"header-preview-button": "Con el botón de vista previa tienes un botón donde puedes ver la página tal y como aparece en la web. Si lo vuelves a pulsar, salta de nuevo a la vista del editor.",
	"header-role-in-preview": "Aquí puede seleccionar su rol - y ver la página como la vería un usuario anónimo, un usuario registrado, el propietario del curso, o el estudiante que está inscrito en un curso en particular.",
	"keyboard-shortcuts": "Si quieres acelerar los procesos, los atajos son una gran ayuda. Puedes encontrarlos en esta lista.",
	"link-docs": "Aquí se abre la documentación de ISLE, que también se puede encontrar en Internet en https://isledocs.com/",
	"link-export": "Este botón abre una página en la que puede cargar su lección en el servidor. Debe tener la dirección del servidor y las credenciales para hacerlo. - Para continuar con el tutorial, haga clic en el botón Volver al editor.",
	"link-settings": "La página de configuración te muestra bajo qué correo electrónico de usuario estás conectado a qué servidor. La integración con GitHub (que requiere que seas usuario de Github) te permite descargar plantillas y subir tus propios fragmentos de código como gists. En la sección de ajustes puedes establecer el idioma del editor, el tamaño de la fuente del registro y algunos otros ajustes importantes.",
	"linting-and-spelling": "El editor tiene un corrector ortográfico incorporado, y te muestra si has cometido una errata. Linting se refiere a la forma de mantener el código limpio. Esto aumenta la legibilidad y asegura que el estilo de tu código sea consistente.",
	"live-preview": "Aquí puede encontrar la vista previa en vivo, es decir, lo que sus usuarios pueden ver. El principio es conocido. ¡WYSIWYG! Traducido al inglés: Lo que ves es lo que obtienes.",
	"markdown-help": "Aprender el lenguaje de marcado Markdown no es difícil, lo que supone una ventaja sobre el HTML. Es mucho más fácil de leer - y acelera el trabajo inmensamente.",
	"monaco-editor": "Aquí, en el lado izquierdo, se encuentra la base de código. En realidad es bastante familiar, si ya has tratado con HTML o Markdown. Pero no se preocupe: todo se abre rápidamente - y aunque parezca aterrador, lo aprenderá fácilmente.",
	"opened-wizard": "Esta ventana muestra y explica todos los atributos que tiene nuestra Polaroid. Si se hace clic en un atributo, se utilizará en nuestro código. En nuestro caso, hasta ahora, no es más que el atributo image, que contiene una url.",
	"polaroid-double-click": "Haga doble clic en la palabra Polaroid. Ahora se resaltará el elemento correspondiente de la derecha.",
	"polaroid-hover": "Prueba a pasar el ratón por encima de la palabra \"Polaroid\". Lo verás: Aparece una pequeña explicación. También puedes pasar el ratón por encima de los atributos del elemento. En el caso de la imagen, ves que es una cadena que obviamente apunta a una dirección URL. Si quieres, puedes reemplazar la imagen. - Todos los elementos del editor pueden ser explorados de esta manera.",
	"polaroid-lightbulb": "Si haces clic en el nombre \"Polaroid\", aparece una pequeña bombilla sobre el código del componente Polaroid. Si haces clic en ella, tienes varias opciones. En primer lugar, puedes hacer que la vista haga visible el componente, o puedes presentar problemas específicos y sugerir mejoras en GitHub.",
	"polaroid-wizard": "Si pasas el ratón por encima del elemento, aparece un pequeño marco rojo con unos cuantos botones en la esquina superior derecha, con los que puedes hacer varias cosas. Para personalizar la Polaroid, hacemos clic en el primer botón con icono de rueda dentada para abrir el \"Asistente para componentes\".",
	"translate-lesson": "Tiene la opción de traducir toda la lección al idioma que desee: ofrecemos un total de 10 idiomas. Además, también puede traducir pasajes individuales. Para ello, tienes que resaltar un texto, hacer clic con el botón derecho del ratón y seleccionar el comando de traducción en el menú contextual.",
	"two-panes": "Como puedes ver: El editor está dividido en dos partes (incluso se puede mover la barra en el centro)"
}
