{
	"animation-help": "CSS-animatsioonid on uskumatult kasulikud, kui soovite oma lehte vürtsitada. Oleme teile esitanud mõned eelseadistused. Sa pead need panema oma komponendi atribuuti `style`, näiteks animatsioon: 'anim-fade-in 3s'.",
	"back-in-editor": "Nii et siin oleme vastaval joonel vasakul pool. Maagiliselt lõime selle väikese polaroidi. Sama hästi oleksite võinud selle teksti ka siia kirjutada. Aga et asi oleks lihtne, võtsime selle teie käest ära.",
	"change-online-mode": "Siin saate määrata, kas teie õppetund suhtleb serveriga redaktoris (online). See eeldab aga, et server on määratud sissejuhatuses. Kui see ei ole nii, on nupp hall - st ei ole valitav.",
	"click-button-to-jump": "Lihtsalt klõpsake sellel väikesel elemendil - see hüppab redaktori vastavale reale.",
	"component-wizard-0": "Komponentide juhendis on teil täielik kontroll oma komponendi üle. Saate näha, kuidas see töötab, milliseid atribuute saate muuta - ja kui tulemus teile meeldib, võite vajutada nuppu `Insert` ja muudetud komponent kopeeritakse redaktorisse.",
	"component-wizard-1": "Siin näete koodi, mis määrab komponendi välimuse. Saate seda käsitsi muuta. Samuti uuendatakse seda automaatselt, kui klõpsate näiteks uuel atribuudil. Lihtsalt pöörake sellele tähelepanu!",
	"component-wizard-10": "Mõned komponendid on suured ja atribuuti võib olla raske leida. Siin saate seda otsida. Selle eelis on see, et saate keskenduda sellele, mis teid huvitab.",
	"component-wizard-11": "Lihtsalt proovige seda, lisage atribuut ja muutke selle väärtust. Midagi ei saa minna valesti!",
	"component-wizard-12": "Kui klõpsate siin, uuendatakse komponenti redaktoris ja see näeb välja nii, nagu soovite.",
	"component-wizard-13": "Kui muudatused ei meeldi, saate need siinkohal tagasi võtta. Komponent näeb välja täpselt nii, nagu see oli enne võluri avamist.",
	"component-wizard-14": "Kui klõpsate siin, sulgete komponendi viisardi, kuid midagi ei salvestata.",
	"component-wizard-2": "See on eelvaate osa. See on täpselt see, kuidas komponent hiljem redaktoris välja näeb.",
	"component-wizard-3": "Siit leiate kõik komponendi jaoks kättesaadavad atribuudid.",
	"component-wizard-4": "Ühe klõpsuga saate määrata, kas kõnealust atribuuti tuleks kasutada või mitte. Lihtsalt klõpsake sellel ja vaadake, kuidas kood muutub.",
	"component-wizard-5": "Mõne atribuudi puhul ei ole kohe selge, mida nad teevad. See kirjeldus selgitab seda teile.",
	"component-wizard-6": "Aktiivsete atribuutide puhul saate siin muuta väärtust ja jälgida uuendatud komponenti koodis ja eelvaates.",
	"component-wizard-7": "See on infoväli, mis määrab atribuudi andmetüübi. Näiteks boolean on \"tõene\" või \"vale\" väärtus, array viitab elementide loetelule.",
	"component-wizard-8": "Siit leiate vaikeväärtuse, mis on määratud, kui te ei ole atribuuti käsitsi seadistanud.",
	"component-wizard-9": "Siin saate filtreerida atribuutide nimekirja, et kuvada ainult hetkel kasutatud või veel kasutamata atribuute. Teil on valikuvõimalus!",
	"header-preview-button": "Eelvaate nupu abil on teil nupp, mille abil saate näha lehte sellisena, nagu see veebis ilmub. Kui vajutate seda uuesti, hüppab see tagasi redaktsiooni vaate juurde.",
	"header-role-in-preview": "Siin saate valida oma rolli - ja näha lehte nii, nagu seda näeks anonüümne kasutaja, registreeritud kasutaja, kursuse omanik või üliõpilane, kes on konkreetsele kursusele registreerunud.",
	"keyboard-shortcuts": "Kui soovite protsesse kiirendada, on otseteedest suur abi. Need on loetletud siin.",
	"link-docs": "Siit avaneb ISLE dokumentatsioon, mille leiad ka internetist aadressil https://isledocs.com/.",
	"link-export": "See nupp avab lehe, kus saate oma õppetundi serverisse üles laadida. Selleks peab teil olema serveri aadress ja volitused. - Õpetusega jätkamiseks klõpsake nupule Back to Editor.",
	"link-settings": "Seadete lehel näete, millise kasutaja e-posti all olete millise serveriga ühendatud. GitHubi integratsioon (mis eeldab, et olete Githubi kasutaja) võimaldab teil laadida alla malle ja laadida üles oma koodilõike gistidena. Seadete sektsioonis saate määrata redaktori keele, kirjasuuruse ja mõned muud olulised seaded.",
	"linting-and-spelling": "Redaktoril on sisseehitatud õigekirjakontroll - ja see näitab teile, kui olete teinud trükivigu. Linting viitab sellele, kuidas te oma koodi puhtana hoiate. See suurendab loetavust ja tagab, et teie koodi stiil on järjepidev.",
	"live-preview": "Siit leiate otse-eelvaate - see tähendab, mida teie kasutajad saavad näha. Põhimõte on tuttav. WYSIWYG! Tagasi inglise keelde tõlgituna: Mida sa näed, seda sa ka saad!",
	"markdown-help": "Markdown-märgistuskeele õppimine ei ole keeruline, mis on eeliseks HTML-i ees. Seda on palju lihtsam lugeda - ja see kiirendab tööd tohutult.",
	"monaco-editor": "Siin vasakul leiate koodibaasi. Tegelikult üsna tuttav, kui olete juba HTML-i või Markdowniga tegelenud. Aga ärge muretsege: kogu asi avaneb kiiresti - ja nii hirmuäratav kui see ka ei tundu, õpite selle hõlpsasti ära.",
	"opened-wizard": "See aken näitab ja selgitab kõiki atribuute, mis meie Polaroidil on. Kui atribuuti klõpsatakse, kasutatakse seda meie koodis. Meie puhul ei ole see seni midagi muud kui atribuut image, mis sisaldab url-i.",
	"polaroid-double-click": "Palun tehke topeltklõps sõnal Polaroid. Nüüd tõstetakse vastav element paremal pool esile.",
	"polaroid-hover": "Proovige hiirega sõna \"Polaroid\" kohal hõljuda. Näete: Ilmub väike selgitus. Saate hõljuda ka elemendi atribuutide kohal. Pildi puhul näete, et tegemist on stringiga, mis ilmselgelt osutab URL-aadressile. Kui soovite, võite pildi asendada. - Iga elementi redaktoris saab sel viisil uurida.",
	"polaroid-lightbulb": "Kui klõpsate nimetusel \"Polaroid\", ilmub Polaroidi komponendi koodi kohal väike lambike. Kui klõpsate sellel, on teil mitu võimalust. Esiteks saate teha vaate, mis muudab komponendi nähtavaks, või saate esitada konkreetseid probleeme ja teha parandusettepanekuid GitHubis.",
	"polaroid-wizard": "Kui viibid elemendi kohal, ilmub väike punane raam, mille paremas ülanurgas on mõned nupud, millega saad teha mitmesuguseid toiminguid. Polaroidi kohandamiseks vajutame esimesele hammasratta ikooniga nupule, et avada \"Component Wizard\".",
	"translate-lesson": "Teil on võimalus tõlkida kogu õppetund teie valitud keelde - pakume kokku 10 keelt. Lisaks saate tõlkida ka üksikuid lõike. Selleks tuleb tekst esile tõsta, teha paremklõps ja valida kontekstmenüüst käsk \"Tõlkida\".",
	"two-panes": "Nagu näete: Redaktor on jagatud kahte ossa (saate isegi keskel asuvat riba liigutada). Nii saate määrata, kui palju ruumi vastav paan peaks võtma."
}
