{
	"animation-help": "CSS-animaatiot ovat erittäin käteviä, kun haluat piristää sivua. Olemme tarjonneet sinulle muutamia esiasetuksia. Sinun täytyy laittaa ne komponenttisi `style`-attribuuttiin, esimerkiksi animation: 'anim-fade-in 3s'.",
	"back-in-editor": "Olemme siis vasemmalla puolella olevalla vastaavalla viivalla. Loimme maagisesti tämän pienen polaroidin. Yhtä hyvin olisit voinut kirjoittaa tämän tekstin tähän. Mutta helpottaaksemme asiaa, otimme sen pois käsistäsi.",
	"change-online-mode": "Tässä voit määrittää, onko oppitunti vuorovaikutuksessa palvelimen kanssa editorissa (verkossa). Tämä edellyttää kuitenkin, että palvelin on määritetty johdannossa. Jos näin ei ole, painike on harmaana eli sitä ei voi valita.",
	"click-button-to-jump": "Napsauta tätä pientä elementtiä - se hyppää vastaavalle riville editorissa.",
	"component-wizard-0": "Ohjatussa komponenttiohjelmassa voit hallita komponenttiasi täysin. Näet, miten se toimii, mitä ominaisuuksia voit muuttaa - ja jos pidät lopputuloksesta, voit painaa `Insert`-painiketta, jolloin muutettu komponentti kopioidaan editoriin.",
	"component-wizard-1": "Tässä näet koodin, joka määrittelee komponentin ulkoasun. Voit muokata sitä manuaalisesti. Se päivittyy myös automaattisesti, kun napsautat esimerkiksi uutta attribuuttia. Kiinnitä siihen vain huomiota!",
	"component-wizard-10": "Jotkin osat ovat valtavia, ja voi olla vaikeaa löytää määritteitä. Täältä voit etsiä sitä. Tämän etuna on, että voit keskittyä siihen, mikä sinua kiinnostaa.",
	"component-wizard-11": "Kokeile sitä, lisää attribuutti ja muuta sen arvoa. Mikään ei voi mennä pieleen!",
	"component-wizard-12": "Jos napsautat tätä, komponentti päivitetään editoriin ja se näyttää haluamaltasi.",
	"component-wizard-13": "Jos et pidä muutoksistasi, voit peruuttaa ne täällä. Komponentti näyttää täsmälleen samalta kuin ennen ohjatun toiminnon avaamista.",
	"component-wizard-14": "Jos napsautat tätä, suljet ohjatun komponenttitoiminnon, mutta mitään ei tallenneta.",
	"component-wizard-2": "Tämä on esikatseluosio. Tältä komponentti näyttää myöhemmin editorissa.",
	"component-wizard-3": "Täältä löydät kaikki komponentin käytettävissä olevat attribuutit.",
	"component-wizard-4": "Yhdellä napsautuksella voit määrittää, käytetäänkö kyseistä ominaisuutta vai ei. Klikkaa sitä ja katso, miten koodi muuttuu.",
	"component-wizard-5": "Joidenkin ominaisuuksien kohdalla ei ole heti selvää, mitä ne tekevät. Tämä kuvaus selittää sen sinulle.",
	"component-wizard-6": "Aktiivisten attribuuttien osalta voit muuttaa arvoa ja tarkkailla päivitettyä komponenttia koodissa ja esikatselussa.",
	"component-wizard-7": "Tämä on tietokenttä, joka määrittää attribuutin tietotyypin. Esimerkiksi boolean on `true`- tai `false`-arvo, array viittaa elementtien luetteloon.",
	"component-wizard-8": "Täältä löydät oletusarvon, joka asetetaan, jos et ole määrittänyt ominaisuutta manuaalisesti.",
	"component-wizard-9": "Tässä voit suodattaa attribuuttiluettelon niin, että näytetään vain tällä hetkellä käytetyt tai vielä käyttämättömät attribuutit. Sinulla on mahdollisuus valita!",
	"header-preview-button": "Esikatselupainikkeella on painike, jolla voit nähdä sivun sellaisena kuin se näkyy verkossa. Jos painat sitä uudelleen, siirryt takaisin editorinäkymään.",
	"header-role-in-preview": "Tässä voit valita roolisi - ja nähdä sivun nimettömänä käyttäjänä, rekisteröityneenä käyttäjänä, kurssin omistajana tai tietylle kurssille ilmoittautuneena opiskelijana.",
	"keyboard-shortcuts": "Jos haluat nopeuttaa prosesseja, pikanäppäimet ovat suureksi avuksi. Löydät ne lueteltuina täältä.",
	"link-docs": "Tästä avaat ISLE-asiakirjat, jotka löydät myös Internetistä osoitteesta https://isledocs.com/.",
	"link-export": "Tämä painike avaa sivun, jolla voit ladata oppitunnin palvelimelle. Tätä varten sinulla on oltava palvelimen osoite ja tunnukset. - Voit jatkaa opetusta napsauttamalla Takaisin editoriin -painiketta.",
	"link-settings": "Asetukset-sivulla näet, millä käyttäjän sähköpostilla olet yhteydessä mihinkin palvelimeen. GitHub-integraatio (joka edellyttää, että olet Github-käyttäjä) mahdollistaa mallien lataamisen ja omien koodinpätkien lataamisen gisteinä. Asetukset-osiossa voit asettaa editorin kielen, tallenteen fonttikoon ja joitakin muita tärkeitä asetuksia.",
	"linting-and-spelling": "Editorissa on sisäänrakennettu oikeinkirjoituksen tarkistus - ja se näyttää, jos olet tehnyt kirjoitusvirheen. Linting tarkoittaa tapaa, jolla pidät koodisi puhtaana. Tämä parantaa luettavuutta ja varmistaa, että koodisi tyyli on yhdenmukainen.",
	"live-preview": "Täältä löydät live-esikatselun - eli sen, mitä käyttäjät näkevät. Periaate on tuttu. WYSIWYG! Käännetty takaisin englanniksi: Mitä näet, sitä myös saat!",
	"markdown-help": "Markdown-merkintäkielen oppiminen ei ole vaikeaa, mikä on etu HTML:ään verrattuna. Sitä on paljon helpompi lukea - ja se nopeuttaa työtä valtavasti.",
	"monaco-editor": "Vasemmalla puolella on koodipohja. Oikeastaan aika tuttua, jos olet jo käsitellyt HTML:ää tai Markdownia. Mutta ei hätää: kokonaisuus avautuu nopeasti - ja niin pelottavalta kuin se näyttääkin, opit sen helposti.",
	"opened-wizard": "Tämä ikkuna näyttää ja selittää kaikki Polaroidin ominaisuudet. Jos ominaisuutta napsautetaan, sitä käytetään koodissamme. Meidän tapauksessamme se on toistaiseksi vain image-attribuutti, joka sisältää url-osoitteen.",
	"polaroid-double-click": "Kaksoisnapsauta sanaa Polaroid. Nyt vastaava elementti oikealla puolella korostuu.",
	"polaroid-hover": "Kokeile hiiren viemistä sanan \"Polaroid\" päälle. Näet: Pieni selitys tulee näkyviin. Voit myös viedä hiiren osoittimen elementin attribuuttien päälle. Kuvan kohdalla näet, että se on merkkijono, joka ilmeisesti viittaa URL-osoitteeseen. Voit halutessasi korvata kuvan. - Jokaista editorin elementtiä voi tutkia tällä tavalla.",
	"polaroid-lightbulb": "Jos napsautat Polaroid-nimeä, Polaroid-komponentin koodin yläpuolelle ilmestyy pieni hehkulamppu. Jos napsautat sitä, sinulla on useita vaihtoehtoja. Ensinnäkin voit saada näkymän tekemään komponentin näkyväksi, tai voit jättää erityisiä ongelmia ja ehdottaa parannuksia GitHubissa.",
	"polaroid-wizard": "Jos viet hiiren hiirellä elementin päälle, oikeassa yläkulmassa näkyy pieni punainen kehys, jonka oikeassa yläkulmassa on muutama painike, joilla voit tehdä erilaisia toimintoja. Polaroidin mukauttamiseksi napsautamme ensimmäistä painiketta, jossa on hammasratas-kuvake, avataksemme \"Component Wizardin\".",
	"translate-lesson": "Voit kääntää koko oppitunnin haluamallesi kielelle - tarjoamme yhteensä 10 kieltä. Lisäksi voit kääntää myös yksittäisiä kohtia. Tätä varten sinun on korostettava teksti, napsautettava hiiren kakkospainikkeella ja valittava kontekstivalikosta Käännä-komento."
}
