{
	"animation-help": "Les animations CSS sont incroyablement pratiques lorsque vous souhaitez pimenter votre page. Nous avons fourni quelques présélections pour vous. Vous devez les placer dans l'attribut `style` de votre composant, par exemple animation : 'anim-fade-in 3s'.",
	"back-in-editor": "Nous voici donc à la ligne respective sur le côté gauche. Nous avons créé ce petit Polaroïd par magie. Vous auriez tout aussi bien pu taper ce texte ici. Mais pour vous faciliter la tâche, nous vous l'avons enlevé des mains.",
	"change-online-mode": "Vous pouvez indiquer ici si votre leçon interagit avec le serveur dans l'éditeur (en ligne). Toutefois, cela suppose que le serveur soit spécifié dans le préambule. Si ce n'est pas le cas, le bouton est grisé, c'est-à-dire qu'il ne peut pas être sélectionné.",
	"click-button-to-jump": "Il suffit de cliquer sur ce petit élément - qui passera à la ligne correspondante dans l'éditeur.",
	"component-wizard-0": "Dans l'assistant de composant, vous avez un contrôle total sur votre composant. Vous pouvez voir comment il fonctionne, quels attributs vous pouvez modifier - et si vous aimez le résultat, vous pouvez appuyer sur le bouton \"Insérer\" et le composant modifié sera copié dans l'éditeur.",
	"component-wizard-1": "Vous pouvez voir ici le code qui définit l'apparence du composant. Vous pouvez le modifier manuellement. Il se met également à jour automatiquement lorsque vous cliquez sur un nouvel attribut, par exemple. Il suffit d'y prêter attention !",
	"component-wizard-10": "Certains composants sont énormes et il peut être difficile de trouver un attribut. Ici, vous pouvez le rechercher. L'avantage est que vous pouvez vous concentrer sur ce qui vous intéresse.",
	"component-wizard-11": "Essayez simplement, ajoutez un attribut et modifiez sa valeur. Vous ne pouvez pas vous tromper !",
	"component-wizard-12": "Si vous cliquez ici, le composant sera mis à jour dans l'éditeur et aura l'aspect que vous souhaitez.",
	"component-wizard-13": "Si vous n'aimez pas vos modifications, vous pouvez les annuler ici. Le composant est exactement comme il était avant que vous n'ouvriez l'assistant.",
	"component-wizard-14": "Si vous cliquez ici, vous fermerez l'assistant du composant - mais rien ne sera enregistré.",
	"component-wizard-2": "Voici la section d'aperçu. C'est exactement ce à quoi ressemblera le composant plus tard dans l'éditeur.",
	"component-wizard-3": "Vous trouverez ici tous les attributs disponibles pour le composant.",
	"component-wizard-4": "En un clic, vous pouvez définir si l'attribut en question doit être utilisé ou non. Il suffit de cliquer dessus et de voir comment le code change.",
	"component-wizard-5": "Pour certains attributs, leur fonction n'est pas immédiatement claire. Cette description vous l'explique.",
	"component-wizard-6": "Pour les attributs actifs, vous pouvez ici modifier la valeur et observer le composant mis à jour dans le code et l'aperçu.",
	"component-wizard-7": "Il s'agit d'un champ d'information qui précise le type de données de l'attribut. Par exemple, un booléen est une valeur \"vraie\" ou \"fausse\", un tableau fait référence à une liste d'éléments.",
	"component-wizard-8": "Vous trouverez ici la valeur par défaut qui est définie si vous n'avez pas défini manuellement l'attribut.",
	"component-wizard-9": "Ici, vous pouvez filtrer la liste des attributs pour n'afficher que les attributs actuellement utilisés ou pas encore utilisés. Vous avez le choix !",
	"header-preview-button": "Le bouton d'aperçu vous permet de voir la page telle qu'elle apparaît sur le Web. Si vous appuyez à nouveau sur ce bouton, vous revenez à la vue de l'éditeur.",
	"header-role-in-preview": "Ici, vous pouvez sélectionner votre rôle - et voir la page comme un utilisateur anonyme la verrait, un utilisateur enregistré, le propriétaire du cours, ou l'étudiant qui est inscrit à un cours particulier.",
	"keyboard-shortcuts": "Si vous voulez accélérer les processus, les raccourcis sont d'une grande aide. Vous pouvez en trouver une liste ici.",
	"link-docs": "Vous ouvrez ici la documentation ISLE, que vous pouvez également trouver sur Internet à l'adresse https://isledocs.com/.",
	"link-export": "Ce bouton ouvre une page où vous pouvez télécharger votre leçon sur le serveur. Pour ce faire, vous devez disposer de l'adresse du serveur et des informations d'identification. - Pour continuer avec le tutoriel, veuillez cliquer sur le bouton Retour à l'éditeur.",
	"link-settings": "La page des paramètres vous montre sous quelle adresse électronique d'utilisateur vous êtes connecté à quel serveur. L'intégration GitHub (qui nécessite que vous soyez un utilisateur de Github) vous permet de télécharger des modèles et de charger vos propres extraits de code sous forme de gists. Dans la section des paramètres, vous pouvez définir la langue de l'éditeur, la taille de la police d'enregistrement et d'autres paramètres importants.",
	"linting-and-spelling": "L'éditeur dispose d'un correcteur orthographique intégré - et vous indique si vous avez fait une faute de frappe. Le linting fait référence à la façon dont vous gardez votre code propre. Cela améliore la lisibilité et garantit la cohérence du style de votre code.",
	"live-preview": "Vous trouverez ici l'aperçu en direct, c'est-à-dire ce que vos utilisateurs pourront voir. Le principe est familier. WYSIWYG ! Traduit à nouveau en anglais : Ce que vous voyez, c'est ce que vous obtenez !",
	"markdown-help": "L'apprentissage du langage de balisage Markdown n'est pas difficile, ce qui constitue un avantage par rapport au HTML. Il est beaucoup plus facile à lire - et accélère considérablement le travail.",
	"monaco-editor": "Ici, sur le côté gauche, vous trouverez la base du code. En fait, c'est assez familier, si vous avez déjà traité avec HTML ou Markdown. Mais ne vous inquiétez pas : le tout s'ouvre rapidement - et aussi effrayant que cela puisse paraître, vous l'apprendrez facilement.",
	"opened-wizard": "Cette fenêtre montre et explique tous les attributs que possède notre Polaroïd. Si un attribut est cliqué, il sera utilisé dans notre code. Dans notre cas, jusqu'à présent, il ne s'agit que de l'attribut image, qui contient une url.",
	"polaroid-double-click": "Veuillez double-cliquer sur le mot Polaroid. L'élément correspondant sur la droite sera alors mis en évidence.",
	"polaroid-hover": "Essayez de survoler le mot \"Polaroïd\" avec votre souris. Vous voyez : Une petite explication apparaît. Vous pouvez également survoler les attributs de l'élément. Pour l'image, vous voyez qu'il s'agit d'une chaîne de caractères qui pointe évidemment vers une adresse URL. Si vous voulez, vous pouvez remplacer l'image. - Chaque élément de l'éditeur peut être exploré de cette façon.",
	"polaroid-lightbulb": "Si vous cliquez sur le nom \"Polaroid\", une petite ampoule apparaît au-dessus du code du composant Polaroid. Si vous cliquez dessus, vous avez plusieurs options. Tout d'abord, vous pouvez faire en sorte que la vue rende le composant visible, ou vous pouvez déposer des problèmes spécifiques et suggérer des améliorations sur GitHub.",
	"polaroid-wizard": "Si vous survolez l'élément, un petit cadre rouge apparaît avec quelques boutons dans le coin supérieur droit, avec lesquels vous pouvez faire diverses choses. Pour personnaliser le Polaroïd, on clique sur le premier bouton avec l'icône de la roue dentée pour ouvrir le \"Component Wizard\".",
	"translate-lesson": "Vous avez la possibilité de traduire l'intégralité de votre leçon dans la langue de votre choix - nous proposons un total de 10 langues. En outre, vous pouvez également traduire des passages individuels. Pour ce faire, vous devez mettre un texte en surbrillance, cliquer avec le bouton droit de la souris et sélectionner la commande traduire dans le menu contextuel.",
	"two-panes": "Comme vous pouvez le voir : L'éditeur est divisé en deux parties (vous pouvez même déplacer la barre au milieu)"
}
