{
	"animation-help": "A CSS animációk hihetetlenül hasznosak, ha fel akarod dobni az oldaladat. Néhány előbeállítással állítottunk össze. Ezeket a komponensed `style` attribútumában kell elhelyezned, például animation: 'anim-fade-in 3s'.",
	"back-in-editor": "Itt vagyunk tehát a bal oldali megfelelő vonalnál. Varázslatos módon létrehoztuk ezt a kis polaroidot. Ugyanilyen könnyen beírhattad volna ezt a szöveget ide. De hogy megkönnyítsük a dolgot, levettük a kezedről.",
	"change-online-mode": "Itt adhatja meg, hogy a lecke a szerkesztőben (online) lépjen-e kapcsolatba a szerverrel. Ehhez azonban szükséges, hogy a szerver a bevezetőben legyen megadva. Ha ez nem így van, a gomb szürke - azaz nem választható - lesz.",
	"click-button-to-jump": "Csak kattintson erre a kis elemre - ez a szerkesztő megfelelő sorára ugrik.",
	"component-wizard-0": "A Komponensvarázslóban teljes mértékben Ön irányíthatja a komponenst. Megnézheti, hogyan működik, milyen attribútumokat módosíthat - és ha tetszik az eredmény, megnyomhatja a `Beillesztés` gombot, és a módosított komponens átmásolódik a szerkesztőbe.",
	"component-wizard-1": "Itt látható a komponens megjelenését meghatározó kód. Ezt kézzel is szerkesztheti. Automatikusan is frissül, amikor például egy új attribútumra kattint. Csak figyelj rá!",
	"component-wizard-10": "Egyes alkatrészek hatalmasak, és nehéz lehet megtalálni az attribútumot. Itt kereshet rá. Ennek az az előnye, hogy arra koncentrálhat, ami érdekli.",
	"component-wizard-11": "Csak próbálja ki, adjon hozzá egy attribútumot, és változtassa meg az értékét. Semmi sem romolhat el!",
	"component-wizard-12": "Ha ide kattint, a komponens frissül a szerkesztőben, és úgy fog kinézni, ahogyan szeretné.",
	"component-wizard-13": "Ha nem tetszenek a változtatások, itt visszavonhatja őket. Az alkatrész pontosan úgy néz ki, mint a varázsló megnyitása előtt.",
	"component-wizard-14": "Ha ide kattint, bezárja a komponensvarázslót - de semmi sem kerül mentésre.",
	"component-wizard-2": "Ez az előnézeti rész. Pontosan így fog kinézni a komponens később a szerkesztőben.",
	"component-wizard-3": "Itt találja az összes attribútumot, amely a komponenshez rendelkezésre áll.",
	"component-wizard-4": "Egyetlen kattintással beállíthatja, hogy a kérdéses attribútumot használni kívánja-e vagy sem. Csak kattintson rá, és nézze meg, hogyan változik a kód.",
	"component-wizard-5": "Néhány attribútum esetében nem egyértelmű azonnal, hogy mire szolgálnak. Ez a leírás megmagyarázza Önnek.",
	"component-wizard-6": "Az aktív attribútumok esetében itt megváltoztathatja az értéket, és megfigyelheti a frissített komponenst a kódban és az előnézetben.",
	"component-wizard-7": "Ez egy információs mező, amely meghatározza az attribútum adattípusát. Például a boolean az \"igaz\" vagy \"hamis\" érték, a tömb az elemek listájára utal.",
	"component-wizard-8": "Itt találja az alapértelmezett értéket, amely akkor van beállítva, ha nem állította be manuálisan az attribútumot.",
	"component-wizard-9": "Itt szűrheti az attribútumok listáját, hogy csak a jelenleg használt vagy még nem használt attribútumokat jelenítse meg. Ön dönthet!",
	"header-preview-button": "Az előnézet gombbal van egy gomb, amellyel az oldalt úgy láthatja, ahogyan az a weben megjelenik. Ha újra megnyomja, akkor visszaugrik a szerkesztő nézetbe.",
	"header-role-in-preview": "Itt kiválaszthatja a szerepét - és láthatja az oldalt úgy, ahogyan egy névtelen felhasználó látná, mint egy regisztrált felhasználó, a kurzus tulajdonosa vagy az adott kurzusra beiratkozott diák.",
	"keyboard-shortcuts": "Ha fel akarja gyorsítani a folyamatokat, a parancsikonok nagy segítséget jelentenek. Ezeket itt találja a listában.",
	"link-docs": "Itt megnyithatja az ISLE dokumentációt, amely az interneten is megtalálható a https://isledocs.com/ címen.",
	"link-export": "Ez a gomb megnyit egy oldalt, ahol feltöltheti a leckét a szerverre. Ehhez rendelkeznie kell a szerver címével és a hitelesítő adatokkal. - A tananyag folytatásához kattintson a Vissza a szerkesztőhöz gombra.",
	"link-settings": "A beállítások oldalon látható, hogy melyik szerverhez melyik felhasználói e-mail cím alatt csatlakozik. A GitHub integráció (amelyhez Github felhasználónak kell lennie) lehetővé teszi a sablonok letöltését és a saját kódrészletek gistként történő feltöltését. A beállítások részben beállíthatja a szerkesztő nyelvét, a rekord betűméretét és néhány más fontos beállítást.",
	"linting-and-spelling": "A szerkesztő beépített helyesírás-ellenőrzővel rendelkezik - és megmutatja, ha elírt valamit. A futtatás arra utal, hogy hogyan tartod tisztán a kódodat. Ez növeli az olvashatóságot, és biztosítja, hogy a kódod stílusa egységes legyen.",
	"live-preview": "Itt található az élő előnézet - vagyis az, amit a felhasználók láthatnak. Az elv ismerős. WYSIWYG! Visszafordítva angolra: Amit látsz, azt kapod!",
	"markdown-help": "A Markdown jelölőnyelv elsajátítása nem nehéz, ami előny a HTML-hez képest. Sokkal könnyebb olvasni - és óriási mértékben felgyorsítja a munkát.",
	"monaco-editor": "Itt a bal oldalon található a kódbázis. Tulajdonképpen elég ismerős, ha már foglalkozott HTML vagy Markdown kóddal. De ne aggódj: az egész gyorsan megnyílik - és bármennyire is ijesztőnek tűnik, könnyen meg fogod tanulni.",
	"opened-wizard": "Ez az ablak megmutatja és elmagyarázza a Polaroidunk összes tulajdonságát. Ha egy attribútumra kattintunk, akkor azt a kódunkban fogjuk használni. A mi esetünkben ez eddig nem más, mint az image attribútum, amely egy url-t tartalmaz.",
	"polaroid-double-click": "Kattintson duplán a Polaroid szóra. Ekkor a megfelelő elem a jobb oldalon kiemelésre kerül.",
	"polaroid-hover": "Próbáljon meg az egérrel a \"Polaroid\" szó fölé menni. Meglátja: Egy kis magyarázat jelenik meg. Az elem attribútumai fölé is rá tudsz menni az egérrel. A kép esetében azt látja, hogy ez egy karakterlánc, amely nyilvánvalóan egy URL-címre mutat. Ha akarod, kicserélheted a képet. - A szerkesztő minden eleme felfedezhető ilyen módon.",
	"polaroid-lightbulb": "Ha a \"Polaroid\" névre kattint, a Polaroid komponens kódja felett megjelenik egy kis villanykörte. Ha rákattint, több lehetőség is megjelenik. Először is, a nézet láthatóvá teheti a komponenst, vagy a GitHubon konkrét problémákat jelenthet be, és javításokat javasolhat.",
	"polaroid-wizard": "Ha az elem fölé mozgatod a gépet, megjelenik egy kis piros keret, amelynek jobb felső sarkában néhány gomb található, amelyekkel különböző dolgokat végezhetsz. A Polaroid testreszabásához kattintsunk az első fogaskerék ikonnal ellátott gombra, hogy megnyíljon a \"Component Wizard\".",
	"translate-lesson": "Lehetősége van a teljes leckét lefordítani az Ön által választott nyelvre - összesen 10 nyelvet kínálunk. Ezenkívül lefordíthat egyes részeket is. Ehhez ki kell jelölnie egy szöveget, majd jobb gombbal kell kattintania, és a kontextusmenüből ki kell választania a fordítás parancsot.",
	"two-panes": "Amint láthatja: A szerkesztő két részre van osztva (a középen lévő sávot akár el is mozgathatja). Így meghatározhatja, hogy az adott ablaktábla mekkora helyet foglaljon el."
}
