{
	"animation-help": "Le animazioni CSS sono incredibilmente utili quando vuoi dare un po' di pepe alla tua pagina. Abbiamo fornito alcuni preset per te. Devi metterli nell'attributo `style` del tuo componente, per esempio animation: 'anim-fade-in 3s'.",
	"back-in-editor": "Quindi eccoci alla rispettiva linea sul lato sinistro. Abbiamo magicamente creato questa piccola Polaroid. Avreste potuto facilmente digitare questo testo qui. Ma per rendere tutto più facile, ve l'abbiamo tolto dalle mani.",
	"change-online-mode": "Qui potete specificare se la vostra lezione interagisce con il server nell'editor (online). Tuttavia, questo richiede che il server sia specificato nel preambolo. Se questo non è il caso, il pulsante è grigio - cioè non selezionabile.",
	"click-button-to-jump": "Basta cliccare su questo piccolo elemento - che salterà alla rispettiva linea nell'editor.",
	"component-wizard-0": "Nel Wizard del componente hai il pieno controllo sul tuo componente. Puoi vedere come funziona, quali attributi puoi cambiare - e se ti piace il risultato, puoi premere il pulsante `Insert` e il componente modificato sarà copiato nell'editor.",
	"component-wizard-1": "Qui puoi vedere il codice che definisce l'aspetto del componente. Puoi modificarlo manualmente. Si aggiorna anche automaticamente quando clicchi su un nuovo attributo, per esempio. Fai solo attenzione!",
	"component-wizard-10": "Alcuni componenti sono enormi e può essere difficile trovare un attributo. Qui potete cercarlo. Il vantaggio di questo è che potete concentrarvi su ciò che vi interessa.",
	"component-wizard-11": "Basta provare, aggiungere un attributo e cambiare il suo valore. Niente può andare storto!",
	"component-wizard-12": "Se cliccate qui, il componente sarà aggiornato nell'editor e avrà l'aspetto che desiderate.",
	"component-wizard-13": "Se non ti piacciono le tue modifiche, puoi annullarle qui. Il componente appare esattamente come prima che tu aprissi la procedura guidata.",
	"component-wizard-14": "Se cliccate qui, chiuderete la procedura guidata del componente - ma non verrà salvato nulla.",
	"component-wizard-2": "Questa è la sezione di anteprima. Questo è esattamente come il componente apparirà più tardi nell'editor.",
	"component-wizard-3": "Qui potete trovare tutti gli attributi che sono disponibili per il componente.",
	"component-wizard-4": "Con un clic potete impostare se l'attributo in questione deve essere usato o meno. Basta cliccarci sopra e vedere come cambia il codice.",
	"component-wizard-5": "Con alcuni attributi non è immediatamente chiaro cosa fanno. Questa descrizione ve lo spiega.",
	"component-wizard-6": "Per gli attributi attivi, potete qui cambiare il valore e osservare il componente aggiornato nel codice e nell'anteprima.",
	"component-wizard-7": "Questo è un campo informativo che specifica il tipo di dati dell'attributo. Per esempio, un booleano è un valore `vero` o `falso`, un array si riferisce a una lista di elementi",
	"component-wizard-8": "Qui troverete il valore predefinito che viene impostato se non avete impostato manualmente l'attributo.",
	"component-wizard-9": "Qui puoi filtrare la lista degli attributi per visualizzare solo gli attributi attualmente utilizzati o non ancora utilizzati. A voi la scelta!",
	"header-preview-button": "Con il pulsante di anteprima hai un pulsante dove puoi vedere la pagina come appare sul web. Se lo premi di nuovo, salta indietro alla vista dell'editor.",
	"header-role-in-preview": "Qui potete selezionare il vostro ruolo - e vedere la pagina come la vedrebbe un utente anonimo, un utente registrato, il proprietario del corso, o lo studente che è iscritto a un particolare corso.",
	"keyboard-shortcuts": "Se volete accelerare i processi, le scorciatoie sono di grande aiuto. Puoi trovarle elencate qui.",
	"link-docs": "Qui si apre la documentazione ISLE, che si può trovare anche su Internet all'indirizzo https://isledocs.com/",
	"link-export": "Questo pulsante apre una pagina dove puoi caricare la tua lezione sul server. Devi avere l'indirizzo e le credenziali del server per fare questo. - Per continuare con il tutorial, clicca sul pulsante Torna all'editor.",
	"link-settings": "La pagina delle impostazioni ti mostra sotto quale email utente sei connesso a quale server. L'integrazione con GitHub (che richiede che tu sia un utente Github) ti permette di scaricare modelli e caricare i tuoi snippet di codice come gists. Nella sezione delle impostazioni è possibile impostare la lingua dell'editor, la dimensione dei caratteri di registrazione e alcune altre impostazioni importanti.",
	"linting-and-spelling": "L'editor ha un correttore ortografico integrato - e ti mostra se hai fatto un errore di battitura. Il linting si riferisce al modo in cui tieni pulito il tuo codice. Questo aumenta la leggibilità e assicura che lo stile del tuo codice sia coerente.",
	"live-preview": "Qui puoi trovare l'anteprima dal vivo - cioè quello che i tuoi utenti vedono. Il principio è familiare. WYSIWYG! Tradotto in inglese: Quello che vedi è quello che ottieni!",
	"markdown-help": "Imparare il linguaggio di markup Markdown non è difficile, il che è un vantaggio rispetto all'HTML. È molto più facile da leggere - e velocizza immensamente il lavoro.",
	"monaco-editor": "Qui sul lato sinistro si trova il codice base. In realtà abbastanza familiare, se hai già avuto a che fare con HTML o Markdown. Ma non preoccupatevi: il tutto si apre rapidamente - e per quanto spaventoso possa sembrare, lo imparerete facilmente.",
	"opened-wizard": "Questa finestra mostra e spiega tutti gli attributi che ha la nostra Polaroid. Se un attributo viene cliccato, sarà utilizzato nel nostro codice. Nel nostro caso, finora, non è altro che l'attributo image, che contiene un url.",
	"polaroid-double-click": "Fate doppio clic sulla parola Polaroid. Ora l'elemento corrispondente sulla destra sarà evidenziato.",
	"polaroid-hover": "Provate a passare sopra la parola \"Polaroid\" con il mouse. Vedrete: Appare una piccola spiegazione. Puoi anche passare il mouse sugli attributi dell'elemento. Per l'immagine, vedi che è una stringa che ovviamente punta a un indirizzo URL. Se vuoi, puoi sostituire l'immagine. - Ogni elemento nell'editor può essere esplorato in questo modo.",
	"polaroid-lightbulb": "Se cliccate sul nome \"Polaroid\", una piccola lampadina appare sopra il codice del componente Polaroid. Se ci cliccate sopra, avete diverse opzioni. Per prima cosa, puoi fare in modo che la vista renda visibile il componente, oppure puoi archiviare problemi specifici e suggerire miglioramenti su GitHub.",
	"polaroid-wizard": "Se passate il mouse sopra l'elemento, appare una piccola cornice rossa con alcuni pulsanti nell'angolo in alto a destra, con i quali potete fare varie cose. Per personalizzare la Polaroid, clicchiamo sul primo pulsante con l'icona della ruota dentata per aprire il \"Component Wizard\".",
	"translate-lesson": "Hai la possibilità di tradurre l'intera lezione in una lingua di tua scelta - forniamo un totale di 10 lingue. Inoltre, puoi anche tradurre singoli passaggi. Per fare questo, è necessario evidenziare un testo, cliccare con il tasto destro e selezionare il comando traduci dal menu contestuale.",
	"two-panes": "Come potete vedere: L'editor è diviso in due parti (puoi anche spostare la barra nel mezzo)"
}
