{
	"animation-help": "CSSアニメーションは、ページを華やかにしたいときに非常に便利です。いくつかのプリセットをご用意しました。コンポーネントの `style` 属性に、animation: 'anim-fade-in 3s' のように記述してください。",
	"back-in-editor": "左側のそれぞれの線のところに来ました。私たちは魔法のようにこの小さなポラロイドを作りました。このテキストをここに入力するのも簡単ですがでも、簡単にするために、あなたの手から外しました。",
	"change-online-mode": "ここでは、あなたのレッスンがエディタ内のサーバと対話するかどうかを指定できます（オンライン）。ただし、この場合、プリアンブルでサーバが指定されている必要があります。指定されていない場合、このボタンは灰色に表示され、選択することができません。",
	"click-button-to-jump": "この小さな要素をクリックするだけで、エディタの各行にジャンプします。",
	"component-wizard-0": "コンポーネントウィザードでは、作成したコンポーネントを完全にコントロールすることができます。どのように動作するのか、どの属性を変更できるのかを確認することができます。結果が気に入れば、「挿入」ボタンを押すと、変更したコンポーネントがエディタにコピーされます。",
	"component-wizard-1": "ここには、コンポーネントの外観を定義するコードが表示されています。これを手動で編集することができます。また、新しい属性をクリックしたときなど、自動的に更新されます。注目してみてください。",
	"component-wizard-10": "コンポーネントの中には巨大なものもあり、属性を探すのに苦労することもあります。ここでは、それを検索することができます。興味のあるものに集中できるというメリットがあります。",
	"component-wizard-11": "試しに属性を追加して、その値を変更してみてください。何も問題はありません。",
	"component-wizard-12": "ここをクリックすると、エディタ上でコンポーネントが更新され、希望通りの表示になります。",
	"component-wizard-13": "変更した内容が気に入らなければ、ここで元に戻すことができます。ウィザードを開く前と同じように、コンポーネントが表示されます。",
	"component-wizard-14": "ここをクリックすると、コンポーネントウィザードが終了しますが、何も保存されません。",
	"component-wizard-2": "これはプレビューセクションです。これは、後にエディターでコンポーネントがどのように表示されるかを示すものです。",
	"component-wizard-3": "ここでは、コンポーネントで利用可能なすべての属性を確認できます。",
	"component-wizard-4": "ワンクリックで、問題の属性を使用するかどうかを設定できます。クリックするだけで、コードがどのように変化するかを確認することができます。",
	"component-wizard-5": "いくつかの属性では、それらが何をするのかすぐにはわかりません。この説明では、それを説明します。",
	"component-wizard-6": "アクティブな属性については、ここで値を変更し、コードとプレビューで更新されたコンポーネントを確認することができます。",
	"component-wizard-7": "これは属性のデータタイプを指定する情報フィールドです。例えば，booleanは`true`または`false`の値であり，arrayは要素のリストを指します。",
	"component-wizard-8": "ここには、その属性を手動で設定していない場合に設定されるデフォルト値が表示されます。",
	"component-wizard-9": "ここでは、属性のリストをフィルタリングして、現在使用されている属性またはまだ使用されていない属性のみを表示することができます。選択肢はあなた次第です。",
	"header-preview-button": "プレビューボタンでは、ウェブ上で表示されるようなページを見ることができるボタンがあります。もう一度押すと、エディタビューにジャンプします。",
	"header-role-in-preview": "ここでは、自分の役割を選択することができます。匿名のユーザー、登録ユーザー、コースオーナー、または特定のコースに登録されている学生としてページを見ることができます。",
	"keyboard-shortcuts": "プロセスを高速化したい場合、ショートカットは大きな助けとなります。ここに掲載されているものをご覧ください。",
	"link-docs": "ここでは、インターネット上の https://isledocs.com/ にあるISLEのドキュメントを開きます。",
	"link-export": "このボタンをクリックすると、レッスンをサーバーにアップロードするためのページが開きます。これを行うには、サーバーのアドレスと認証情報が必要です。- チュートリアルを続けるには、「Back to Editor」ボタンをクリックしてください。",
	"link-settings": "設定ページでは、どのユーザーメールでどのサーバーに接続しているかが表示されます。GitHubインテグレーション（Githubユーザーである必要があります）では、テンプレートをダウンロードしたり、独自のコードスニペットをgistとしてアップロードすることができます。設定セクションでは、エディタの言語、レコードのフォントサイズ、その他の重要な設定を行うことができます。",
	"linting-and-spelling": "エディターにはスペルチェッカーが内蔵されており、タイプミスをした場合には表示されます。リンティングとは、コードをきれいに保つ方法のことです。これにより、読みやすさが向上し、コードのスタイルが一貫したものになります。",
	"live-preview": "ここでは、ライブプレビュー、つまりユーザーが見ることができるものを見つけることができます。原理はよく知られています。WYSIWYG!英語に翻訳されています。あなたが見るものはあなたが得るものです!",
	"markdown-help": "Markdownマークアップ言語の習得は難しくありませんが、これはHTMLよりも優れています。読むのがはるかに簡単です。そして、作業が非常に速くなります。",
	"monaco-editor": "ここの左側にコードベースがあります。もしあなたがすでにHTMLやMarkdownを扱ったことがあるならば、実際には非常に馴染み深いものです。しかし、心配しないでください：全体がすぐに開きます - そして、あなたは簡単にそれを学ぶことができます。",
	"opened-wizard": "このウィンドウは、ポラロイドが持っている全ての属性を表示し、説明します。もし属性がクリックされた場合、それは私たちのコードで使用されます。私たちの場合、これまでのところ、それはURLを含む画像属性以外の何物でもありません。",
	"polaroid-double-click": "ポラロイドという単語をダブルクリックしてください。右側の対応する要素がハイライトされます。",
	"polaroid-hover": "マウスで \"Polaroid \"という単語にカーソルを合わせてみてください。見てみてください。小さな説明が表示されます。また、要素の属性の上にカーソルを置くこともできます。画像については、明らかにURLアドレスを指す文字列であることがわかります。必要であれば、画像を置き換えることができます。- エディタのすべての要素はこのようにして探索することができます。",
	"polaroid-lightbulb": "Polaroid」の名前をクリックすると、Polaroidのコンポーネントコードの上に小さな電球が表示されます。それをクリックすると、いくつかのオプションがあります。まず、ビューでコンポーネントを見えるようにしたり、GitHubで具体的な問題を提起して改善を提案したりすることができます。",
	"polaroid-wizard": "要素の上にカーソルを置くと、右上にいくつかのボタンがある小さな赤枠が表示され、そこでいろいろなことができるようになっています。ポラロイドをカスタマイズするには、最初の歯車のアイコンが付いたボタンをクリックして「コンポーネントウィザード」を開きます。",
	"translate-lesson": "レッスン全体をご希望の言語に翻訳するオプションがあります。全部で10言語をご用意しています。加えて、個々の文章を翻訳することもできます。これを行うには、テキストをハイライトして右クリックし、コンテキストメニューから「翻訳」コマンドを選択する必要があります。",
	"two-panes": "ご覧のようにエディタは2つの部分に分かれています（真ん中のバーを動かすこともできます"
}
