{
	"animation-help": "CSS animacijos yra neįtikėtinai patogios, kai norite pagyvinti puslapį. Pateikėme keletą išankstinių nustatymų. Juos reikia įrašyti į komponento atributą `style`, pvz., animation: 'anim-fade-in 3s'.",
	"back-in-editor": "Taigi, štai mes esame ties atitinkama linija kairėje pusėje. Stebuklingai sukūrėme šį mažą polaroidą. Lygiai taip pat lengvai galėjote čia įvesti šį tekstą. Bet kad būtų lengviau, mes jį nuėmėme nuo jūsų rankų.",
	"change-online-mode": "Čia galite nurodyti, ar jūsų pamoka su serveriu sąveikauja redaktoriuje (internete). Tačiau tam reikia, kad serveris būtų nurodytas preambulėje. Priešingu atveju mygtukas yra pilkos spalvos, t. y. jo negalima pasirinkti.",
	"click-button-to-jump": "Tiesiog spustelėkite šį mažą elementą - pereisite į atitinkamą redaktoriaus eilutę.",
	"component-wizard-0": "Komponentų vedlyje galite visiškai valdyti savo komponentą. Galite matyti, kaip jis veikia, kokius atributus galite keisti, o jei rezultatas jums patinka, galite paspausti mygtuką \"Įterpti\" ir pakeistas komponentas bus nukopijuotas į redaktorių.",
	"component-wizard-1": "Čia matote kodą, apibrėžiantį komponento išvaizdą. Jį galite redaguoti rankiniu būdu. Jis taip pat atnaujinamas automatiškai, kai spustelėjate, pavyzdžiui, naują atributą. Tiesiog atkreipkite į jį dėmesį!",
	"component-wizard-10": "Kai kurie komponentai yra didžiuliai, todėl gali būti sunku rasti atributą. Čia galite jo ieškoti. To privalumas tas, kad galite sutelkti dėmesį į tai, kas jus domina.",
	"component-wizard-11": "Tiesiog pabandykite tai padaryti, pridėkite atributą ir pakeiskite jo reikšmę. Nieko negali būti blogai!",
	"component-wizard-12": "Jei spustelėsite čia, komponentas bus atnaujintas redaktoriuje ir atrodys taip, kaip norite.",
	"component-wizard-13": "Jei pakeitimai nepatinka, galite juos atšaukti čia. Komponentas atrodo lygiai taip pat, kaip ir prieš atidarant vedlį.",
	"component-wizard-14": "Jei spustelėsite šią vietą, uždarysite komponentų vedlį, tačiau niekas nebus išsaugota.",
	"component-wizard-2": "Tai yra peržiūros skyrius. Būtent taip komponentas atrodys vėliau redaktoriuje.",
	"component-wizard-3": "Čia rasite visus komponentui prieinamus atributus.",
	"component-wizard-4": "Vienu spustelėjimu galite nustatyti, ar atitinkamas atributas turi būti naudojamas, ar ne. Tiesiog spustelėkite jį ir pamatysite, kaip pasikeis kodas.",
	"component-wizard-5": "Kai kurių požymių atveju ne iš karto aišku, ką jie veikia. Šiame aprašyme tai paaiškinama.",
	"component-wizard-6": "Aktyviųjų atributų atveju galite pakeisti reikšmę ir stebėti atnaujintą komponentą kode ir peržiūroje.",
	"component-wizard-7": "Tai informacinis laukas, kuriame nurodomas atributo duomenų tipas. Pavyzdžiui, boolean yra `true` arba `false` reikšmė, array reiškia elementų sąrašą.",
	"component-wizard-8": "Čia rasite numatytąją vertę, kuri nustatoma, jei atributo nenustatėte rankiniu būdu.",
	"component-wizard-9": "Čia galite filtruoti atributų sąrašą, kad būtų rodomi tik šiuo metu naudojami arba dar nenaudojami atributai. Jūs galite rinktis!",
	"header-preview-button": "Naudodami peržiūros mygtuką galite peržiūrėti puslapį taip, kaip jis rodomas žiniatinklyje. Paspaudus jį dar kartą, grįžtama į redaktoriaus rodinį.",
	"header-role-in-preview": "Čia galite pasirinkti savo vaidmenį ir matyti puslapį taip, kaip jį matytų anoniminis naudotojas, registruotas naudotojas, kurso savininkas arba studentas, užsirašęs į tam tikrą kursą.",
	"keyboard-shortcuts": "Jei norite pagreitinti procesus, labai padeda trumpieji klavišai. Jų sąrašą rasite čia.",
	"link-docs": "Čia atveriama ISLE dokumentacija, kurią taip pat galite rasti internete adresu https://isledocs.com/.",
	"link-export": "Šiuo mygtuku atveriamas puslapis, kuriame galite įkelti pamoką į serverį. Norėdami tai padaryti, turite turėti serverio adresą ir įgaliojimus. - Jei norite tęsti pamoką, spustelėkite mygtuką Grįžti į redaktorių.",
	"link-settings": "Nustatymų puslapyje rodoma, kokiu naudotojo el. paštu esate prisijungę prie kurio serverio. Integracija su \"GitHub\" (tam reikia būti \"Github\" vartotoju) leidžia atsisiųsti šablonus ir įkelti savo kodo fragmentus kaip gists. Nustatymų skyriuje galite nustatyti redaktoriaus kalbą, įrašo šrifto dydį ir kai kuriuos kitus svarbius nustatymus.",
	"linting-and-spelling": "Redaktoriuje yra integruota rašybos tikrinimo programa, kuri parodo, ar padarėte rašybos klaidą. Linting - tai būdas, kuriuo saugote kodo švarą. Taip padidinamas skaitomumas ir užtikrinamas nuoseklus jūsų kodo stilius.",
	"live-preview": "Čia rasite tiesioginę peržiūrą, t. y. tai, ką matys jūsų naudotojai. Principas pažįstamas. WYSIWYG! Išversta atgal į anglų kalbą: Tai, ką matote, tą ir gaunate!",
	"markdown-help": "Išmokti \"Markdown\" žymėjimo kalbą nėra sudėtinga, o tai yra pranašumas prieš HTML. Ją daug lengviau skaityti ir tai labai pagreitina darbą.",
	"monaco-editor": "Kairėje pusėje rasite kodo bazę. Tiesą sakant, ji gana gerai pažįstama, jei jau esate dirbę su HTML arba Markdown. Tačiau nesijaudinkite: visa tai atsiveria greitai - ir, kad ir kaip bauginančiai atrodytų, lengvai išmoksite.",
	"opened-wizard": "Šiame lange rodomi ir paaiškinami visi \"Polaroid\" atributai. Spustelėjus atributą, jis bus naudojamas mūsų kode. Mūsų atveju kol kas tai tik atributas image, kuriame yra url.",
	"polaroid-double-click": "Dukart spustelėkite žodį \"Polaroid\". Dabar bus paryškintas atitinkamas elementas dešinėje.",
	"polaroid-hover": "Pabandykite pele užvesti pelę ant žodžio \"Polaroid\". Pamatysite: Pasirodo nedidelis paaiškinimas. Taip pat galite užvesti pelės žymeklį ant elemento atributų. Paveikslėlio atveju matote, kad tai yra eilutė, kuri akivaizdžiai nurodo į URL adresą. Jei norite, galite pakeisti paveikslėlį. - Taip galima tyrinėti kiekvieną redaktoriaus elementą.",
	"polaroid-lightbulb": "Jei spustelėsite \"Polaroid\" pavadinimą, virš \"Polaroid\" komponento kodo pasirodys maža lemputė. Jei spustelėsite ją, galėsite pasirinkti kelias parinktis. Pirma, galite padaryti, kad rodinys padarytų komponentą matomą, arba galite pateikti konkrečias problemas ir pasiūlyti patobulinimų \"GitHub\".",
	"polaroid-wizard": "Užvedus pelės žymeklį ant elemento, viršutiniame dešiniajame kampe atsiranda mažas raudonas rėmelis su keliais mygtukais, kuriais galite atlikti įvairius veiksmus. Norėdami pritaikyti \"Polaroid\", spustelėdami pirmąjį mygtuką su krumpliaračio piktograma, atidarome \"Komponentų vedlį\".",
	"translate-lesson": "Galite išversti visą pamoką į pasirinktą kalbą - iš viso siūlome 10 kalbų. Be to, galite versti atskiras ištraukas. Norėdami tai padaryti, turite paryškinti tekstą, spustelėti dešinįjį pelės klavišą ir kontekstiniame meniu pasirinkti komandą versti.",
	"two-panes": "Kaip matote: Redaktorius padalytas į dvi dalis (galite net perkelti juostą viduryje). Taip galite nustatyti, kiek vietos turi užimti atitinkamas skydelis."
}
