{
	"animation-help": "CSS animācijas ir neticami ērtas, ja vēlaties dažādot savu lapu. Mēs esam nodrošinājuši jums dažus iepriekš iestatītus iestatījumus. Jums tie jāievada komponenta atribūtā `style`, piemēram, animation: 'anim-fade-in 3s'.",
	"back-in-editor": "Tātad šeit mēs atrodamies pie attiecīgās līnijas kreisajā pusē. Mēs maģiski izveidojām šo mazo polaroīdu. Jūs tikpat labi varējāt šo tekstu ierakstīt šeit. Bet, lai atvieglotu darbu, mēs esam to noņēmuši no jūsu rokām.",
	"change-online-mode": "Šeit varat norādīt, vai jūsu mācību stunda mijiedarbojas ar serveri redaktorā (tiešsaistē). Tomēr tam ir nepieciešams, lai serveris būtu norādīts preambulā. Ja tā nav, poga ir pelēkā krāsā, t. i., to nav iespējams izvēlēties.",
	"click-button-to-jump": "Vienkārši noklikšķiniet uz šī mazā elementa, lai pārietu uz attiecīgo redaktora rindu.",
	"component-wizard-0": "Komponenta vednī ir pilnīga kontrole pār komponentu. Jūs varat redzēt, kā tā darbojas, kādus atribūtus varat mainīt, un, ja rezultāts jums patīk, varat nospiest pogu `Insert`, un mainītais komponents tiks nokopēts redaktorā.",
	"component-wizard-1": "Šeit ir redzams kods, kas nosaka komponenta izskatu. To var rediģēt manuāli. Tas tiek atjaunināts arī automātiski, kad, piemēram, noklikšķināt uz jauna atribūta. Vienkārši pievērsiet tam uzmanību!",
	"component-wizard-10": "Dažas sastāvdaļas ir milzīgas, un var būt grūti atrast atribūtu. Šeit varat to meklēt. Tā priekšrocība ir tā, ka varat koncentrēties uz to, kas jūs interesē.",
	"component-wizard-11": "Vienkārši izmēģiniet to, pievienojiet atribūtu un mainiet tā vērtību. Nekas nevar notikt nepareizi!",
	"component-wizard-12": "Noklikšķinot šeit, komponents tiks atjaunināts redaktorā un izskatīsies tā, kā vēlaties.",
	"component-wizard-13": "Ja izmaiņas jums nepatīk, varat tās atcelt šeit. Komponents izskatās tieši tā, kā tas izskatījās pirms vedņa atvēršanas.",
	"component-wizard-14": "Noklikšķinot šeit, komponenta vednis tiks aizvērts, taču nekas netiks saglabāts.",
	"component-wizard-2": "Šī ir priekšskatījuma sadaļa. Tieši tā komponents vēlāk izskatīsies redaktorā.",
	"component-wizard-3": "Šeit var atrast visus komponentei pieejamos atribūtus.",
	"component-wizard-4": "Ar vienu klikšķi varat iestatīt, vai attiecīgais atribūts ir jāizmanto vai nē. Vienkārši noklikšķiniet uz tā un skatiet, kā mainās kods.",
	"component-wizard-5": "Dažiem atribūtiem nav uzreiz skaidrs, ko tie dara. Šajā aprakstā tas ir izskaidrots.",
	"component-wizard-6": "Aktīvajiem atribūtiem šeit varat mainīt vērtību un vērot atjaunināto komponentu kodā un priekšskatījumā.",
	"component-wizard-7": "Šis ir informācijas lauks, kurā norādīts atribūta datu tips. Piemēram, boolean ir `true` vai `false` vērtība, array attiecas uz elementu sarakstu.",
	"component-wizard-8": "Šeit ir norādīta noklusējuma vērtība, kas tiek iestatīta, ja atribūts nav iestatīts manuāli.",
	"component-wizard-9": "Šeit varat filtrēt atribūtu sarakstu, lai parādītu tikai pašlaik izmantotos vai vēl neizmantotos atribūtus. Jums ir izvēles iespēja!",
	"header-preview-button": "Izmantojot priekšskatījuma pogu, varat skatīt lapu, kā tā tiek parādīta tīmeklī. Ja to nospiežat vēlreiz, tiek pāriet atpakaļ uz redaktora skatu.",
	"header-role-in-preview": "Šeit varat izvēlēties savu lomu un skatīt lapu kā anonīms lietotājs, reģistrēts lietotājs, kursa īpašnieks vai students, kas ir reģistrējies konkrētajā kursā.",
	"keyboard-shortcuts": "Ja vēlaties paātrināt procesus, īsceļi ir lielisks palīgs. To sarakstu var atrast šeit.",
	"link-docs": "Šeit atveriet ISLE dokumentāciju, ko varat atrast arī internetā https://isledocs.com/.",
	"link-export": "Ar šo pogu tiek atvērta lapa, kurā varat augšupielādēt savu mācību stundu serverī. Lai to izdarītu, jums ir jābūt servera adresei un akreditācijas datiem. - Lai turpinātu mācībstundas turpināšanu, noklikšķiniet uz pogas Atgriezties pie redaktora.",
	"link-settings": "Iestatījumu lapā ir redzams, ar kura lietotāja e-pasta adresi esat pieslēgts pie kura servera. GitHub integrācija (kurai ir jābūt Github lietotājam) ļauj lejupielādēt veidnes un augšupielādēt savus koda fragmentus kā gists. Iestatījumu sadaļā varat iestatīt redaktora valodu, ieraksta fonta lielumu un dažus citus svarīgus iestatījumus.",
	"linting-and-spelling": "Redaktorā ir iebūvēts pareizrakstības pārbaudītājs, kas parāda, vai esat pieļāvis pārrakstīšanās kļūdu. Lintēšana ir veids, kā uzturēt kodu tīru. Tas uzlabo lasāmību un nodrošina, ka jūsu koda stils ir konsekvents.",
	"live-preview": "Šeit varat atrast tiešraides priekšskatījumu, t. i., to, ko redz jūsu lietotāji. Princips ir pazīstams. WYSIWYG! Tulkojums angļu valodā: Tas, ko jūs redzat, to arī saņemat!",
	"markdown-help": "Markdown iezīmēšanas valodas apguve nav sarežģīta, un tas ir priekšrocība salīdzinājumā ar HTML. Tā ir daudz vieglāk lasāma un ievērojami paātrina darbu.",
	"monaco-editor": "Šeit kreisajā pusē atrodas koda bāze. Patiesībā diezgan pazīstama, ja jau esat strādājis ar HTML vai Markdown. Taču neuztraucieties: viss ātri atveras - un, lai cik biedējoši tas arī neizskatītos, jūs to viegli apgūsiet.",
	"opened-wizard": "Šajā logā ir parādīti un paskaidroti visi Polaroid atribūti. Ja tiks noklikšķināts uz kāda atribūta, tas tiks izmantots mūsu kodā. Mūsu gadījumā pagaidām tas nav nekas cits kā attēla atribūts, kas satur url.",
	"polaroid-double-click": "Divreiz noklikšķiniet uz vārda Polaroid. Tagad tiks izcelts atbilstošais elements labajā pusē.",
	"polaroid-hover": "Pamēģiniet ar peli uzlikt peles kursoru uz vārda \"Polaroid\". Jūs redzēsiet: Tiek parādīts neliels paskaidrojums. Varat arī uzlikt kursoru uz elementa atribūtiem. Attiecībā uz attēlu redzat, ka tā ir virkne, kas acīmredzami norāda uz URL adresi. Ja vēlaties, varat aizstāt attēlu. - Šādā veidā var izpētīt katru redaktora elementu.",
	"polaroid-lightbulb": "Noklikšķinot uz nosaukuma \"Polaroid\", virs Polaroid komponenta koda parādīsies neliela spuldzīte. Noklikšķinot uz tās, ir pieejamas vairākas opcijas. Pirmkārt, jūs varat padarīt redzamo komponentu redzamu, vai arī varat iesniegt konkrētas problēmas un ierosināt uzlabojumus GitHub vietnē.",
	"polaroid-wizard": "Ja uz elementa uzvedat kursoru, augšējā labajā stūrī parādās neliels sarkans rāmītis ar dažām pogām, ar kurām var veikt dažādas darbības. Lai pielāgotu polaroidu, noklikšķiniet uz pirmās pogas ar zobrata ikonu, lai atvērtu \"Komponentu vedni\".",
	"translate-lesson": "Jums ir iespēja tulkot visu nodarbību kādā no jūsu izvēlētajām valodām - mēs piedāvājam 10 valodas. Turklāt varat tulkot arī atsevišķus fragmentus. Lai to izdarītu, ir jāizceļ teksts, jānorāda teksts, jānoklikšķina ar peles labo pogu un konteksta izvēlnē jāizvēlas komanda tulkot.",
	"two-panes": "Kā redzat: Redaktors ir sadalīts divās daļās (jūs pat varat pārvietot joslu vidū). Šādā veidā jūs varat noteikt, cik daudz vietas attiecīgajam panelim vajadzētu aizņemt."
}
