{
	"animation-help": "CSS animaties zijn ongelooflijk handig als je je pagina wilt opleuken. We hebben een aantal voorinstellingen voor je gemaakt. Je moet ze in het `style` attribuut van je component zetten, bijv. animation: 'anim-fade-in 3s'.",
	"back-in-editor": "Dus hier zijn we bij de respectievelijke lijn aan de linkerkant. We hebben op magische wijze deze kleine Polaroid gemaakt. Je had deze tekst net zo goed hier kunnen typen. Maar om het makkelijk te maken, hebben we het je uit handen genomen.",
	"change-online-mode": "Hier kun je aangeven of je les in de editor (online) met de server communiceert. Hiervoor is het wel nodig dat de server gespecificeerd is in de preambule. Als dit niet het geval is, is de knop grijs - d.w.z. niet selecteerbaar.",
	"click-button-to-jump": "Klik gewoon op dit kleine element - dat springt naar de betreffende regel in de editor.",
	"component-wizard-0": "In de Component Wizard heeft u volledige controle over uw component. U kunt zien hoe het werkt, welke attributen u kunt wijzigen - en als het resultaat u bevalt, kunt u op de `Insert` knop drukken en het gewijzigde component wordt gekopieerd naar de editor.",
	"component-wizard-1": "Hier kunt u de code zien die het uiterlijk van de component bepaalt. Je kunt het handmatig bewerken. Hij wordt ook automatisch bijgewerkt als je bijvoorbeeld op een nieuw attribuut klikt. Let er maar eens op!",
	"component-wizard-10": "Sommige onderdelen zijn enorm groot en het kan moeilijk zijn om een attribuut te vinden. Hier kunt u ernaar zoeken. Het voordeel hiervan is dat u zich kunt concentreren op datgene waarin u geïnteresseerd bent.",
	"component-wizard-11": "Probeer het gewoon, voeg een attribuut toe en verander de waarde. Er kan niets fout gaan!",
	"component-wizard-12": "Als u hier klikt, wordt de component bijgewerkt in de editor en ziet eruit zoals u wilt.",
	"component-wizard-13": "Als je wijzigingen je niet bevallen, kun je ze hier ongedaan maken. De component ziet er precies zo uit als voordat je de wizard opende.",
	"component-wizard-14": "Als u hier klikt, sluit u de component wizard - maar er wordt niets opgeslagen.",
	"component-wizard-2": "Dit is het voorbeeld gedeelte. Dit is precies hoe de component er later in de editor uit zal zien.",
	"component-wizard-3": "Hier vindt u alle attributen die beschikbaar zijn voor de component.",
	"component-wizard-4": "Met één klik kunt u instellen of het attribuut in kwestie al dan niet moet worden gebruikt. Klik er gewoon op en zie hoe de code verandert.",
	"component-wizard-5": "Bij sommige attributen is het niet meteen duidelijk wat ze doen. Deze beschrijving legt het u uit.",
	"component-wizard-6": "Voor actieve attributen kunt u hier de waarde wijzigen en de bijgewerkte component in de code en preview bekijken.",
	"component-wizard-7": "Dit is een info veld dat het datatype van het attribuut specificeert. Bijvoorbeeld, een boolean is `true` of `false` waarde, een array verwijst naar een lijst van elementen",
	"component-wizard-8": "Hier vindt u de standaardwaarde die is ingesteld als u het kenmerk niet handmatig hebt ingesteld.",
	"component-wizard-9": "Hier kunt u de lijst van attributen filteren om alleen de momenteel gebruikte of de nog niet gebruikte attributen weer te geven. U hebt de keuze!",
	"header-preview-button": "Met de preview knop heb je een knop waar je de pagina kan zien zoals hij op het web verschijnt. Als je er nogmaals op drukt, springt hij terug naar de editor weergave.",
	"header-role-in-preview": "Hier kun je je rol kiezen - en de pagina zien zoals een anonieme gebruiker hem zou zien, een geregistreerde gebruiker, de eigenaar van de cursus, of de leerling die ingeschreven is in een bepaalde cursus.",
	"keyboard-shortcuts": "Als u processen wilt versnellen, zijn sneltoetsen een grote hulp. U kunt ze hier vinden.",
	"link-docs": "Hier opent u de ISLE documentatie, die u ook op het Internet kunt vinden op https://isledocs.com/",
	"link-export": "Deze knop opent een pagina waar je je les kunt uploaden naar de server. Je moet het serveradres en de inloggegevens hebben om dit te kunnen doen. - Om verder te gaan met de les, klik op de Terug naar Editor knop.",
	"link-settings": "De instellingen pagina laat je zien onder welke gebruikers email je verbonden bent met welke server. Met de GitHub integratie (waarvoor je een Github gebruiker moet zijn) kun je sjablonen downloaden en je eigen code snippets uploaden als gists. In de instellingen sectie kunt u de editor taal instellen, de record lettergrootte en enkele andere belangrijke instellingen.",
	"linting-and-spelling": "De editor heeft een ingebouwde spellingscontrole - en laat je zien of je een tikfout hebt gemaakt. Linting verwijst naar de manier waarop je je code schoon houdt. Dit verhoogt de leesbaarheid en zorgt ervoor dat de stijl van je code consistent is.",
	"live-preview": "Hier vindt u de live preview - dat wil zeggen, wat uw gebruikers te zien krijgen. Het principe is bekend. WYSIWYG! Terugvertaald naar het Engels: Wat je ziet is wat je krijgt!",
	"markdown-help": "Het leren van de Markdown opmaaktaal is niet moeilijk, wat een voordeel is ten opzichte van HTML. Het is veel gemakkelijker te lezen - en versnelt het werk enorm.",
	"monaco-editor": "Hier aan de linkerkant vind je de code base. Eigenlijk heel vertrouwd, als je al met HTML of Markdown hebt gewerkt. Maar maak je geen zorgen: Het geheel gaat snel open - en hoe eng het er ook uitziet, je zult het snel leren.",
	"opened-wizard": "Dit venster toont en verklaart alle attributen die onze Polaroid heeft. Als op een attribuut wordt geklikt, wordt het gebruikt in onze code. In ons geval, tot nu toe, is het niets meer dan het image attribuut, dat een url bevat.",
	"polaroid-double-click": "Dubbelklik op het woord Polaroid. Nu wordt het overeenkomstige element aan de rechterkant gemarkeerd.",
	"polaroid-hover": "Probeer eens met je muis over het woord \"Polaroid\" te gaan. U ziet het: Er verschijnt een kleine uitleg. Je kunt ook met je muis over de attributen van het element gaan. Voor de afbeelding zie je dat het een string is die duidelijk naar een URL-adres verwijst. Als je wilt, kun je de afbeelding vervangen. - Elk element in de editor kan op deze manier verkend worden.",
	"polaroid-lightbulb": "Als u op de naam \"Polaroid\" klikt, verschijnt er een klein lampje boven de code van het Polaroid-onderdeel. Als je daar op klikt, heb je verschillende opties. Ten eerste kun je de view de component zichtbaar maken, of je kunt specifieke issues indienen en verbeteringen voorstellen op GitHub.",
	"polaroid-wizard": "Als je met de muis over het element gaat, verschijnt er een klein rood kader met een paar knoppen in de rechterbovenhoek, waarmee je verschillende dingen kunt doen. Om de Polaroid aan te passen, klikken we op de eerste knop met het tandwiel-icoontje om de \"Component Wizard\" te openen.",
	"translate-lesson": "U hebt de mogelijkheid om de hele les te vertalen in een taal naar keuze - wij bieden een totaal van 10 talen. Daarnaast kunt u ook afzonderlijke passages vertalen. Om dit te doen, moet u een tekst markeren, met de rechtermuisknop klikken en de vertaalopdracht selecteren in het contextmenu.",
	"two-panes": "Zoals u kunt zien: De editor is verdeeld in twee delen (je kunt zelfs de balk in het midden verplaatsen)"
}
