{
	"animation-help": "Animacje CSS są niesamowicie przydatne, gdy chcesz urozmaicić swoją stronę. Przygotowaliśmy dla Ciebie kilka gotowych ustawień. Musisz umieścić je w atrybucie `style` swojego komponentu, np. animation: 'anim-fade-in 3s'.",
	"back-in-editor": "A więc jesteśmy na odpowiedniej linii po lewej stronie. W magiczny sposób stworzyliśmy ten mały Polaroid. Równie dobrze mógłbyś wpisać ten tekst tutaj. Ale aby to ułatwić, zdejmujemy go z Twoich rąk.",
	"change-online-mode": "Tutaj możesz określić, czy twoja lekcja będzie współdziałać z serwerem w edytorze (online). Wymaga to jednak, aby serwer był określony w preambule. Jeśli tak nie jest, przycisk jest wyszarzony - tzn. nie można go wybrać.",
	"click-button-to-jump": "Wystarczy kliknąć na ten mały element - spowoduje to przejście do odpowiedniej linii w edytorze.",
	"component-wizard-0": "W Kreatorze komponentów masz pełną kontrolę nad swoim komponentem. Możesz zobaczyć jak on działa, jakie atrybuty możesz zmienić - a jeśli efekt Ci się spodoba, możesz nacisnąć przycisk `Insert` i zmieniony komponent zostanie skopiowany do edytora.",
	"component-wizard-1": "Tutaj możesz zobaczyć kod, który definiuje wygląd komponentu. Możesz go edytować ręcznie. Aktualizuje się on również automatycznie, gdy np. klikniesz na nowy atrybut. Po prostu zwróć na to uwagę!",
	"component-wizard-10": "Niektóre komponenty są ogromne i znalezienie atrybutu może być trudne. Tutaj możesz go wyszukać. Zaletą tego jest to, że możesz skupić się na tym, co Cię interesuje.",
	"component-wizard-11": "Po prostu spróbuj, dodaj atrybut i zmień jego wartość. Nic nie może pójść źle!",
	"component-wizard-12": "Jeśli klikniesz tutaj, komponent zostanie zaktualizowany w edytorze i będzie wyglądał tak, jak chcesz.",
	"component-wizard-13": "Jeśli nie podobają Ci się wprowadzone zmiany, możesz je tutaj cofnąć. Komponent wygląda dokładnie tak samo, jak przed otwarciem kreatora.",
	"component-wizard-14": "Jeśli klikniesz tutaj, zamkniesz kreatora komponentów - ale nic nie zostanie zapisane.",
	"component-wizard-2": "To jest sekcja podglądu. Dokładnie tak będzie wyglądał komponent w dalszej części edytora.",
	"component-wizard-3": "Tutaj możesz znaleźć wszystkie atrybuty, które są dostępne dla danego komponentu.",
	"component-wizard-4": "Za pomocą jednego kliknięcia możesz ustawić, czy dany atrybut ma być używany, czy nie. Po prostu kliknij na niego i zobacz jak zmieni się kod.",
	"component-wizard-5": "W przypadku niektórych atrybutów nie jest od razu jasne, co one robią. Ten opis ci to wyjaśni.",
	"component-wizard-6": "Dla aktywnych atrybutów możesz tutaj zmienić wartość i obserwować zaktualizowany komponent w kodzie i podglądzie.",
	"component-wizard-7": "To jest pole informacyjne, które określa typ danych atrybutu. Na przykład, boolean jest wartością `true` lub `false`, tablica odnosi się do listy elementów",
	"component-wizard-8": "Tutaj znajdziesz wartość domyślną, która jest ustawiona, jeśli nie ustawiłeś atrybutu ręcznie.",
	"component-wizard-9": "Tutaj możesz filtrować listę atrybutów, aby wyświetlić tylko aktualnie używane lub jeszcze nieużywane atrybuty. Masz wybór!",
	"header-preview-button": "Z przyciskiem podglądu masz przycisk, na którym możesz zobaczyć stronę w takiej formie, w jakiej pojawia się w sieci. Jeśli naciśniesz go ponownie, przeskoczysz z powrotem do widoku edytora.",
	"header-role-in-preview": "Tutaj możesz wybrać swoją rolę - i zobaczyć stronę tak, jak zobaczyłby ją anonimowy użytkownik, zarejestrowany użytkownik, właściciel kursu lub student, który jest zapisany na dany kurs.",
	"keyboard-shortcuts": "Jeśli chcesz przyspieszyć procesy, skróty klawiszowe są bardzo pomocne. Możesz je znaleźć tutaj.",
	"link-docs": "Tutaj otwiera się dokumentacja ISLE, którą można również znaleźć w Internecie pod adresem https://isledocs.com/.",
	"link-export": "Ten przycisk otwiera stronę, na której możesz przesłać swoją lekcję na serwer. Aby to zrobić, musisz mieć adres serwera i dane uwierzytelniające. - Aby kontynuować samouczek, kliknij przycisk Powrót do edytora.",
	"link-settings": "Strona ustawień pokazuje, pod jakim mailem użytkownika jesteś połączony z jakim serwerem. Integracja z GitHubem (która wymaga bycia użytkownikiem Githuba) pozwala na pobieranie szablonów i wgrywanie własnych fragmentów kodu jako gists. W sekcji ustawień możesz ustawić język edytora, rozmiar czcionki rekordu i kilka innych ważnych ustawień.",
	"linting-and-spelling": "Edytor posiada wbudowany moduł sprawdzania pisowni - i pokazuje, czy nie popełniłeś literówki. Linting odnosi się do sposobu, w jaki utrzymujesz swój kod w czystości. Zwiększa to czytelność i zapewnia, że styl Twojego kodu jest spójny.",
	"live-preview": "Tutaj znajduje się podgląd na żywo - czyli to, co widzą Twoi użytkownicy. Zasada jest znana. WYSIWYG! Przetłumaczone z powrotem na angielski: What you see is what you get!",
	"markdown-help": "Nauka języka znaczników Markdown nie jest trudna, co stanowi jego przewagę nad HTML-em. Jest dużo łatwiejszy w odbiorze - i ogromnie przyspiesza pracę.",
	"monaco-editor": "Tutaj, po lewej stronie, znajduje się baza kodu. Właściwie dość znajomy, jeśli miałeś już do czynienia z HTML-em lub Markdownem. Ale nie martw się: całość otwiera się szybko - i choć wygląda to przerażająco, nauczysz się tego z łatwością.",
	"opened-wizard": "To okno pokazuje i wyjaśnia wszystkie atrybuty, które posiada nasz Polaroid. Jeśli jakiś atrybut zostanie kliknięty, zostanie on użyty w naszym kodzie. W naszym przypadku, jak na razie, jest to nic innego jak atrybut image, który zawiera adres url.",
	"polaroid-double-click": "Proszę kliknąć dwukrotnie na słowo Polaroid. Teraz odpowiedni element po prawej stronie zostanie podświetlony.",
	"polaroid-hover": "Spróbuj najechać myszką na słowo \"Polaroid\". Zobaczysz: Pojawia się małe wyjaśnienie. Możesz również najechać myszką na atrybuty elementu. W przypadku obrazka widzisz, że jest to ciąg znaków, który w oczywisty sposób wskazuje na adres URL. Jeśli chcesz, możesz zastąpić ten obrazek. - Każdy element w edytorze może być w ten sposób zbadany.",
	"polaroid-lightbulb": "Jeśli klikniesz na nazwę \"Polaroid\", nad kodem komponentu Polaroid pojawi się mała żarówka. Jeśli na nią klikniesz, masz kilka opcji. Po pierwsze, możesz sprawić, że widok stanie się widoczny, lub możesz zgłosić konkretne problemy i zasugerować ulepszenia na GitHubie.",
	"polaroid-wizard": "Jeśli najedziesz na element, pojawi się mała czerwona ramka z kilkoma przyciskami w prawym górnym rogu, z którymi możesz zrobić różne rzeczy. Aby dostosować Polaroida, klikamy na pierwszy przycisk z ikoną koła zębatego, aby otworzyć \"Kreator komponentów\".",
	"translate-lesson": "Masz możliwość przetłumaczenia całej lekcji na wybrany przez siebie język - udostępniamy w sumie 10 języków. Oprócz tego możesz tłumaczyć pojedyncze fragmenty. W tym celu należy zaznaczyć tekst, kliknąć prawym przyciskiem myszy i wybrać z menu kontekstowego polecenie przetłumacz.",
	"two-panes": "Jak widać: Edytor jest podzielony na dwie części (możesz nawet przesunąć pasek na środku)"
}
