{
	"animation-help": "As animações CSS são incrivelmente úteis quando você quer apimentar sua página. Nós fornecemos algumas predefinições para você. Você precisa colocá-los no atributo \"estilo\" de seu componente, por exemplo, animação: \"anim-fade-em 3s\".",
	"back-in-editor": "Portanto, aqui estamos na respectiva linha do lado esquerdo. Criamos magicamente esta pequena Polaroid. Você poderia ter digitado este texto aqui com a mesma facilidade. Mas, para facilitar, nós o tiramos de suas mãos.",
	"change-online-mode": "Aqui você pode especificar se sua lição interage com o servidor no editor (online). Entretanto, isto requer que o servidor seja especificado no preâmbulo. Se este não for o caso, o botão é cinzento - ou seja, não selecionável.",
	"click-button-to-jump": "Basta clicar sobre este pequeno elemento - que saltará para a respectiva linha no editor.",
	"component-wizard-0": "No Assistente de Componentes você tem controle total sobre seu componente. Você pode ver como ele funciona, quais atributos você pode alterar - e se você gostar do resultado, você pode pressionar o botão \"Inserir\" e o componente alterado será copiado para o editor.",
	"component-wizard-1": "Aqui você pode ver o código que define a aparência do componente. Você pode editá-lo manualmente. Ele também é atualizado automaticamente quando você clica em um novo atributo, por exemplo. Basta prestar atenção a ele!",
	"component-wizard-10": "Alguns componentes são enormes e pode ser difícil encontrar um atributo. Aqui você pode procurar por ele. A vantagem disto é que você pode se concentrar naquilo em que está interessado.",
	"component-wizard-11": "Basta experimentar, adicionar um atributo e mudar seu valor. Nada pode dar errado!",
	"component-wizard-12": "Se você clicar aqui, o componente será atualizado no editor e terá a aparência que você desejar.",
	"component-wizard-13": "Se você não gosta de suas mudanças, você pode desfazê-las aqui. O componente parece exatamente como era antes de você abrir o feiticeiro.",
	"component-wizard-14": "Se você clicar aqui, você fechará o assistente de componentes - mas nada será salvo.",
	"component-wizard-2": "Esta é a seção de visualização. Esta é exatamente a aparência que o componente terá mais tarde no editor.",
	"component-wizard-3": "Aqui você pode encontrar todos os atributos que estão disponíveis para o componente.",
	"component-wizard-4": "Com um clique você pode definir se o atributo em questão deve ou não ser utilizado. Basta clicar sobre ele e ver como o código muda.",
	"component-wizard-5": "Com alguns atributos, não é imediatamente claro o que eles fazem. Esta descrição explica tudo isso para você.",
	"component-wizard-6": "Para atributos ativos, aqui você pode alterar o valor e observar o componente atualizado no código e visualizar.",
	"component-wizard-7": "Este é um campo informativo que especifica o tipo de dados do atributo. Por exemplo, um booleano é um valor \"verdadeiro\" ou \"falso\", um array se refere a uma lista de elementos",
	"component-wizard-8": "Aqui você encontrará o valor padrão que é definido se você não tiver definido manualmente o atributo.",
	"component-wizard-9": "Aqui você pode filtrar a lista de atributos para exibir apenas os atributos atualmente utilizados ou ainda não utilizados. Você tem a escolha!",
	"header-preview-button": "Com o botão de visualização você tem um botão onde você pode ver a página como ela aparece na web. Se você pressioná-lo novamente, ele salta de volta para a visualização do editor.",
	"header-role-in-preview": "Aqui você pode selecionar sua função - e ver a página como um usuário anônimo a veria, um usuário registrado, o proprietário do curso ou o estudante que está matriculado em um determinado curso.",
	"keyboard-shortcuts": "Se você quiser acelerar os processos, os atalhos são uma grande ajuda. Você pode encontrá-los listados aqui.",
	"link-docs": "Aqui você abre a documentação do ISLE, que você também pode encontrar na Internet no endereço https://isledocs.com/",
	"link-export": "Este botão abre uma página onde você pode carregar sua lição para o servidor. Você deve ter o endereço e as credenciais do servidor para fazer isso. - Para continuar com o tutorial, por favor clique no botão Voltar ao Editor.",
	"link-settings": "A página de configurações mostra sob qual e-mail de usuário você está conectado a qual servidor. A integração GitHub (que requer que você seja um usuário Github) permite que você baixe modelos e carregue seus próprios trechos de código como resumo. Na seção de configurações você pode definir o idioma do editor, o tamanho da fonte de registro e algumas outras configurações importantes.",
	"linting-and-spelling": "O editor tem um corretor ortográfico incorporado - e mostra se você fez um erro de digitação. A impressão se refere à forma como você mantém seu código limpo. Isto aumenta a legibilidade e garante que o estilo de seu código seja consistente.",
	"live-preview": "Aqui você pode encontrar a visualização ao vivo - isto é, o que seus usuários podem ver. O princípio é familiar. WYSIWYG! Traduzido de volta para o inglês: O que você vê é o que você recebe!",
	"markdown-help": "Aprender a linguagem Markdown markup não é difícil, o que é uma vantagem em relação ao HTML. É muito mais fácil de ler - e agiliza imensamente o trabalho.",
	"monaco-editor": "Aqui no lado esquerdo você encontra a base de código. Na verdade bastante familiar, se você já lidou com HTML ou Markdown. Mas não se preocupe: tudo isso se abre rapidamente - e por mais assustador que pareça, você aprenderá facilmente.",
	"opened-wizard": "Esta janela mostra e explica todos os atributos que nossa Polaroid tem. Se um atributo for clicado, ele será utilizado em nosso código. Em nosso caso, até agora, nada mais é do que o atributo de imagem, que contém uma url.",
	"polaroid-double-click": "Favor clicar duas vezes sobre a palavra Polaroid. Agora o elemento correspondente à direita será destacado.",
	"polaroid-hover": "Tente pairar sobre a palavra \"Polaroid\" com seu mouse. Você vê: Uma pequena explicação aparece. Você também pode pairar sobre os atributos do elemento. Para a imagem, você vê que é uma string que obviamente aponta para um endereço URL. Se você quiser, você pode substituir a imagem. - Cada elemento do editor pode ser explorado desta maneira.",
	"polaroid-lightbulb": "Se você clicar no nome \"Polaroid\", uma pequena lâmpada aparece acima do código do componente Polaroid. Se você clicar sobre ela, você tem várias opções. Primeiro, você pode tornar a visão visível o componente, ou pode arquivar questões específicas e sugerir melhorias no GitHub.",
	"polaroid-wizard": "Se você pairar sobre o elemento, uma pequena moldura vermelha aparece com alguns botões no canto superior direito, com os quais você pode fazer várias coisas. Para personalizar o Polaroid, clicamos no primeiro botão com ícone de roda dentada para abrir o \"Assistente de Componentes\".",
	"translate-lesson": "Você tem a opção de traduzir toda sua lição para um idioma de sua escolha - fornecemos um total de 10 idiomas. Além disso, você também pode traduzir passagens individuais. Para fazer isso, você precisa destacar um texto, clicar com o botão direito do mouse e selecionar o comando traduzir no menu de contexto.",
	"two-panes": "Como você pode ver: O editor está dividido em duas partes (você pode até mover a barra no meio)"
}
