{
	"animation-help": "Animațiile CSS sunt incredibil de utile atunci când doriți să vă condimentați pagina. Am pus la dispoziție câteva presetări pentru dumneavoastră. Trebuie să le puneți în atributul `style` al componentei dvs., de exemplu, animation: 'anim-fade-in 3s'.",
	"back-in-editor": "Iată-ne deci la linia respectivă din partea stângă. Am creat ca prin magie acest mic Polaroid. La fel de bine ați fi putut să scrieți acest text aici. Dar pentru a ușura lucrurile, v-am luat din mână.",
	"change-online-mode": "Aici puteți specifica dacă lecția dvs. interacționează cu serverul în editor (online). Cu toate acestea, este necesar ca serverul să fie specificat în preambul. Dacă nu este cazul, butonul este gri - adică nu poate fi selectat.",
	"click-button-to-jump": "Trebuie doar să faceți clic pe acest mic element - care va trece la linia respectivă din editor.",
	"component-wizard-0": "În Expertul pentru componente aveți control total asupra componentei dumneavoastră. Puteți vedea cum funcționează, ce atribute puteți modifica și, dacă vă place rezultatul, puteți apăsa butonul `Insert` și componenta modificată va fi copiată în editor.",
	"component-wizard-1": "Aici puteți vedea codul care definește aspectul componentei. Îl puteți edita manual. De asemenea, acesta se actualizează automat atunci când faceți clic pe un nou atribut, de exemplu. Doar fiți atenți la el!",
	"component-wizard-10": "Unele componente sunt uriașe și poate fi greu să găsești un atribut. Aici îl puteți căuta. Avantajul acestui lucru este că vă puteți concentra pe ceea ce vă interesează.",
	"component-wizard-11": "Încercați, adăugați un atribut și modificați-i valoarea. Nimic nu poate merge prost!",
	"component-wizard-12": "Dacă faceți clic aici, componenta va fi actualizată în editor și va arăta așa cum doriți.",
	"component-wizard-13": "Dacă nu vă plac modificările, le puteți anula aici. Componenta arată exact așa cum arăta înainte de a deschide expertul.",
	"component-wizard-14": "Dacă faceți clic aici, veți închide expertul pentru componente, dar nu se va salva nimic.",
	"component-wizard-2": "Aceasta este secțiunea de previzualizare. Acesta este exact modul în care componenta va arăta mai târziu în editor.",
	"component-wizard-3": "Aici puteți găsi toate atributele care sunt disponibile pentru componenta respectivă.",
	"component-wizard-4": "Cu un singur clic puteți stabili dacă atributul în cauză trebuie utilizat sau nu. Faceți clic pe el și vedeți cum se modifică codul.",
	"component-wizard-5": "În cazul anumitor atribute nu este imediat clar ce fac acestea. Această descriere vă explică acest lucru.",
	"component-wizard-6": "Pentru atributele active, puteți modifica aici valoarea și puteți observa componenta actualizată în cod și în previzualizare.",
	"component-wizard-7": "Acesta este un câmp de informații care specifică tipul de date al atributului. De exemplu, un boolean este o valoare `true` sau `false`, o matrice se referă la o listă de elemente.",
	"component-wizard-8": "Aici veți găsi valoarea implicită care este setată dacă nu ați setat manual atributul.",
	"component-wizard-9": "Aici puteți filtra lista de atribute pentru a afișa numai atributele utilizate în prezent sau cele care nu au fost încă utilizate. Aveți posibilitatea de a alege!",
	"header-preview-button": "Cu ajutorul butonului de previzualizare aveți un buton prin care puteți vedea pagina așa cum apare pe web. Dacă îl apăsați din nou, se revine la vizualizarea editorului.",
	"header-role-in-preview": "Aici vă puteți selecta rolul - și puteți vedea pagina așa cum ar vedea-o un utilizator anonim, un utilizator înregistrat, proprietarul cursului sau studentul care este înscris la un anumit curs.",
	"keyboard-shortcuts": "Dacă doriți să accelerați procesele, comenzile rapide sunt de mare ajutor. Le puteți găsi enumerate aici.",
	"link-docs": "Aici deschideți documentația ISLE, pe care o puteți găsi și pe internet la adresa https://isledocs.com/.",
	"link-export": "Acest buton deschide o pagină în care puteți încărca lecția pe server. Pentru a face acest lucru, trebuie să aveți adresa serverului și acreditările. - Pentru a continua tutorialul, faceți clic pe butonul Back to Editor (Înapoi la editor).",
	"link-settings": "Pagina de setări vă arată sub ce e-mail de utilizator sunteți conectat la ce server. Integrarea GitHub (care necesită să fiți utilizator Github) vă permite să descărcați șabloane și să încărcați propriile fragmente de cod ca gisturi. În secțiunea de setări puteți seta limba editorului, dimensiunea fontului de înregistrare și alte câteva setări importante.",
	"linting-and-spelling": "Editorul are un corector ortografic încorporat și vă arată dacă ați făcut o greșeală de scriere. Linting se referă la modul în care vă păstrați codul curat. Acest lucru sporește lizibilitatea și asigură coerența stilului codului dumneavoastră.",
	"live-preview": "Aici puteți găsi previzualizarea live - adică ceea ce văd utilizatorii dvs. Principiul este familiar. WYSIWYG! Tradus înapoi în engleză: Ceea ce vedeți este ceea ce primiți!",
	"markdown-help": "Învățarea limbajului de marcare Markdown nu este dificilă, ceea ce reprezintă un avantaj față de HTML. Este mult mai ușor de citit - și accelerează foarte mult munca.",
	"monaco-editor": "Aici, în partea stângă, găsiți baza de cod. De fapt, este destul de familiar, dacă ați avut deja de-a face cu HTML sau Markdown. Dar nu vă faceți griji: totul se deschide rapid - și oricât de înfricoșător ar părea, veți învăța cu ușurință.",
	"opened-wizard": "Această fereastră arată și explică toate atributele pe care le are Polaroid-ul nostru. Dacă se face clic pe un atribut, acesta va fi utilizat în codul nostru. În cazul nostru, până acum, nu este vorba decât de atributul image, care conține o adresă URL.",
	"polaroid-double-click": "Vă rugăm să faceți dublu clic pe cuvântul Polaroid. Acum, elementul corespunzător din dreapta va fi evidențiat.",
	"polaroid-hover": "Încercați să treceți cu mouse-ul peste cuvântul \"Polaroid\". Veți vedea: Apare o mică explicație. De asemenea, puteți trece cu mouse-ul peste atributele elementului. În cazul imaginii, vedeți că este un șir de caractere care, în mod evident, indică o adresă URL. Dacă doriți, puteți înlocui imaginea. - Fiecare element din editor poate fi explorat în acest mod.",
	"polaroid-lightbulb": "Dacă faceți clic pe numele \"Polaroid\", apare un beculeț deasupra codului componentei Polaroid. Dacă faceți clic pe el, aveți mai multe opțiuni. În primul rând, puteți face ca vizualizarea să facă vizibilă componenta, sau puteți depune probleme specifice și sugera îmbunătățiri pe GitHub.",
	"polaroid-wizard": "Dacă treceți deasupra elementului, apare un mic cadru roșu cu câteva butoane în colțul din dreapta sus, cu care puteți face diverse lucruri. Pentru a personaliza Polaroidul, facem clic pe primul buton cu pictograma roată dințată pentru a deschide \"Component Wizard\".",
	"translate-lesson": "Aveți opțiunea de a traduce întreaga lecție într-o limbă la alegere - oferim un total de 10 limbi. În plus, puteți traduce și pasaje individuale. Pentru a face acest lucru, trebuie să evidențiați un text, să faceți clic dreapta și să selectați comanda de traducere din meniul contextual.",
	"two-panes": "După cum puteți vedea: Editorul este împărțit în două părți (puteți chiar să mutați bara din mijloc). În acest fel, puteți defini cât spațiu trebuie să ocupe panoul respectiv."
}
