{
	"animation-help": "Animácie CSS sú neuveriteľne užitočné, keď chcete spestriť svoju stránku. Poskytli sme vám niekoľko predvolieb. Musíte ich vložiť do atribútu `style` svojho komponentu, napr. animation: 'anim-fade-in 3s'.",
	"back-in-editor": "Takže sme na príslušnej čiare na ľavej strane. Magicky sme vytvorili tento malý polaroid. Rovnako ľahko ste sem mohli napísať tento text. Ale aby sme vám to uľahčili, zobrali sme vám to z rúk.",
	"change-online-mode": "Tu môžete určiť, či vaša lekcia komunikuje so serverom v editore (online). To však vyžaduje, aby bol server uvedený v preambule. Ak tomu tak nie je, tlačidlo je sivé - t. j. nie je možné ho vybrať.",
	"click-button-to-jump": "Stačí kliknúť na tento malý prvok, čím prejdete na príslušný riadok v editore.",
	"component-wizard-0": "V sprievodcovi komponentom máte úplnú kontrolu nad svojím komponentom. Môžete vidieť, ako funguje, ktoré atribúty môžete meniť - a ak sa vám výsledok páči, môžete stlačiť tlačidlo `Vložiť` a zmenená komponenta sa skopíruje do editora.",
	"component-wizard-1": "Tu môžete vidieť kód, ktorý definuje vzhľad komponentu. Môžete ho upraviť ručne. Aktualizuje sa tiež automaticky, keď napríklad kliknete na nový atribút. Stačí mu venovať pozornosť!",
	"component-wizard-10": "Niektoré komponenty sú obrovské a môže byť ťažké nájsť ich atribút. Tu ho môžete vyhľadať. Výhodou je, že sa môžete zamerať na to, čo vás zaujíma.",
	"component-wizard-11": "Stačí to vyskúšať, pridať atribút a zmeniť jeho hodnotu. Nič sa nemôže pokaziť!",
	"component-wizard-12": "Ak kliknete sem, komponent sa v editore aktualizuje a bude vyzerať podľa vašich predstáv.",
	"component-wizard-13": "Ak sa vám zmeny nepáčia, môžete ich tu zrušiť. Komponent vyzerá presne tak, ako pred otvorením sprievodcu.",
	"component-wizard-14": "Ak kliknete sem, zatvoríte sprievodcu komponentom - ale nič sa neuloží.",
	"component-wizard-2": "Toto je časť s náhľadom. Presne takto bude komponent neskôr vyzerať v editore.",
	"component-wizard-3": "Tu nájdete všetky atribúty, ktoré sú pre komponent k dispozícii.",
	"component-wizard-4": "Jedným kliknutím môžete nastaviť, či sa má daný atribút použiť alebo nie. Stačí naň kliknúť a uvidíte, ako sa kód zmení.",
	"component-wizard-5": "Pri niektorých atribútoch nie je hneď jasné, čo robia. Tento popis vám to vysvetlí.",
	"component-wizard-6": "V prípade aktívnych atribútov môžete zmeniť hodnotu a sledovať aktualizovanú zložku v kóde a náhľade.",
	"component-wizard-7": "Toto je informačné pole, ktoré určuje dátový typ atribútu. Napríklad boolean je hodnota `true` alebo `false`, pole označuje zoznam prvkov",
	"component-wizard-8": "Tu nájdete predvolenú hodnotu, ktorá sa nastaví, ak ste atribút nenastavili ručne.",
	"component-wizard-9": "Tu môžete filtrovať zoznam atribútov tak, aby sa zobrazovali len aktuálne používané alebo ešte nepoužívané atribúty. Máte na výber!",
	"header-preview-button": "Pomocou tlačidla náhľadu môžete zobraziť stránku tak, ako sa zobrazuje na webe. Ak ho stlačíte znova, preskočí späť do zobrazenia editora.",
	"header-role-in-preview": "Tu si môžete vybrať svoju rolu - a zobraziť stránku tak, ako by ju videl anonymný používateľ, registrovaný používateľ, vlastník kurzu alebo študent, ktorý je zapísaný do konkrétneho kurzu.",
	"keyboard-shortcuts": "Ak chcete urýchliť procesy, skratky sú skvelým pomocníkom. Ich zoznam nájdete tu.",
	"link-docs": "Tu otvoríte dokumentáciu ISLE, ktorú nájdete aj na internete na adrese https://isledocs.com/.",
	"link-export": "Toto tlačidlo otvorí stránku, na ktorej môžete nahrať lekciu na server. Musíte mať adresu servera a prihlasovacie údaje, aby ste to mohli urobiť. - Ak chcete pokračovať vo výučbe, kliknite na tlačidlo Späť do editora.",
	"link-settings": "Na stránke s nastaveniami sa zobrazuje, pod ktorým používateľským e-mailom ste pripojení k danému serveru. Integrácia so službou GitHub (ktorá vyžaduje, aby ste boli používateľom služby Github) vám umožňuje sťahovať šablóny a nahrávať vlastné úryvky kódu ako gists. V časti nastavení môžete nastaviť jazyk editora, veľkosť písma záznamu a niektoré ďalšie dôležité nastavenia.",
	"linting-and-spelling": "Editor má zabudovanú kontrolu pravopisu a zobrazí vám, či ste urobili preklep. Linting sa vzťahuje na spôsob, akým udržiavate svoj kód čistý. Zvyšuje sa tým čitateľnosť a zabezpečuje sa konzistentný štýl vášho kódu.",
	"live-preview": "Tu nájdete živý náhľad - teda to, čo uvidia vaši používatelia. Princíp je známy. WYSIWYG! Preložené späť do slovenčiny: To, čo vidíte, to aj dostanete!",
	"markdown-help": "Naučiť sa značkovací jazyk Markdown nie je náročné, čo je výhoda oproti HTML. Je oveľa jednoduchší na čítanie - a nesmierne urýchľuje prácu.",
	"monaco-editor": "Tu na ľavej strane nájdete základňu kódu. V skutočnosti je celkom známy, ak ste sa už zaoberali HTML alebo Markdown. Ale nebojte sa: Celé sa to rýchlo otvorí - a akokoľvek desivo to vyzerá, naučíte sa to ľahko.",
	"opened-wizard": "Toto okno zobrazuje a vysvetľuje všetky atribúty, ktoré má náš Polaroid. Ak na niektorý atribút kliknete, bude použitý v našom kóde. V našom prípade to zatiaľ nie je nič iné ako atribút image, ktorý obsahuje url.",
	"polaroid-double-click": "Dvakrát kliknite na slovo Polaroid. Teraz sa zvýrazní príslušný prvok vpravo.",
	"polaroid-hover": "Skúste myšou prejsť na slovo \"Polaroid\". Uvidíte: Zobrazí sa malé vysvetlenie. Môžete tiež prejsť myšou na atribúty prvku. V prípade obrázka vidíte, že ide o reťazec, ktorý zjavne odkazuje na adresu URL. Ak chcete, môžete obrázok nahradiť. - Každý prvok v editore môžete preskúmať týmto spôsobom.",
	"polaroid-lightbulb": "Ak kliknete na názov Polaroid, nad kódom súčasti Polaroid sa zobrazí malá žiarovka. Ak na ňu kliknete, zobrazí sa niekoľko možností. Po prvé, môžete zviditeľniť zobrazenie komponentu alebo môžete na GitHube podať konkrétne problémy a navrhnúť vylepšenia.",
	"polaroid-wizard": "Ak na prvok nabehnete myšou, v pravom hornom rohu sa zobrazí malý červený rámček s niekoľkými tlačidlami, pomocou ktorých môžete vykonávať rôzne činnosti. Ak chceme prispôsobiť Polaroid, kliknutím na prvé tlačidlo s ikonou ozubeného kolieska otvoríme \"Sprievodcu komponentmi\".",
	"translate-lesson": "Máte možnosť preložiť si celú lekciu do jazyka podľa vlastného výberu - ponúkame celkom 10 jazykov. Okrem toho môžete preložiť aj jednotlivé pasáže. Ak to chcete urobiť, musíte označiť text, kliknúť pravým tlačidlom myši a z kontextovej ponuky vybrať príkaz preložiť.",
	"two-panes": "Ako vidíte: Editor je rozdelený na dve časti (môžete dokonca presunúť lištu uprostred). Takto môžete definovať, koľko miesta má zaberať príslušný panel."
}
