{
	"animation-help": "Animacije CSS so zelo priročne, ko želite popestriti svojo stran. Za vas smo pripravili nekaj prednastavitev. Vnesti jih morate v atribut `style` svoje komponente, npr. animation: 'anim-fade-in 3s'.",
	"back-in-editor": "Na levi strani smo pri ustrezni vrstici. Čarobno smo ustvarili ta mali polaroid. To besedilo bi lahko prav tako preprosto natipkali tukaj. Da pa bi vam olajšali delo, smo vam ga odvzeli.",
	"change-online-mode": "Tu lahko določite, ali bo vaša učna ura sodelovala s strežnikom v urejevalniku (online). Vendar je treba strežnik navesti v preambuli. V nasprotnem primeru je gumb siv - torej ga ni mogoče izbrati.",
	"click-button-to-jump": "Kliknite na ta majhen element - s tem boste preskočili na ustrezno vrstico v urejevalniku.",
	"component-wizard-0": "V čarovniku za komponente imate popoln nadzor nad svojo komponento. Vidite lahko, kako deluje, katere atribute lahko spreminjate - in če vam je rezultat všeč, lahko pritisnete gumb `Insert` in spremenjena komponenta se bo kopirala v urejevalnik.",
	"component-wizard-1": "Tukaj si lahko ogledate kodo, ki določa videz komponente. Urejate jo lahko ročno. Posodablja se tudi samodejno, ko na primer kliknete na nov atribut. Bodite pozorni nanjo!",
	"component-wizard-10": "Nekatere komponente so velike in težko je najti atribut. Tu ga lahko poiščete. Prednost tega je, da se lahko osredotočite na tisto, kar vas zanima.",
	"component-wizard-11": "Preizkusite, dodajte atribut in spremenite njegovo vrednost. Nič ne more iti narobe!",
	"component-wizard-12": "Če kliknete tukaj, se bo komponenta posodobila v urejevalniku in bo videti tako, kot želite.",
	"component-wizard-13": "Če vam spremembe niso všeč, jih lahko prekličete tukaj. Komponenta je videti natanko tako, kot je bila, preden ste odprli čarovnika.",
	"component-wizard-14": "Če kliknete tukaj, se čarovnik za komponente zapre, vendar se nič ne shrani.",
	"component-wizard-2": "To je razdelek za predogled. Natančno tako bo komponenta videti pozneje v urejevalniku.",
	"component-wizard-3": "Tu so na voljo vsi atributi, ki so na voljo za komponento.",
	"component-wizard-4": "Z enim klikom lahko določite, ali naj se zadevni atribut uporabi ali ne. Samo kliknite nanj in si oglejte, kako se bo spremenila koda.",
	"component-wizard-5": "Pri nekaterih atributih ni takoj jasno, kaj počnejo. V tem opisu je to pojasnjeno.",
	"component-wizard-6": "Pri aktivnih atributih lahko tukaj spremenite vrednost in opazujete posodobljeno komponento v kodi in predogledu.",
	"component-wizard-7": "To je informacijsko polje, ki določa podatkovno vrsto atributa. Na primer, boolean je vrednost `true` ali `false`, polje se nanaša na seznam elementov",
	"component-wizard-8": "Tu je na voljo privzeta vrednost, ki se nastavi, če atributa niste nastavili ročno.",
	"component-wizard-9": "Tu lahko filtrirate seznam atributov, da se prikažejo samo trenutno uporabljeni ali še neuporabljeni atributi. Imate možnost izbire!",
	"header-preview-button": "Z gumbom za predogled si lahko ogledate stran, kot je prikazana v spletu. Če ga znova pritisnete, se vrnete v urejevalnikov pogled.",
	"header-role-in-preview": "Tu lahko izberete svojo vlogo - stran si lahko ogledate kot anonimni uporabnik, registrirani uporabnik, lastnik tečaja ali študent, ki je vpisan v določen tečaj.",
	"keyboard-shortcuts": "Če želite pospešiti postopke, so vam bližnjice v veliko pomoč. Naštete jih lahko tukaj.",
	"link-docs": "Tu odprete dokumentacijo ISLE, ki jo lahko najdete tudi na spletni strani https://isledocs.com/.",
	"link-export": "Ta gumb odpre stran, na katero lahko naložite svojo lekcijo v strežnik. Za to morate imeti naslov strežnika in poverilnice. - Če želite nadaljevati z učno uro, kliknite gumb Nazaj v urejevalnik.",
	"link-settings": "Na strani z nastavitvami je prikazano, pod katerim uporabniškim e-poštnim naslovom ste povezani s katerim strežnikom. Integracija z GitHubom (ki zahteva, da ste uporabnik Githuba) vam omogoča prenos predlog in nalaganje lastnih delčkov kode kot gists. V razdelku z nastavitvami lahko nastavite jezik urejevalnika, velikost pisave zapisa in nekatere druge pomembne nastavitve.",
	"linting-and-spelling": "Urejevalnik ima vgrajen program za preverjanje črkovanja in vam pokaže, če ste naredili napako. Linting se nanaša na način ohranjanja čiste kode. To povečuje berljivost in zagotavlja, da je slog vaše kode dosleden.",
	"live-preview": "Tu najdete predogled v živo, torej tisto, kar bodo videli vaši uporabniki. Načelo je znano. WYSIWYG! Prevedeno nazaj v angleščino: To, kar vidite, to tudi dobite!",
	"markdown-help": "Učenje označevalnega jezika Markdown ni zahtevno, kar je prednost pred jezikom HTML. Veliko lažje ga je brati - in zelo pospeši delo.",
	"monaco-editor": "Na levi strani je baza kode. Če ste se že ukvarjali s HTML ali Markdownom, vam je pravzaprav precej znana. Vendar brez skrbi: celotna zadeva se hitro odpre - in čeprav je videti strašljivo, se je boste zlahka naučili.",
	"opened-wizard": "V tem oknu so prikazani in pojasnjeni vsi atributi, ki jih ima naš polaroid. Če kliknete atribut, bo uporabljen v naši kodi. V našem primeru je to zaenkrat samo atribut image, ki vsebuje naslov url.",
	"polaroid-double-click": "Dvakrat kliknite na besedo Polaroid. Zdaj bo ustrezni element na desni strani označen.",
	"polaroid-hover": "Z miško podrsajte nad besedo \"Polaroid\". Ogledate si: Prikaže se majhna razlaga. Z miško se lahko pomaknete tudi nad atribute elementa. Pri sliki vidite, da je to niz, ki očitno kaže na naslov URL. Če želite, lahko sliko zamenjate. - Na ta način lahko raziskujete vsak element v urejevalniku.",
	"polaroid-lightbulb": "Če kliknete ime Polaroid, se nad kodo komponente Polaroid prikaže majhna žarnica. Če jo kliknete, imate na voljo več možnosti. Najprej lahko s prikazom poskrbite, da bo komponenta vidna, ali pa lahko v GitHubu vložite posebne težave in predlagate izboljšave.",
	"polaroid-wizard": "Če se z miško pomaknete nad element, se prikaže majhen rdeč okvir z nekaj gumbi v zgornjem desnem kotu, s katerimi lahko naredite različne stvari. Če želimo prilagoditi polaroid, kliknemo na prvi gumb z ikono zobatega kolesa, da se odpre \"Čarovnik za komponente\".",
	"translate-lesson": "Celotno lekcijo lahko prevedete v izbrani jezik - na voljo je 10 jezikov. Poleg tega lahko prevedete tudi posamezne odlomke. To storite tako, da označite besedilo, kliknete z desno tipko miške in v kontekstnem meniju izberete ukaz prevedi.",
	"two-panes": "Kot lahko vidite: Urejevalnik je razdeljen na dva dela (vrstico na sredini lahko celo premaknete). Na ta način lahko določite, koliko prostora naj zavzame posamezno podokno."
}
