{
	"animation-help": "CSS-animationer är otroligt praktiska när du vill piffa upp din sida. Vi har tagit fram några förinställningar för dig. Du måste lägga in dem i attributet `style` för din komponent, t.ex. animation: 'anim-fade-in 3s'.",
	"back-in-editor": "Vi befinner oss alltså vid respektive linje på vänster sida. Vi har på magiskt sätt skapat denna lilla polaroid. Du kunde lika gärna ha skrivit texten här. Men för att göra det enkelt har vi tagit det från dig.",
	"change-online-mode": "Här kan du ange om din lektion ska interagera med servern i redigeringen (online). Detta kräver dock att servern anges i ingressen. Om så inte är fallet är knappen grå - dvs. den går inte att välja.",
	"click-button-to-jump": "Klicka bara på det här lilla elementet - det kommer att hoppa till respektive rad i redigeringsverktyget.",
	"component-wizard-0": "I komponentguiden har du full kontroll över din komponent. Du kan se hur den fungerar, vilka attribut du kan ändra - och om du gillar resultatet kan du trycka på knappen `Insert` och den ändrade komponenten kopieras in i editorn.",
	"component-wizard-1": "Här kan du se koden som definierar komponentens utseende. Du kan redigera den manuellt. Den uppdateras också automatiskt när du till exempel klickar på ett nytt attribut. Det är bara att vara uppmärksam på den!",
	"component-wizard-10": "Vissa komponenter är enorma och det kan vara svårt att hitta ett attribut. Här kan du söka efter det. Fördelen med detta är att du kan fokusera på det du är intresserad av.",
	"component-wizard-11": "Prova bara, lägg till ett attribut och ändra dess värde. Inget kan gå fel!",
	"component-wizard-12": "Om du klickar här kommer komponenten att uppdateras i redigeraren och se ut som du vill.",
	"component-wizard-13": "Om du inte gillar dina ändringar kan du ångra dem här. Komponenten ser ut precis som den gjorde innan du öppnade guiden.",
	"component-wizard-14": "Om du klickar här stängs komponentguiden - men inget sparas.",
	"component-wizard-2": "Detta är förhandsgranskningsavsnittet. Det är exakt så här komponenten kommer att se ut senare i redigeraren.",
	"component-wizard-3": "Här hittar du alla attribut som är tillgängliga för komponenten.",
	"component-wizard-4": "Med ett klick kan du ställa in om attributet i fråga ska användas eller inte. Klicka bara på det och se hur koden ändras.",
	"component-wizard-5": "För vissa attribut är det inte omedelbart klart vad de gör. Den här beskrivningen förklarar det för dig.",
	"component-wizard-6": "För aktiva attribut kan du ändra värdet och se den uppdaterade komponenten i koden och förhandsgranskningen.",
	"component-wizard-7": "Detta är ett informationsfält som anger attributets datatyp. En boolean är t.ex. ett \"sant\" eller \"falskt\" värde, en array hänvisar till en lista med element.",
	"component-wizard-8": "Här hittar du standardvärdet som ställs in om du inte har ställt in attributet manuellt.",
	"component-wizard-9": "Här kan du filtrera listan över attribut så att den endast visar de attribut som används för tillfället eller som ännu inte använts. Du kan välja!",
	"header-preview-button": "Med förhandsvisningsknappen har du en knapp där du kan se sidan som den visas på webben. Om du trycker på den igen hoppar du tillbaka till redigeringsvyn.",
	"header-role-in-preview": "Här kan du välja din roll och se sidan som en anonym användare, en registrerad användare, kursägaren eller den student som är inskriven i en viss kurs.",
	"keyboard-shortcuts": "Om du vill påskynda processer är genvägar en stor hjälp. Du kan hitta dem i en lista här.",
	"link-docs": "Här öppnar du ISLE-dokumentationen, som du också kan hitta på Internet på https://isledocs.com/.",
	"link-export": "Den här knappen öppnar en sida där du kan ladda upp din lektion till servern. Du måste ha serverns adress och autentiseringsuppgifter för att kunna göra detta. - Om du vill fortsätta med handledningen klickar du på knappen Tillbaka till redaktören.",
	"link-settings": "På inställningssidan kan du se under vilken användarmail du är ansluten till vilken server. GitHub-integrationen (som kräver att du är Github-användare) gör att du kan ladda ner mallar och ladda upp egna kodstycken som gists. I inställningsavsnittet kan du ställa in editorspråket, rekordtypsnittsstorlek och några andra viktiga inställningar.",
	"linting-and-spelling": "Redigeraren har en inbyggd stavningskontroll - och visar om du har gjort ett stavfel. Linting är det sätt på vilket du håller din kod ren. Detta ökar läsbarheten och säkerställer att stilen i din kod är konsekvent.",
	"live-preview": "Här hittar du förhandsgranskningen i realtid - det vill säga vad användarna får se. Principen är bekant. WYSIWYG! Översatt tillbaka till engelska: Vad du ser är vad du får!",
	"markdown-help": "Det är inte svårt att lära sig Markdown-språket, vilket är en fördel jämfört med HTML. Det är mycket lättare att läsa - och snabbar upp arbetet enormt.",
	"monaco-editor": "På vänster sida finns kodbasen. Egentligen ganska bekant, om du redan har arbetat med HTML eller Markdown. Men oroa dig inte: Det hela öppnar sig snabbt - och hur skrämmande det än ser ut kommer du att lära dig det lätt.",
	"opened-wizard": "Det här fönstret visar och förklarar alla egenskaper som vår Polaroid har. Om du klickar på ett attribut kommer det att användas i vår kod. I vårt fall är det än så länge inget annat än attributet image, som innehåller en url.",
	"polaroid-double-click": "Dubbelklicka på ordet Polaroid. Nu kommer motsvarande element till höger att markeras.",
	"polaroid-hover": "Försök att hålla musen över ordet \"Polaroid\". Du får se: En liten förklaring visas. Du kan också hålla muspekaren över elementets attribut. När det gäller bilden ser du att det är en sträng som uppenbarligen pekar på en URL-adress. Om du vill kan du ersätta bilden. - Varje element i redigeraren kan utforskas på det här sättet.",
	"polaroid-lightbulb": "Om du klickar på namnet \"Polaroid\" visas en liten glödlampa ovanför Polaroid-komponentkoden. Om du klickar på den har du flera alternativ. För det första kan du göra vyn så att komponenten blir synlig, eller så kan du lämna in specifika frågor och föreslå förbättringar på GitHub.",
	"polaroid-wizard": "Om du håller muspekaren över elementet visas en liten röd ram med några knappar i det övre högra hörnet, som du kan använda för att göra olika saker. För att anpassa Polaroid klickar vi på den första knappen med kugghjulsikonen för att öppna \"Component Wizard\".",
	"translate-lesson": "Du har möjlighet att översätta hela lektionen till ett valfritt språk - vi erbjuder totalt 10 språk. Dessutom kan du också översätta enskilda avsnitt. För att göra detta måste du markera en text, högerklicka och välja kommandot översätta från snabbmenyn.",
	"two-panes": "Som du kan se: Redaktören är uppdelad i två delar (du kan till och med flytta staven i mitten). På så sätt kan du definiera hur mycket utrymme respektive ruta ska ta."
}
