{
	"animation-help": "当你想为你的页面增添色彩时，CSS动画是非常方便的。我们已经为您提供了一些预设。你需要把它们放在你的组件的`style`属性中，例如动画：'anim-fade-in 3s'。",
	"back-in-editor": "所以，我们在左边各自的线。我们神奇地创造了这个小宝丽来。你也可以很容易地在这里打出这段文字。但为了方便起见，我们已经把它从你的手中拿走了。",
	"change-online-mode": "在这里，您可以指定您的课程是否与编辑器中的服务器交互（在线）。但是，这需要在序言中指定服务器。如果不是这样的话，该按钮将被灰化，也就是说不能选择。",
	"click-button-to-jump": "只要点击这个小元素--就会跳到编辑器中的相应行。",
	"component-wizard-0": "在组件向导中，您可以完全控制您的组件。你可以看到它是如何工作的，你可以改变哪些属性--如果你喜欢这样的结果，你可以按 \"插入 \"按钮，改变后的组件将被复制到编辑器中。",
	"component-wizard-1": "这里你可以看到定义组件外观的代码。你可以手动编辑它。例如，当你点击一个新属性时，它也会自动更新。只要注意它就可以了",
	"component-wizard-10": "有些组件很庞大，很难找到一个属性。在这里你可以搜索它。这样做的好处是，你可以专注于你感兴趣的东西。",
	"component-wizard-11": "试试吧，添加一个属性，然后改变其值。不会出错的!",
	"component-wizard-12": "如果你点击这里，该组件将在编辑器中更新，并将成为你想要的样子。",
	"component-wizard-13": "如果你不喜欢你的改动，你可以在这里撤销它们。组件看起来和你打开向导之前一模一样。",
	"component-wizard-14": "如果您点击这里，您将关闭组件向导--但不会保存任何东西。",
	"component-wizard-2": "这是预览部分。这正是组件稍后在编辑器中的样子。",
	"component-wizard-3": "在这里你可以找到该组件的所有属性。",
	"component-wizard-4": "只要点击一下，你就可以设置是否应该使用相关的属性。只要点击它，就能看到代码的变化。",
	"component-wizard-5": "对于一些属性，我们并不清楚它们的作用。这段描述向你解释了它。",
	"component-wizard-6": "对于活动属性，你可以在这里更改数值，并在代码和预览中观察更新后的组件。",
	"component-wizard-7": "这是一个信息字段，指定属性的数据类型。例如，布尔值是 \"true \"或 \"false \"的值，数组是指一个元素列表。",
	"component-wizard-8": "在这里你会发现，如果你没有手动设置属性，就会设置默认值。",
	"component-wizard-9": "在这里你可以过滤属性列表，只显示当前使用或尚未使用的属性。你可以选择",
	"header-preview-button": "通过预览按钮，你可以看到网页上出现的页面。如果你再次按下它，它就会跳回编辑器视图。",
	"header-role-in-preview": "在这里，您可以选择您的角色--并以匿名用户、注册用户、课程所有者或在特定课程中注册的学生的身份查看页面。",
	"keyboard-shortcuts": "如果你想加快进程，快捷键是一个很大的帮助。你可以在这里找到它们的列表。",
	"link-docs": "在这里你可以打开ISLE文档，你也可以在互联网上找到https://isledocs.com/。",
	"link-export": "该按钮打开一个页面，您可以将您的课程上传到服务器。您必须有服务器地址和证书才能进行此操作。- 如果要继续学习教程，请点击 \"返回编辑器 \"按钮。",
	"link-settings": "设置页面会显示你在哪个用户邮箱下连接到哪个服务器。GitHub集成（需要你是Github用户）允许你下载模板，并将自己的代码片段作为gists上传。在设置部分，你可以设置编辑器语言、记录字体大小和其他一些重要设置。",
	"linting-and-spelling": "编辑器有一个内置的拼写检查器--如果你犯了错，它会显示给你。Linting是指你保持代码干净的方式。这可以增加可读性，并确保你的代码风格一致。",
	"live-preview": "在这里你可以找到实时预览--也就是你的用户能看到的东西。原理很熟悉。WYSIWYG!翻译成英文。What you see is what you get!",
	"markdown-help": "学习Markdown标记语言并不困难，这是比HTML的优势。它更容易阅读--并极大地加快了工作速度。",
	"monaco-editor": "在这里左边你可以找到代码库。其实很熟悉，如果你已经处理过HTML或Markdown。不过不用担心：整个过程很快就会打开--虽然看起来很可怕，但你会很容易学会的。",
	"opened-wizard": "这个窗口显示并解释了我们的Polaroid所具有的所有属性。如果一个属性被点击，它将在我们的代码中被使用。在我们的例子中，到目前为止，它只不过是图像属性，其中包含一个url。",
	"polaroid-double-click": "请双击宝丽来这个词。现在右边相应的元素将被高亮显示。",
	"polaroid-hover": "试着用鼠标悬停在 \"宝丽来 \"这个词上。你看会出现一个小的解释。你也可以将鼠标悬停在元素的属性上。对于图像，你看到它是一个字符串，显然指向一个URL地址。如果你愿意，你可以替换图片。- 编辑器中的每一个元素都可以用这种方式来探索。",
	"polaroid-lightbulb": "如果你点击 \"宝丽来 \"名称，宝丽来组件代码上方会出现一个小灯泡。如果你点击它，你有几个选项。首先，你可以让视图使组件可见，或者你可以在GitHub上提交具体的问题并提出改进建议。",
	"polaroid-wizard": "如果将鼠标悬停在元素上，会出现一个红色的小框，右上角有几个按钮，用这些按钮可以做各种事情。要自定义宝丽金，我们点击第一个带有齿轮图标的按钮，打开 \"元件向导\"。",
	"translate-lesson": "您可以选择将整个课程翻译成您所选择的语言--我们共提供10种语言。此外，您还可以翻译单个段落。要做到这一点，您需要突出显示一段文字，右击并从上下文菜单中选择翻译命令。",
	"two-panes": "如你所见。编辑器分为两部分（你甚至可以在中间移动条形图）。"
}
