{
	"bagging-description": "Η συνάθροιση Bootstrap χρησιμοποιείται συχνά με μεθόδους δέντρων απόφασης. Αντλώντας δείγματα bootstrap από τα αρχικά δεδομένα εκπαίδευσης εκτιμώντας ένα μοντέλο για κάθε δείγμα, οι προβλέψεις των εν λόγω μοντέλων υπολογίζονται στη συνέχεια κατά μέσο όρο για να προκύψουν προβλέψεις με χαμηλότερη διακύμανση που δεν είναι τόσο επιρρεπείς στην υπερπροσαρμογή.",
	"boosting-description": "Οι αλγόριθμοι ενίσχυσης, όπως ο AdaBoost, μαθαίνουν επαναληπτικά αδύναμους ταξινομητές και τους προσθέτουν σε έναν τελικό ισχυρό ταξινομητή σταθμίζοντάς τους. Καθώς προστίθενται ταξινομητές, τα λανθασμένα δεδομένα εισόδου αποκτούν μεγαλύτερο βάρος και τα παραδείγματα που ταξινομούνται σωστά χάνουν βάρος. Έτσι, οι μελλοντικοί αδύναμοι εκπαιδευτές επικεντρώνονται περισσότερο στα παραδείγματα που οι προηγούμενοι αδύναμοι εκπαιδευτές ταξινόμησαν λανθασμένα.",
	"cart-description": "Η ανάλυση δέντρων ταξινόμησης και παλινδρόμησης (CART) δημιουργεί ένα δέντρο που πηγαίνει από τα χαρακτηριστικά μιας παρατήρησης (που αναπαρίστανται στα κλαδιά) σε μια προβλεπόμενη τιμή (που αναπαρίσταται στα φύλλα).",
	"classification": "Ταξινόμηση",
	"clustering": "Συσταδοποίηση",
	"dimensionality-reduction": "Μείωση διαστάσεων",
	"elastic-net-description": "Το ελαστικό δίκτυο είναι μια μέθοδος κανονικοποιημένης παλινδρόμησης που συνδυάζει γραμμικά τις ποινές L1 και L2 των μεθόδων lasso και ridge.",
	"ensemble": "Σύνολο",
	"kmeans-description": "Ομαδοποίηση των παρατηρήσεων σε έναν σταθερό αριθμό (k) συστάδων, έτσι ώστε τα μέλη των συστάδων να είναι περισσότερο όμοια μεταξύ τους παρά με τις παρατηρήσεις σε άλλες συστάδες.",
	"knn-description": "Χρησιμοποιείται τόσο για παλινδρόμηση όσο και για ταξινόμηση. Χρησιμοποιεί ψήφο πλειοψηφίας μεταξύ των k-κοντινότερων σημείων για την ταξινόμηση kNN. Για την παλινδρόμηση, η έξοδος είναι ο μέσος όρος των k-πλησιέστερων τιμών.",
	"lasso-description": "Μέθοδος κανονικοποιημένης παλινδρόμησης που τιμωρεί τους συντελεστές παλινδρόμησης χρησιμοποιώντας τη νόρμα L1. Ανταλλάσσει χαμηλότερη διακύμανση με λίγη μεροληψία. Οδηγεί σε ένα αραιό μοντέλο.",
	"linear-regression-description": "Μοντελοποιεί τη σχέση μεταξύ μιας κλιμακωτής απόκρισης και μιας ή περισσότερων επεξηγηματικών μεταβλητών. Η απλή γραμμική παλινδρόμηση αναφέρεται στην περίπτωση που υπάρχει ένας προγνωστικός παράγοντας, η πολλαπλή γραμμική παλινδρόμηση χρησιμοποιείται με πολλαπλές επεξηγηματικές μεταβλητές. Ονομάζεται γραμμική επειδή η εκτιμώμενη συνάρτηση είναι γραμμική ως προς τους συντελεστές της.",
	"logistic-regression-description": "Η λογιστική παλινδρόμηση είναι μια μέθοδος ταξινόμησης που χρησιμοποιείται για την ανάθεση παρατηρήσεων σε μία από τις δύο κλάσεις. Η λογιστική παλινδρόμηση χρησιμοποιεί τη λογιστική σιγμοειδή συνάρτηση για να επιστρέψει μια τιμή πιθανότητας για κάθε κλάση",
	"naive-bayes-description": "Οι μέθοδοι Naive Bayes είναι ένα σύνολο αλγορίθμων ταξινόμησης που βασίζονται στην εφαρμογή του θεωρήματος του Bayes με την \"αφελή\" υπόθεση της υπό συνθήκη ανεξαρτησίας μεταξύ κάθε ζεύγους χαρακτηριστικών δεδομένης της τιμής της μεταβλητής κλάσης.",
	"neural-networks-description": "Τα τεχνητά νευρωνικά δίκτυα χρησιμοποιούνται για τη μοντελοποίηση πολύπλοκων σχέσεων μεταξύ εισόδων και εξόδων με την εκμάθηση μιας μη γραμμικής συνάρτησης χωρίς χειροκίνητο σχεδιασμό χαρακτηριστικών.",
	"pca-description": "Η ανάλυση κύριων συνιστωσών (PCA) χρησιμοποιεί έναν ορθογώνιο μετασχηματισμό για να μετατρέψει πιθανώς συσχετιζόμενες μεταβλητές σε ένα σύνολο τιμών γραμμικά ασυσχέτιστων μεταβλητών που ονομάζονται κύριες συνιστώσες.",
	"random-forest-description": "Τα Τυχαία Δάση κατασκευάζουν ένα πλήθος δέντρων απόφασης κατά την εκπαίδευση και επιστρέφουν την κλάση που είναι ο τρόπος των κλάσεων (ταξινόμηση) ή η μέση πρόβλεψη (παλινδρόμηση) των επιμέρους δέντρων.",
	"regression": "Παλινδρόμηση",
	"ridge-description": "Μέθοδος κανονικοποιημένης παλινδρόμησης που τιμωρεί τους συντελεστές παλινδρόμησης χρησιμοποιώντας τη νόρμα L2. Ανταλλάσσει χαμηλότερη διακύμανση με λίγη μεροληψία. Δεν δίνει αραιό μοντέλο, δηλαδή οι συντελεστές δεν οδηγούνται στο μηδέν.",
	"svm-description": "Οι μηχανές διανυσμάτων υποστήριξης είναι ταξινομητές διάκρισης. Δεδομένων δεδομένων εκπαίδευσης με ετικέτες, ο αλγόριθμος βρίσκει ένα βέλτιστο υπερεπίπεδο για την κατηγοριοποίηση νέων παραδειγμάτων. Σε δύο διαστάσεις αυτό το υπερεπίπεδο είναι μια γραμμή που το χωρίζει σε δύο μέρη.",
	"üca-description": "Η ανάλυση κύριων συνιστωσών (PCA) χρησιμοποιεί έναν ορθογώνιο μετασχηματισμό για να μετατρέψει πιθανώς συσχετιζόμενες μεταβλητές σε ένα σύνολο τιμών γραμμικά ασυσχέτιστων μεταβλητών που ονομάζονται κύριες συνιστώσες."
}
