{
	"bagging-description": "Агрегация Bootstrap часто используется с методами дерева решений. При построении образцов Bootstrap из исходных обучающих данных, оценивающих модель для каждой построенной выборки, предсказания указанных моделей затем усредняются, чтобы получить предсказания с более низкими отклонениями, не столь склонными к переподгонке.",
	"boosting-description": "Такие алгоритмы ускорения, как AdaBoost, итеративно изучают слабые классификаторы и добавляют их в конечный сильный классификатор, взвешивая их. По мере добавления классификаторов, неправильно классифицированные входные данные получают больший вес, и примеры, которые правильно классифицированы, теряют вес. Таким образом, будущие слабые учащиеся уделяют больше внимания примерам, которые предыдущие слабые учащиеся неправильно классифицировали.",
	"cart-description": "Анализ Classification And Regression Tree (CART) (Дерево классификации и регрессии) строит дерево, которое переходит от признаков наблюдения (представленных в ветвях) к прогнозируемому значению (представленному в листьях).",
	"classification": "Классификация",
	"clustering": "Кластеризация",
	"dimensionality-reduction": "Сокращение размеров",
	"elastic-net-description": "Эластичная сетка - это систематизированный метод регрессии, который линейно объединяет L1 и L2 пенальти методов лассо и гребня.",
	"ensemble": "Ансамбль",
	"kmeans-description": "Группировать наблюдения в фиксированное число (k) кластеров таким образом, чтобы члены кластера были больше похожи друг на друга, чем на наблюдения в других кластерах.",
	"knn-description": "Используется как для регрессии, так и для классификации. Использует большинство голосов среди k-краевых баллов для классификации kNN. Для регрессии выходное значение является средним значением k-зеленых значений.",
	"lasso-description": "Метод регуляризованной регрессии, который оштрафовывает коэффициенты регрессии по норме L1. Снижает дисперсию для некоторой погрешности. Приводит к разреженной модели.",
	"linear-regression-description": "Моделирует связь между скалярной реакцией и одной или несколькими объясняющими переменными. Простая линейная регрессия относится к случаю, когда присутствует один предиктор, используется множественная линейная регрессия с множественными объясняющими переменными. Она называется линейной, поскольку оценочная функция по своим коэффициентам является линейной.",
	"logistic-regression-description": "Логистическая регрессия - это метод классификации, используемый для присвоения наблюдений одному из двух классов. Логистическая регрессия использует логистическую сигмоидальную функцию для возврата значения вероятности для каждого класса",
	"naive-bayes-description": "Методы Наива Байеса представляют собой набор алгоритмов классификации, основанных на применении теоремы Байеса с \"наивным\" допущением условной независимости между каждой парой признаков при значении переменной класса.",
	"neural-networks-description": "Искусственные нейронные сети используются для моделирования сложных взаимоотношений между входами и выходами путем изучения нелинейной функции без ручного проектирования функций.",
	"random-forest-description": "Случайные леса строят множество деревьев принятия решений во время обучения и возвращают класс, который является режимом классов (классификация) или средним предсказанием (регрессия) отдельных деревьев.",
	"regression": "Регрессия",
	"ridge-description": "Метод регуляризованной регрессии, который оштрафовывает коэффициенты регрессии с использованием нормы L2. Снижает дисперсию для некоторой погрешности. Не дает разреженной модели, т.е. коэффициенты не доводятся до нуля.",
	"svm-description": "Поддержка векторные машины являются дискриминационные классификаторы. Учитывая помеченные данные обучения, алгоритм находит оптимальную гиперплоскость для классификации новых примеров. В двух измерениях эта гиперплоскость представляет собой линию, разделяющую ее на две части.",
	"üca-description": "Принципиальный компонентный анализ (PCA) использует ортогональное преобразование для преобразования возможно коррелированных переменных в набор значений линейно несвязанных переменных, называемых основными компонентами."
}
