{
	"click-instruction": "Щракнете върху елемент от менюто, за да научите повече за него...",
	"data-explorer-p1": "Проучвателят на данни ISLE ви позволява да анализирате набори от данни, като използвате интерфейс \"посочи и кликни\". Проучвателят на данни е разделен на два панела - ляв панел, в който можете да превключвате между изглед на електронна таблица с данни, които ще бъдат анализирани, и други незадължителни компоненти, като редактор за писане на отчети или списък с въпроси. Дясната страна е панел за изходи, който съдържа всички изходи (обобщени статистики, графики, резултати от тест на хипотези), които сте създали.",
	"data-explorer-p2": "Нови изходи могат да се генерират чрез кутията с инструменти, която може да се отвори, като се щракне върху бутона \"Покажи кутията с инструменти\". Новогенерираната диаграма или таблица ще бъде добавена към списъка с изходни елементи, показан в дясната страна",
	"data-explorer-p3": "Червените бутони с икони \"x\" могат да се използват за изтриване на отделни изходни елементи, а бутонът \"Clear All\" (Изчисти всичко) в долната част ще премахне всички изходни елементи.",
	"data-explorer-p4": "Използването на бутоните с въпросителен знак в таблицата с данни, редактора на отчети или кутията с инструменти ще ви позволи да започнете обиколка с водач из възможностите на различните части.",
	"data-explorer-title": "Изследовател на данни",
	"data-table-p1": "Един прост начин за показване на данни в ISLE е чрез таблица с данни. Те се появяват в типичния формат за разглеждане на данни, подобно на това как изглеждат данните в електронна таблица на Excel. Всяка колона е променлива с името на променливата в горната част.",
	"data-table-p2": "За да се запознаете с нещата, които можете да правите с таблиците с данни, щракнете върху бутона Show Tutorial (въпросителната в горния десен ъгъл на таблицата с данни).",
	"data-table-title": "Таблица с данни",
	"documentation": "Документация",
	"download-pdf": "Изтегляне на PDF",
	"questions-p1": "Много от уроците в ISLE ще съдържат въпроси, на които ще трябва да отговорите. Възможни са различни типове въпроси - от с кратък отговор до с множествен избор. Ето един пример за въпрос с кратък отговор:",
	"questions-p2": "Подаване на",
	"questions-p3": "След като отговорите на даден въпрос и сте готови да изпратите отговора си, щракнете върху бутона \"Изпрати\". Това записва работата ви, така че преподавателят да може да види отговора ви и да ви даде кредит за въпроса.",
	"questions-p4": "Бутони за обратна връзка",
	"questions-p5": "Понякога инструкторът може да включи бутони за обратна връзка (показани по-горе) на отделни въпроси. Левият бутон ви позволява да отбележите, че сте объркани от въпроса; централният бутон ви позволява да отбележите, че въпросът има смисъл; а десният бутон ви позволява да дадете конкретни коментари за обратна връзка с повече подробности.",
	"questions-p6": "Навигационни въпроси",
	"questions-p7": "Няколко въпроса могат да бъдат поставени на едно и също място на страницата. В такъв случай можете да се придвижвате между въпросите, като щракнете върху бутона \"Напред\" или изберете въпросите по номер:",
	"questions-title": "Въпроси",
	"statusbar-p1": "Щракването върху лентата на състоянието ще ви покаже бутони, с които можете да се регистрирате за акаунт в ISLE или да влезете в съществуващ такъв. В средата на лентата на състоянието ще намерите изведено вашето потребителско име или влязъл в системата. При задържане на мишката върху него ще се покажат няколко статистически данни за напредъка ви в урока: времето, прекарано в урока, процентът на изпълнените дейности в урока и общите ви точки за постижения.",
	"statusbar-title": "Лентата на състоянието"
}
