{
	"click-instruction": "Κάντε κλικ σε ένα στοιχείο στο μενού για να μάθετε περισσότερα γι' αυτό...",
	"close-documentation": "Κλείστε την τεκμηρίωση",
	"data-explorer-p1": "Ο εξερευνητής δεδομένων του ISLE σας επιτρέπει να αναλύετε σύνολα δεδομένων χρησιμοποιώντας ένα περιβάλλον point-and-click. Ο εξερευνητής δεδομένων χωρίζεται σε δύο παράθυρα, ένα αριστερό παράθυρο όπου μπορείτε να εναλλάσσεστε μεταξύ μιας προβολής των προς ανάλυση δεδομένων σε λογιστικό φύλλο και άλλων προαιρετικών στοιχείων, όπως ένας επεξεργαστής σύνταξης εκθέσεων ή ένας κατάλογος ερωτήσεων. Το δεξιό μέρος είναι ένα παράθυρο εξόδου που περιέχει όλα τα αποτελέσματα (συνοπτικά στατιστικά στοιχεία, διαγράμματα, αποτελέσματα του ελέγχου υποθέσεων) που έχετε δημιουργήσει.",
	"data-explorer-p2": "Νέες έξοδοι μπορούν να δημιουργηθούν μέσω της εργαλειοθήκης, η οποία μπορεί να ανοίξει κάνοντας κλικ στο κουμπί \"Εμφάνιση εργαλειοθήκης\". Μια νέα γραφική παράσταση ή ένας πίνακας θα προστεθεί στη λίστα των στοιχείων εξόδου που εμφανίζεται στη δεξιά πλευρά.",
	"data-explorer-p3": "Τα κόκκινα κουμπιά με τα εικονίδια \"x\" μπορούν να χρησιμοποιηθούν για τη διαγραφή μεμονωμένων στοιχείων εξόδου, ενώ το κουμπί \"Clear All\" στο κάτω μέρος θα διαγράψει όλα τα στοιχεία εξόδου.",
	"data-explorer-p4": "Χρησιμοποιώντας τα κουμπιά με το ερωτηματικό στο φύλλο δεδομένων, στον επεξεργαστή αναφορών ή στην εργαλειοθήκη, θα μπορέσετε να ξεκινήσετε μια ξενάγηση στις δυνατότητες των διαφόρων στοιχείων.",
	"data-explorer-title": "Εξερεύνηση δεδομένων",
	"data-table-p1": "Ένας απλός τρόπος εμφάνισης δεδομένων στο ISLE είναι μέσω ενός πίνακα δεδομένων. Αυτοί εμφανίζονται με την τυπική μορφή προβολής δεδομένων, παρόμοια με αυτή που έχουν τα δεδομένα σε ένα φύλλο του Excel. Κάθε στήλη είναι μια μεταβλητή με το όνομα της μεταβλητής στην κορυφή.",
	"data-table-p2": "Για μια ξενάγηση στα πράγματα που μπορείτε να κάνετε με τους πίνακες δεδομένων, κάντε κλικ στο κουμπί Show Tutorial (το ερωτηματικό πάνω δεξιά στον πίνακα δεδομένων).",
	"data-table-title": "Πίνακας δεδομένων",
	"documentation": "Τεκμηρίωση",
	"download-pdf": "Λήψη PDF",
	"questions-p1": "Πολλά από τα μαθήματα του ISLE που θα επεξεργαστείτε θα περιέχουν ερωτήσεις που θα πρέπει να απαντήσετε. Υπάρχει μια ποικιλία πιθανών τύπων ερωτήσεων, από σύντομες απαντήσεις έως ερωτήσεις πολλαπλής επιλογής. Ακολουθεί ένα παράδειγμα ερώτησης σύντομης απάντησης:",
	"questions-p2": "Υποβολή",
	"questions-p3": "Μόλις απαντήσετε σε μια ερώτηση και είστε έτοιμοι να υποβάλετε την απάντησή σας, κάντε κλικ στο κουμπί \"Υποβολή\". Αυτό καταγράφει την εργασία σας, ώστε ο καθηγητής σας να μπορεί να δει την απάντησή σας και να σας δώσει πίστωση για την ερώτηση.",
	"questions-p4": "Κουμπιά ανατροφοδότησης",
	"questions-p5": "Μερικές φορές, ο εκπαιδευτής σας μπορεί να περιλαμβάνει κουμπιά ανατροφοδότησης (όπως φαίνεται παραπάνω) σε μεμονωμένες ερωτήσεις. Το αριστερό κουμπί σας επιτρέπει να σημειώσετε ότι έχετε μπερδευτεί με την ερώτηση- το κεντρικό κουμπί σας επιτρέπει να σημειώσετε ότι η ερώτηση είναι λογική- και το δεξί κουμπί σας επιτρέπει να δώσετε συγκεκριμένα σχόλια ανατροφοδότησης με περισσότερες λεπτομέρειες.",
	"questions-p6": "Ερωτήσεις πλοήγησης",
	"questions-p7": "Πολλαπλές ερωτήσεις μπορούν να τοποθετηθούν στην ίδια θέση στη σελίδα. Σε αυτή την περίπτωση, μπορείτε να πλοηγηθείτε μεταξύ των ερωτήσεων κάνοντας κλικ στο κουμπί \"Επόμενο\" ή επιλέγοντας τις ερωτήσεις με βάση τον αριθμό τους:",
	"questions-title": "Ερωτήσεις",
	"statusbar-p1": "Κάνοντας κλικ στη γραμμή κατάστασης θα εμφανιστούν κουμπιά για να εγγραφείτε για λογαριασμό ISLE ή για να συνδεθείτε σε έναν υπάρχοντα λογαριασμό. Στη μέση της γραμμής κατάστασης, θα δείτε να εμφανίζεται το όνομα χρήστη σας ή να έχετε συνδεθεί. Αν περάσετε με το ποντίκι από πάνω του, θα εμφανιστούν διάφορα στατιστικά στοιχεία σχετικά με την πρόοδο του μαθήματός σας: ο χρόνος που αφιερώσατε στο μάθημα, το ποσοστό των δραστηριοτήτων που ολοκληρώθηκαν στο μάθημα και οι συνολικοί βαθμοί επίτευξής σας.",
	"statusbar-title": "Γραμμή κατάστασης"
}
