{
	"click-instruction": "Щелкните по пункту в меню, чтобы узнать об этом...",
	"data-explorer-p1": "Проводник данных ISLE позволяет анализировать наборы данных с помощью интерфейса \"точка-клик\". Проводник данных разделен на две панели, левую панель, на которой можно переключаться между просмотром анализируемых данных в электронной таблице и другими дополнительными компонентами, такими как редактор составления отчетов или список вопросов. Правая сторона - это панель вывода, содержащая все созданные Вами результаты (сводная статистика, графики, результаты проверки гипотез).",
	"data-explorer-p2": "Новые выходы могут быть сгенерированы с помощью панели инструментов, которую можно открыть, нажав на кнопку \"Показать панель инструментов\". Вновь сгенерированный график или таблица будет добавлен к списку элементов вывода, показанных справа.",
	"data-explorer-p3": "Красные кнопки со значками \"x\" можно использовать для удаления отдельных выходных элементов, в то время как кнопка \"Clear All\" внизу удалит все выходные элементы.",
	"data-explorer-p4": "Использование кнопок с вопросительным знаком в электронной таблице данных, редактора отчетов или панели инструментов позволит вам начать экскурсию по возможностям различных частей.",
	"data-explorer-title": "Исследователь данных",
	"data-table-p1": "Простой способ отображения данных в ISLE - через Таблицу данных. Они отображаются в типичном формате для просмотра данных, аналогичном тому, как данные выглядят в электронной таблице Excel. Каждый столбец представляет собой переменную с именем переменной в верхней части.",
	"data-table-p2": "Для проведения экскурсии по таблицам данных нажмите кнопку Показать учебное пособие (знак вопроса в верхней правой части таблицы данных).",
	"data-table-title": "Таблица данных",
	"documentation": "Документация",
	"download-pdf": "Скачать PDF",
	"questions-p1": "Многие из уроков ISLE, над которыми вы будете работать, будут содержать вопросы, на которые вы сможете ответить. Существует множество возможных типов вопросов, от короткого ответа до множественного выбора. Вот пример короткого ответа на вопрос:",
	"questions-p2": "Отправляя",
	"questions-p3": "После того, как вы ответили на вопрос и готовы отправить ответ, нажмите кнопку \"Отправить\". Это запишет вашу работу, чтобы ваш преподаватель мог увидеть ваш ответ и отдать вам должное за вопрос.",
	"questions-p4": "Кнопки обратной связи",
	"questions-p5": "Иногда ваш инструктор может включать кнопки обратной связи (показаны выше) по отдельным вопросам. Левая кнопка позволяет заметить, что вы запутались в вопросе; центральная кнопка позволяет заметить, что вопрос имеет смысл; а правая кнопка позволяет дать конкретные комментарии обратной связи более подробно.",
	"questions-p6": "Навигационные вопросы",
	"questions-p7": "Множественные вопросы могут быть размещены в одном и том же месте на странице. В этом случае Вы можете перемещаться между вопросами, нажимая кнопку \"Далее\" или выбирая вопросы по номеру:",
	"questions-title": "Вопросы",
	"statusbar-p1": "Нажав на строку состояния, вы увидите кнопки для регистрации ISLE аккаунта или для входа в существующий аккаунт. В середине строки состояния вы увидите отображение вашего имени пользователя или входа в систему. Наведя указатель мыши на него, вы увидите несколько статистических данных о ходе вашего урока: время, проведенное в лекции, процент выполненных действий, а также ваши общие баллы успеваемости.",
	"statusbar-title": "Строка состояния"
}
