{
	"finish": "Вече завършихте обиколката на различните интерфейсни елементи на урока на ISLE. Обърнете внимание на допълнителните обучителни бутони, прикрепени към отделните компоненти в урока, за да научите повече за тяхната функционалност и употреба.",
	"instructor-view-handler": "Панелът на инструктора е най-важният инструмент за учителя. Тук можете да виждате какво точно правят учениците ви и да имате общ поглед върху случващото се в класа.",
	"language-switcher": "Избирателят на езици в долния десен ъгъл ви позволява да настроите интерфейса на избрания от вас език. Ако съдържанието на урока е достъпно на няколко езика, може да имате късмет и да видите всичко на китайски, например. Във всеки случай интерфейсът ще бъде показан на вашия език.",
	"statusbar-blackscreen-mode": "От време на време има смисъл да се съсредоточите изцяло върху гласа на говорещия. Оттук идва и затъмнението, така да се каже, програмирано спиране. С него ще затъмните не само собствения си екран, но и този на учениците си. Още едно щракване - и животът продължава!",
	"statusbar-dashboard-button": "Информационното табло е мястото, където ISLE съхранява всички ваши движения. Когато кликнете върху него, ще се озовете в профила си и ще можете да получите достъп до посещаваните от вас курсове, да видите напредъка си, да промените настройките си и др.....",
	"statusbar-group-manager": "Груповият мениджър е много мощен инструмент. Ако искате да разпределите учениците си в групи, така че да могат да общуват помежду си или да работят заедно върху текстови документи, трябва само да въведете броя на групите - и воала! Всеки ученик се разпределя в група на случаен принцип.",
	"statusbar-info": "Лентата на състоянието е вашият информационен панел. Тя ви показва дали сте влезли в системата или не, показва името ви и профилната ви снимка (ако сте качили такава) - и ви позволява да получите достъп до профила си в ISLE в таблото за управление.",
	"statusbar-login-button": "Входът трябва да е разбираем. Въвеждате потребителските си данни - и сте онлайн. Ако искате да сте на сигурно място, можете да активирате 2-факторно удостоверяване в таблото за управление на ISLE.",
	"statusbar-logout-button": "По този начин можете да излезете от системата. Довиждане...",
	"statusbar-presence": "По подразбиране иконата на кръга е зелена, за да сигнализира, че урокът може да се свърже със сървъра на ISLE. Ако сървърът не работи или вие сте изключени от интернет, вместо това тя ще се покаже в тъмнооранжево.",
	"statusbar-presentation-mode": "Режимът на представяне е предназначен за преподаватели, за да опростят показвания интерфейс, когато споделят своите екрани. Когато щракнете върху него, лентата на състоянието и другите елементи на интерфейса ще се скрият. За да възстановите оригиналния изглед, натиснете функционалния клавиш F7 или щракнете върху бутона за очи в горния ляв ъгъл.",
	"statusbar-signup-button": "Процесът на регистрация е лесен. Въвеждате името си, имейл адреса си и паролата си - и това е всичко.",
	"statusbar-text-chat": "Текстовият чат ви позволява да общувате с други членове, които са онлайн в урока, анонимно или с името си. Ако е приложимо, можете да видите броя на публикациите в чата под иконата.",
	"statusbar-username": "Тук трябва да видите името си, ако сте влезли в системата. Ако все още не сте влезли в системата, ще ви бъде зададен уникален идентификатор, създаден за вас, предшестван от Anonymous.",
	"statusbar-video-chat": "ISLE разполага с вграден инструмент за конферентна връзка, който ви позволява да провеждате видео чат с други потребители, които са там по същото време. А ако прическата не ви подхожда, просто изключвате камерата - и другият човек все още може да ви чува.",
	"statusbar-voice-info": "За да създавате надписи в реално време или да управлявате елементите на интерфейса чрез глас, можете да използвате микрофона си. Просто щракнете върху иконата и тя ще стане червена, за да покаже, че записва. Ще видите и транскрипция, която ви казва какво е разбрал. За да копирате и поставите транскрипцията, просто щракнете върху иконата CC, която ще се покаже вдясно от нея. Ще се отвори прозорец с редактор и в него ще намерите записания текст. Ако искате да спрете режима на запис, просто щракнете отново върху микрофона и той отново ще стане сив.",
	"sticky-note": "Ако щракнете с десния бутон на мишката, можете да създадете постоянни лични лепящи се бележки за урока (които ще се покажат в зелено). Освен това учителите могат да оставят бележки за всички ученици, които ще бъдат оцветени в оранжево.",
	"toolbar-calculator": "Тук можете да получите достъп до калкулатор, който ви позволява да правите прости, но и научни изчисления.",
	"toolbar-help": "Анкетите позволяват на преподавателя да прави малки проучвания сред участниците. Има четири вида: въпрос с \"да/не\", въпрос за бързина, алтернатива \"харесвам/не харесвам\", и накрая различни видове анкети: анкети със свободен текст, анкети с избор между няколко отговора и анкети с числа.",
	"toolbar-queue": "Опашката позволява на ученика да задава въпроси. Всички те са подредени в последователност, откъдето идва и името им.",
	"toolbar-sketchpad": "Скицникът ви позволява да правите бележки в графичен вид. Те са постоянни, така че могат да бъдат възстановени по-късно. Бележките на учителя се предават на всички ученици в реално време, следователно са публично видими.",
	"toolbar-ticketing": "Тук потребителите могат да създадат билет, в който да посочат програмна грешка или друг проблем в урока.",
	"toolbar-toggle": "Със следния бутон можете да отворите или затворите лентата с инструменти. Там ще намерите някои много полезни инструменти..."
}
