{
	"finish": "Nyní jste dokončili prohlídku různých prvků rozhraní lekce ISLE. Sledujte další výuková tlačítka připojená k jednotlivým komponentám uvnitř lekce, abyste se dozvěděli více o jejich funkčnosti a použití.",
	"instructor-view-handler": "Panel Instruktor je pro učitele nejdůležitějším nástrojem. Zde můžete přesně vidět, co vaši studenti dělají, a mít přehled o tom, co se ve třídě děje.",
	"language-switcher": "Výběr jazyka v pravém dolním rohu umožňuje nastavit rozhraní do zvoleného jazyka. Pokud je obsah lekce k dispozici ve více jazycích, můžete mít štěstí - a zobrazit ji celou například v čínštině. V každém případě se rozhraní zobrazí ve vašem jazyce.",
	"statusbar-blackscreen-mode": "Čas od času má smysl zaměřit se výhradně na hlas řečníka. Proto ten výpadek, takříkajíc naprogramovaný klid. Díky němu zatemníte nejen svou vlastní obrazovku, ale také obrazovku svých studentů. Ještě jedno kliknutí - a život jde dál!",
	"statusbar-dashboard-button": "Na palubní desce jsou uloženy všechny vaše pohyby v systému ISLE. Když na něj kliknete, ocitnete se ve svém účtu a budete mít přístup ke svým navštíveným kurzům, budete si moci prohlédnout svůj pokrok, změnit nastavení a další.....",
	"statusbar-group-manager": "Správce skupiny je velmi výkonný nástroj. Pokud chcete své studenty přiřadit do skupin, aby spolu mohli chatovat nebo společně pracovat na textových dokumentech, stačí zadat počet skupin - a voilà! Každý student je náhodně přiřazen do skupiny.",
	"statusbar-info": "Stavový řádek je informační panel. Informuje vás o tom, zda jste přihlášeni, nebo ne, zobrazuje vaše jméno a profilový obrázek (pokud jste jej nahráli) - a umožňuje vám přístup k vašemu účtu ISLE na hlavním panelu.",
	"statusbar-login-button": "Přihlášení by mělo být zřejmé. Zadáte své uživatelské údaje - a jste online. Pokud chcete být v bezpečí, můžete si v ovládacím panelu ISLE aktivovat dvoufaktorové ověřování.",
	"statusbar-logout-button": "Tímto způsobem se můžete odhlásit. Sbohem...",
	"statusbar-presence": "Ve výchozím nastavení je ikona kruhu vyplněna zeleně, což signalizuje, že se lekce může připojit k serveru ISLE. V případě, že server nefunguje nebo jste odpojeni od internetu, zobrazí se místo toho tmavě oranžově.",
	"statusbar-presentation-mode": "Prezentační režim je určen pro instruktory, kteří chtějí zjednodušit zobrazované rozhraní při sdílení obrazovek. Po kliknutí na něj se stavový řádek a další prvky rozhraní skryjí. Původní zobrazení obnovíte stisknutím funkční klávesy F7 nebo kliknutím na tlačítko oka v levém horním rohu.",
	"statusbar-signup-button": "Proces registrace je jednoduchý. Zadáte své jméno, e-mailovou adresu a heslo - a to je vše.",
	"statusbar-text-chat": "Textový chat umožňuje komunikovat s ostatními členy, kteří jsou v hodině online, anonymně nebo pod svým jménem. Případně můžete pod ikonou vidět počet příspěvků v chatu.",
	"statusbar-username": "Zde by se mělo zobrazit vaše jméno, pokud jste přihlášeni. Pokud ještě nejste přihlášeni, bude vám přidělen jedinečný identifikátor vytvořený pro vás, před nímž bude stát Anonymní.",
	"statusbar-video-chat": "ISLE má vestavěný konferenční nástroj, který umožňuje videochat s ostatními uživateli, kteří jsou na místě ve stejnou dobu. A pokud se vám účes nehodí, stačí vypnout kameru - a druhá osoba vás stále slyší.",
	"statusbar-voice-info": "Chcete-li vytvářet titulky v reálném čase nebo ovládat prvky rozhraní hlasem, můžete použít mikrofon. Stačí kliknout na ikonu a ta zčervená, což znamená, že se nahrává. Zobrazí se také přepis, který vás informuje o tom, čemu bylo rozumět. Chcete-li přepis zkopírovat a vložit, stačí kliknout na ikonu CC, která se zobrazí napravo od něj. Otevře se okno s editorem a v něm najdete nahraný text. Pokud chcete režim nahrávání ukončit, stačí znovu kliknout na mikrofon a ten opět zešedne.",
	"sticky-note": "Pokud kliknete pravým tlačítkem myši, můžete si pro danou lekci vytvořit trvalé osobní samolepicí poznámky (které se zobrazí zeleně). Kromě toho mohou učitelé zanechat poznámky pro všechny žáky, které budou zbarveny oranžově.",
	"toolbar-calculator": "Zde máte přístup ke kalkulačce, která umožňuje provádět jednoduché, ale i vědecké výpočty.",
	"toolbar-help": "Ankety umožňují školiteli provádět malé průzkumy mezi účastníky. K dispozici jsou čtyři typy: otázka ano/ne, rychlá otázka, alternativa líbí/nelíbí, a nakonec různé typy anket: ankety s volným textem, s výběrem odpovědí a s čísly.",
	"toolbar-queue": "Fronta umožňuje studentům klást otázky. Všechny jsou seřazeny za sebou, odtud název.",
	"toolbar-sketchpad": "Náčrtník vám umožní vytvářet poznámky v grafické podobě. Jsou trvalé, takže je lze později obnovit. Poznámky učitele jsou přenášeny všem studentům v reálném čase, jsou tedy veřejně viditelné.",
	"toolbar-ticketing": "Zde mohou uživatelé vytvořit tiket, ve kterém upozorní na programátorskou chybu nebo jiný problém ve výuce.",
	"toolbar-toggle": "Následujícím tlačítkem můžete panel nástrojů otevřít nebo zavřít. Najdete zde několik velmi užitečných nástrojů..."
}
