{
	"finish": "Du har nu afsluttet rundvisningen i de forskellige grænsefladeelementer i en ISLE-lektion. Hold øje med de yderligere knapper, der er knyttet til de enkelte komponenter i lektionen for at lære mere om deres funktionalitet og brug.",
	"instructor-view-handler": "Instruktørpanelet er det vigtigste værktøj for læreren. Her kan du se præcis, hvad dine elever laver, og du kan få et overblik over, hvad der foregår i klassen.",
	"language-switcher": "Med sprogvælgeren nederst til højre kan du indstille grænsefladen til det sprog, du ønsker. Hvis lektionens indhold er tilgængeligt på flere sprog, kan du være heldig - og se det hele på kinesisk, for eksempel. Under alle omstændigheder vil grænsefladen blive vist på dit sprog.",
	"statusbar-blackscreen-mode": "Fra tid til anden er det fornuftigt at fokusere helt på talerens stemme. Derfor blackout, en programmeret stilstand, så at sige. Med den vil du ikke kun mørklægge din egen skærm, men også dine elevers. Et klik mere - og livet går videre!",
	"statusbar-dashboard-button": "Dashboardet er det sted, hvor ISLE gemmer alle dine bevægelser. Når du klikker på det, lander du på din konto, og du kan få adgang til de kurser du har deltaget i, se dine fremskridt, ændre dine indstillinger og meget mere....",
	"statusbar-group-manager": "Gruppeadministratoren er et meget effektivt værktøj. Hvis du ønsker at tildele dine elever til grupper, så de kan chatte med hinanden eller arbejde sammen på tekstdokumenter, skal du blot indtaste antallet af grupper - og voilà! Hver elev bliver tilfældigt tildelt en gruppe.",
	"statusbar-info": "Statuslinjen er dit informationspanel. Den fortæller dig, om du er logget ind eller ej, den viser dit navn og dit profilbillede (hvis du har uploadet et) - og den giver dig adgang til din ISLE-konto på instrumentbrættet.",
	"statusbar-login-button": "Login bør være selvforklarende. Du indtaster dine brugerdata - og så er du online. Hvis du vil være på den sikre side, kan du aktivere 2-faktor-autentifikation i dit ISLE-dashboard.",
	"statusbar-logout-button": "På denne måde kan du logge ud. Farvel ...",
	"statusbar-presence": "Som standard vil cirkelikonet være fyldt grønt for at signalere, at lektionen kan oprette forbindelse til ISLE-serveren. Hvis serveren er nede, eller hvis du ikke har forbindelse til internettet, vises det i stedet i mørk orange.",
	"statusbar-presentation-mode": "Præsentationstilstanden er beregnet til instruktører for at forenkle den viste grænseflade, når de deler deres skærme. Når du klikker på den, skjules statuslinjen og andre grænsefladeelementer. Hvis du vil gendanne den oprindelige visning, skal du trykke på funktionstasten F7 eller klikke på øje-knappen øverst til venstre.",
	"statusbar-signup-button": "Registreringsprocessen er enkel. Du indtaster dit navn, din e-mailadresse og en adgangskode - og det er det hele.",
	"statusbar-text-chat": "Tekstchatten giver dig mulighed for at kommunikere med andre medlemmer, der er online i undervisningen, anonymt eller med dit navn. Hvis det er relevant, kan du se antallet af indlæg i chatten under ikonet.",
	"statusbar-username": "Her bør du se dit navn, hvis du er logget ind. Hvis du ikke er logget ind endnu, vil du få tildelt en unik identifikator, der er oprettet til dig, med Anonymous som foranstillet.",
	"statusbar-video-chat": "ISLE har et indbygget konferenceværktøj, der giver dig mulighed for at videochatte med andre brugere, der er til stede på samme tid. Og hvis frisuren ikke passer, slukker du bare for kameraet - og den anden person kan stadig høre dig.",
	"statusbar-voice-info": "Du kan bruge din mikrofon til at oprette undertekster i realtid eller styre grænsefladeelementer via stemmen. Du skal blot klikke på ikonet, så bliver det rødt for at angive, at det er ved at optage. Du vil også se en transskription, der fortæller dig, hvad den har forstået. Hvis du vil kopiere og indsætte udskriftet, skal du blot klikke på CC-ikonet, der vises til højre for det. Et vindue med en editor åbnes, og i det finder du din optagede tekst. Hvis du ønsker at stoppe optagelsestilstanden, skal du blot klikke på mikrofonen igen, hvorefter den bliver grå igen.",
	"sticky-note": "Hvis du højreklikker, kan du oprette permanente personlige klistermærker til lektionen (som vises med grønt). Derudover kan lærere efterlade noter til alle elever, som vil blive farvet orange.",
	"toolbar-calculator": "Her kan du få adgang til en lommeregner, som giver dig mulighed for at foretage enkle, men også videnskabelige beregninger.",
	"toolbar-help": "Afstemninger giver instruktøren mulighed for at foretage små undersøgelser blandt deltagerne. Der er fire typer: et ja/nej-spørgsmål, et hastighedsspørgsmål, et like/dislike-alternativ, og endelig forskellige typer af undersøgelser: fritekst-, multiple-choice- og talundersøgelser.",
	"toolbar-queue": "Køen giver den studerende mulighed for at stille spørgsmål. De er alle arrangeret i rækkefølge, deraf navnet.",
	"toolbar-sketchpad": "Skitseblok giver dig mulighed for at lave noter i grafisk form. De er vedvarende, så de kan hentes senere. Lærerens noter overføres til alle elever i realtid og er derfor offentligt synlige.",
	"toolbar-ticketing": "Her kan brugerne oprette en billet og gøre opmærksom på en programmeringsfejl eller et andet problem i undervisningen.",
	"toolbar-toggle": "Med den følgende knap kan du åbne eller lukke værktøjslinjen. Der finder du nogle meget nyttige værktøjer..."
}
