{
	"finish": "Sie haben nun die Tour durch die verschiedenen Oberflächenelemente einer ISLE-Lektion abgeschlossen. Achten Sie auf weitere Tutorial-Schaltflächen, die an einzelnen Komponenten innerhalb der Lektion angebracht sind, um mehr über deren Funktionalität und Verwendung zu erfahren.",
	"instructor-view-handler": "Das Dozentenpanel ist das wichtigste Werkzeug für den Lehrer. Hier können Sie genau sehen, was Ihre Schüler tun und haben einen Überblick über das Geschehen in der Klasse",
	"language-switcher": "Mit der Sprachauswahl unten rechts können Sie die Oberfläche auf die Sprache Ihrer Wahl einstellen. Wenn der Inhalt der Lektion in mehreren Sprachen verfügbar ist, haben Sie vielleicht Glück - und sehen das Ganze z. B. auf Chinesisch. In jedem Fall wird die Oberfläche in Ihrer Sprache angezeigt.",
	"statusbar-blackscreen-mode": "Von Zeit zu Zeit ist es sinnvoll, sich ganz auf die Stimme des Sprechers zu konzentrieren. Daher der Blackout, ein programmierter Stillstand sozusagen. Mit ihm verdunkeln Sie nicht nur Ihren eigenen Bildschirm, sondern auch den Ihrer Teilnehmer. Ein weiterer Klick - und das Leben geht weiter!",
	"statusbar-dashboard-button": "Das Dashboard ist der Ort, an dem ISLE alle Ihre Bewegungen speichert. Wenn Sie darauf klicken, landen Sie in Ihrem Konto und können auf Ihre besuchten Kurse zugreifen, Ihren Fortschritt einsehen, Ihre Einstellungen ändern und mehr....",
	"statusbar-group-manager": "Der Gruppenmanager ist ein sehr mächtiges Werkzeug. Wenn Sie Ihre Schüler in Gruppen einteilen möchten, damit sie miteinander chatten oder gemeinsam an Textdokumenten arbeiten können, müssen Sie nur die Anzahl der Gruppen eingeben - und voilà! Jeder Schüler wird nach dem Zufallsprinzip einer Gruppe zugewiesen.",
	"statusbar-info": "Die Statusleiste ist Ihr Info-Panel. Sie sagt Ihnen, ob Sie eingeloggt sind oder nicht, sie zeigt Ihren Namen und Ihr Profilbild (wenn Sie eines hochgeladen haben) - und sie ermöglicht Ihnen den Zugriff auf Ihr ISLE-Konto im Dashboard.",
	"statusbar-login-button": "Die Anmeldung sollte selbsterklärend sein. Sie geben Ihre Benutzerdaten ein - und schon sind Sie online. Wenn Sie auf Nummer sicher gehen wollen, können Sie in Ihrem ISLE Dashboard die 2-Faktor-Authentifizierung aktivieren.",
	"statusbar-logout-button": "Auf diese Weise können Sie sich abmelden. Auf Wiedersehen ...",
	"statusbar-presence": "Standardmäßig wird das Kreissymbol grün ausgefüllt, um zu signalisieren, dass die Lektion eine Verbindung zum ISLE-Server herstellen kann. Sollte der Server ausgefallen sein oder die Internetverbindung unterbrochen sein, wird es stattdessen dunkelorange dargestellt.",
	"statusbar-presentation-mode": "Der Präsentationsmodus ist für Dozenten gedacht, um die angezeigte Oberfläche bei der gemeinsamen Nutzung ihres Bildschirms zu vereinfachen. Wenn Sie auf ihn klicken, werden die Statusleiste und andere Oberflächenelemente ausgeblendet. Um die ursprüngliche Ansicht wiederherzustellen, drücken Sie die Funktionstaste F7 oder klicken Sie auf die Augenschaltfläche oben links.",
	"statusbar-signup-button": "Der Registrierungsprozess ist einfach. Sie geben Ihren Namen, Ihre E-Mail-Adresse und ein Passwort ein - und das war's.",
	"statusbar-text-chat": "Im Text-Chat können Sie mit anderen Mitgliedern, die in der Lektion online sind, anonym oder mit Ihrem Namen kommunizieren. Gegebenenfalls können Sie die Anzahl der Beiträge im Chat unterhalb des Symbols sehen.",
	"statusbar-username": "Hier sollten Sie Ihren Namen angezeigt bekommen, wenn Sie angemeldet sind. Wenn Sie noch nicht angemeldet sind, wird Ihnen eine eindeutige Kennung zugewiesen, die für Sie erstellt wurde und der Anonym vorangestellt ist.",
	"statusbar-video-chat": "ISLE hat ein eingebautes Conferencing-Tool, mit dem Sie mit anderen Nutzern, die zur gleichen Zeit dort sind, per Video chatten können. Und wenn die Frisur nicht passt, schalten Sie einfach die Kamera aus - und die andere Person kann Sie immer noch hören.",
	"statusbar-voice-info": "Um Echtzeitbeschriftungen zu erstellen oder Oberflächenelemente per Sprache zu steuern, können Sie Ihr Mikrofon verwenden. Klicken Sie einfach auf das Symbol und es wird rot, um anzuzeigen, dass es aufnimmt. Sie sehen auch eine Transkription, die Ihnen sagt, was verstanden wurde. Um das Transkript zu kopieren und einzufügen, klicken Sie einfach auf das CC-Symbol, das rechts daneben angezeigt wird. Es öffnet sich ein Fenster mit einem Editor, in dem Sie Ihren aufgenommenen Text finden. Wenn Sie den Aufnahmemodus beenden möchten, klicken Sie einfach erneut auf das Mikrofon, das dann wieder grau wird.",
	"sticky-note": "Wenn Sie mit der rechten Maustaste klicken, können Sie permanente persönliche Haftnotizen für die Lektion erstellen (die in grüner Farbe angezeigt werden). Zusätzlich können Lehrer Notizen für alle Schüler hinterlassen, die dann orange eingefärbt werden.",
	"toolbar-calculator": "Hier haben Sie Zugriff auf einen Taschenrechner, mit dem Sie einfache, aber auch wissenschaftliche Berechnungen durchführen können.",
	"toolbar-help": "Umfragen ermöglichen es dem Kursleiter, kleine Umfragen unter den Teilnehmern durchzuführen. Es gibt vier Arten: eine Ja/Nein-Frage, eine Geschwindigkeitsfrage, eine Gefällt-mir/Abgelehnt-Alternative und schließlich verschiedene Umfragearten: Freitext-, Multiple-Choice- und Zahlenumfragen.",
	"toolbar-queue": "Die Warteschlange ermöglicht es dem Schüler, Fragen zu stellen. Sie sind alle der Reihe nach angeordnet, daher der Name.",
	"toolbar-sketchpad": "Der Skizzenblock ermöglicht es Ihnen, Notizen in grafischer Form zu machen. Sie sind persistent, so dass sie später wieder abgerufen werden können. Die Notizen des Lehrers werden in Echtzeit an alle Schüler übertragen, sind also öffentlich sichtbar.",
	"toolbar-ticketing": "Hier können Benutzer ein Ticket erstellen, das auf einen Programmierfehler oder ein anderes Problem in der Lektion hinweist.",
	"toolbar-toggle": "Mit der folgenden Schaltfläche können Sie die Symbolleiste öffnen oder schließen. Dort finden Sie einige sehr hilfreiche Werkzeuge..."
}
