{
	"finish": "Έχετε πλέον ολοκληρώσει την περιήγηση στα διάφορα στοιχεία διεπαφής ενός μαθήματος ISLE. Προσέξτε τα πρόσθετα κουμπιά διδασκαλίας που είναι προσαρτημένα σε μεμονωμένα στοιχεία μέσα στο μάθημα για να μάθετε περισσότερα σχετικά με τη λειτουργικότητα και τη χρήση τους.",
	"instructor-view-handler": "Ο πίνακας Εκπαιδευτής είναι το πιο σημαντικό εργαλείο για τον εκπαιδευτικό. Εδώ μπορείτε να βλέπετε ακριβώς τι κάνουν οι μαθητές σας και να έχετε μια γενική εικόνα του τι συμβαίνει στην τάξη.",
	"language-switcher": "Ο επιλογέας γλώσσας κάτω δεξιά σας επιτρέπει να ρυθμίσετε τη διεπαφή στη γλώσσα της επιλογής σας. Αν το περιεχόμενο του μαθήματος είναι διαθέσιμο σε πολλές γλώσσες, μπορεί να είστε τυχεροί και να δείτε το όλο θέμα στα κινέζικα, για παράδειγμα. Σε κάθε περίπτωση, η διεπαφή θα εμφανίζεται στη γλώσσα σας.",
	"statusbar-blackscreen-mode": "Από καιρό σε καιρό, έχει νόημα να εστιάζετε εξ ολοκλήρου στη φωνή του ομιλητή. Εξ ου και η συσκότιση, μια προγραμματισμένη στάση, κατά κάποιο τρόπο. Με αυτήν, δεν θα σκοτεινιάσετε μόνο τη δική σας οθόνη, αλλά και εκείνη των μαθητών σας. Ένα ακόμη κλικ - και η ζωή συνεχίζεται!",
	"statusbar-dashboard-button": "Το Dashboard είναι το σημείο όπου το ISLE αποθηκεύει όλες τις κινήσεις σας. Όταν κάνετε κλικ σε αυτό, θα καταλήξετε στο λογαριασμό σας και θα μπορείτε να έχετε πρόσβαση στα μαθήματα που παρακολουθήσατε, να δείτε την πρόοδό σας, να αλλάξετε τις ρυθμίσεις σας και πολλά άλλα.....",
	"statusbar-group-manager": "Ο διαχειριστής ομάδων είναι ένα πολύ ισχυρό εργαλείο. Αν θέλετε να αναθέσετε τους μαθητές σας σε ομάδες, ώστε να μπορούν να συνομιλούν μεταξύ τους ή να εργάζονται μαζί σε έγγραφα κειμένου, αρκεί να εισάγετε τον αριθμό των ομάδων - και ιδού! Κάθε μαθητής κατανέμεται τυχαία σε μια ομάδα.",
	"statusbar-info": "Η γραμμή κατάστασης είναι ο πίνακας πληροφοριών σας. Σας ενημερώνει αν είστε συνδεδεμένοι ή όχι, δείχνει το όνομά σας και την εικόνα προφίλ σας (αν έχετε ανεβάσει μία) - και σας επιτρέπει να έχετε πρόσβαση στο λογαριασμό σας ISLE στο ταμπλό.",
	"statusbar-login-button": "Η σύνδεση θα πρέπει να είναι αυτονόητη. Εισάγετε τα στοιχεία χρήστη σας - και είστε συνδεδεμένοι. Αν θέλετε να είστε ασφαλείς, μπορείτε να ενεργοποιήσετε τον έλεγχο ταυτότητας 2 παραγόντων στον πίνακα ελέγχου ISLE.",
	"statusbar-logout-button": "Με αυτόν τον τρόπο μπορείτε να αποσυνδεθείτε. Αντίο ...",
	"statusbar-presence": "Από προεπιλογή, το εικονίδιο του κύκλου θα είναι γεμάτο πράσινο για να σηματοδοτήσει ότι το μάθημα μπορεί να συνδεθεί με τον διακομιστή ISLE. Σε περίπτωση που ο διακομιστής είναι εκτός λειτουργίας ή έχετε αποσυνδεθεί από το διαδίκτυο, θα εμφανίζεται με σκούρο πορτοκαλί χρώμα.",
	"statusbar-presentation-mode": "Η λειτουργία παρουσίασης προορίζεται για τους εκπαιδευτές ώστε να απλοποιήσουν την εμφανιζόμενη διεπαφή όταν μοιράζονται τις οθόνες τους. Όταν κάνετε κλικ σε αυτήν, η γραμμή κατάστασης και άλλα στοιχεία διεπαφής θα αποκρύπτονται. Για να επαναφέρετε την αρχική προβολή, πατήστε το πλήκτρο λειτουργίας F7 ή κάντε κλικ στο κουμπί μάτι που βρίσκεται πάνω αριστερά.",
	"statusbar-signup-button": "Η διαδικασία εγγραφής είναι απλή. Εισάγετε το όνομά σας, τη διεύθυνση ηλεκτρονικού ταχυδρομείου σας και έναν κωδικό πρόσβασης - και αυτό είναι όλο.",
	"statusbar-text-chat": "Η συνομιλία κειμένου σας επιτρέπει να επικοινωνείτε με άλλα μέλη που είναι συνδεδεμένα στο μάθημα, ανώνυμα ή με το όνομά σας. Κατά περίπτωση, μπορείτε να δείτε τον αριθμό των δημοσιεύσεων στη συνομιλία κάτω από το εικονίδιο.",
	"statusbar-username": "Εδώ θα πρέπει να δείτε το όνομά σας αν έχετε συνδεθεί. Αν δεν έχετε συνδεθεί ακόμα, θα σας δοθεί ένα μοναδικό αναγνωριστικό που δημιουργήθηκε για εσάς και θα προηγείται το Anonymous.",
	"statusbar-video-chat": "Το ISLE διαθέτει ένα ενσωματωμένο εργαλείο τηλεδιάσκεψης που σας επιτρέπει να συνομιλήσετε μέσω βίντεο με άλλους χρήστες που βρίσκονται εκεί την ίδια στιγμή. Και αν το χτένισμα δεν σας ταιριάζει, απλά απενεργοποιείτε την κάμερα - και ο άλλος μπορεί να σας ακούσει.",
	"statusbar-voice-info": "Για να δημιουργήσετε λεζάντες σε πραγματικό χρόνο ή να ελέγξετε στοιχεία διεπαφής μέσω φωνής, μπορείτε να χρησιμοποιήσετε το μικρόφωνό σας. Απλώς κάντε κλικ στο εικονίδιο και αυτό θα γίνει κόκκινο για να υποδείξει ότι γίνεται ηχογράφηση. Θα δείτε επίσης μια μεταγραφή που θα σας λέει τι έχει καταλάβει. Για να αντιγράψετε και να επικολλήσετε την απομαγνητοφώνηση, απλά κάντε κλικ στο εικονίδιο CC που θα εμφανιστεί στα δεξιά του. Θα ανοίξει ένα παράθυρο με έναν επεξεργαστή και σε αυτό θα βρείτε το καταγεγραμμένο κείμενό σας. Αν θέλετε να σταματήσετε τη λειτουργία εγγραφής, απλά κάντε ξανά κλικ στο μικρόφωνο και αυτό θα γίνει πάλι γκρι.",
	"sticky-note": "Αν κάνετε δεξί κλικ, μπορείτε να δημιουργήσετε μόνιμες προσωπικές αυτοκόλλητες σημειώσεις για το μάθημα (οι οποίες θα εμφανίζονται με πράσινο χρώμα). Επιπλέον, οι καθηγητές μπορούν να αφήσουν σημειώσεις για όλους τους μαθητές, οι οποίες θα εμφανίζονται με πορτοκαλί χρώμα.",
	"toolbar-calculator": "Εδώ μπορείτε να έχετε πρόσβαση σε μια αριθμομηχανή που σας επιτρέπει να κάνετε απλούς, αλλά και επιστημονικούς υπολογισμούς.",
	"toolbar-help": "Οι δημοσκοπήσεις επιτρέπουν στον εκπαιδευτή να διεξάγει μικρές έρευνες μεταξύ των συμμετεχόντων. Υπάρχουν τέσσερις τύποι: μια ερώτηση ναι/όχι, μια ερώτηση ταχύτητας, μια εναλλακτική επιλογή \"αρέσει/δεν αρέσει\", τέλος, διάφοροι τύποι έρευνας: έρευνες ελεύθερου κειμένου, πολλαπλής επιλογής και αριθμητικές έρευνες.",
	"toolbar-queue": "Η ουρά επιτρέπει στο μαθητή να κάνει ερωτήσεις. Όλες είναι τοποθετημένες με τη σειρά, εξ ου και το όνομα.",
	"toolbar-sketchpad": "Το sketchpad σας επιτρέπει να κάνετε σημειώσεις σε γραφική μορφή. Είναι μόνιμες, ώστε να μπορείτε να τις ανακτήσετε αργότερα. Οι σημειώσεις του καθηγητή μεταδίδονται σε όλους τους μαθητές σε πραγματικό χρόνο, επομένως είναι δημόσια ορατές.",
	"toolbar-ticketing": "Εδώ οι χρήστες μπορούν να δημιουργήσουν ένα εισιτήριο επισημαίνοντας ένα σφάλμα προγραμματισμού ή άλλο πρόβλημα στο μάθημα.",
	"toolbar-toggle": "Με το ακόλουθο κουμπί μπορείτε να ανοίξετε ή να κλείσετε τη γραμμή εργαλείων. Εκεί θα βρείτε μερικά πολύ χρήσιμα εργαλεία..."
}
