{
	"instructor-view-handler": "El panel del instructor es la herramienta más importante para el profesor. Aquí puede ver exactamente lo que sus estudiantes están haciendo y tener una visión general de lo que está pasando en clase",
	"language-switcher": "El selector de idiomas le permite configurar la interfaz en el idioma de su elección. Si el contenido de la lección está disponible en varios idiomas, puede que tengas suerte y veas todo en chino, por ejemplo. En cualquier caso, la interfaz se mostrará en tu idioma.",
	"statusbar-blackscreen-mode": "De vez en cuando, tiene sentido centrarse completamente en la voz del orador. De ahí el apagón, una parada programada, por así decirlo. Con ello, no sólo oscurecerá su propia pantalla, sino también la de sus alumnos. Un clic más y la vida continúa.",
	"statusbar-dashboard-button": "El tablero de mandos es donde la ISLE almacena todos sus movimientos. Al hacer clic en él, aterrizará en su cuenta y podrá acceder a los cursos a los que ha asistido, ver su progreso, cambiar su configuración y más....",
	"statusbar-group-manager": "El gestor del grupo es una herramienta muy poderosa. Si quiere asignar a sus alumnos a grupos para que puedan chatear entre ellos o trabajar juntos en documentos de texto, sólo tiene que introducir el número de grupos - y voilà! Cada estudiante es asignado al azar a un grupo.",
	"statusbar-info": "La barra de estado es tu panel de información. Te dice si estás conectado o no, muestra tu nombre y la foto de tu perfil (si has subido una) - y te permite acceder a tu cuenta de ISLE en el panel.",
	"statusbar-login-button": "El inicio de sesión debe ser auto-explicativo. Introduces tus datos de usuario - y estás en línea. Si quieres estar seguro, puedes activar la autenticación de dos factores en tu panel de control de la ISLE.",
	"statusbar-logout-button": "De esta manera puedes cerrar la sesión. Adiós...",
	"statusbar-presence": "Por defecto, el icono del círculo se llenará de verde para indicar que la lección puede conectarse al servidor de ISLE. Si el servidor se cae o se desconecta de Internet, aparecerá en naranja oscuro.",
	"statusbar-presentation-mode": "El modo de presentación está pensado para que los instructores simplifiquen la interfaz de visualización cuando compartan sus pantallas. Al hacer clic en él, la barra de estado y otros elementos de la interfaz se ocultarán. Para restaurar la vista original, pulse la tecla de función F7 o haga clic en el botón del ojo en la parte superior izquierda.",
	"statusbar-signup-button": "El proceso de registro es simple. Introduces tu nombre, dirección de correo electrónico y una contraseña, y eso es todo.",
	"statusbar-text-chat": "El chat de texto te permite comunicarte con otros miembros que están en línea en la lección, de forma anónima o con tu nombre. Si corresponde, puedes ver el número de mensajes en el chat debajo del icono.",
	"statusbar-username": "Aquí debería ver su nombre en pantalla si está conectado. Si aún no ha iniciado la sesión, se le asignará un identificador único creado para usted precedido de Anónimo.",
	"statusbar-video-chat": "ISLE tiene una herramienta de conferencia incorporada que le permite chatear por video con otros usuarios que están allí al mismo tiempo. Y si el peinado no te queda bien, sólo tienes que apagar la cámara - y la otra persona todavía puede oírte.",
	"statusbar-voice-info": "Para crear subtítulos en tiempo real o controlar los elementos de la interfaz mediante la voz, puedes usar tu micrófono. Sólo tienes que hacer clic en el icono y se pondrá rojo para indicar que está grabando. También verás una transcripción que te dirá lo que se ha entendido. Para copiar y pegar la transcripción, sólo tienes que hacer clic en el icono CC que se muestra a la derecha de la misma. Se abrirá una ventana con un editor y en ella encontrarás el texto grabado. Si quieres detener el modo de grabación, sólo tienes que hacer clic en el micrófono de nuevo y se volverá gris otra vez.",
	"sticky-note": "Si haces clic con el botón derecho del ratón, puedes crear notas adhesivas personales permanentes para la lección (que aparecerán en verde). Además, los profesores pueden dejar notas para todos los estudiantes, que serán de color naranja.",
	"toolbar-toggle": "Con el siguiente botón puedes abrir o cerrar la barra de herramientas. Allí encontrarás algunas herramientas muy útiles...",
	"toolbar-calculator": "Aquí puedes acceder a una calculadora que te permite hacer cálculos simples, pero también científicos.",
	"toolbar-help": "Las encuestas permiten al instructor hacer pequeñas encuestas entre los participantes. Hay cuatro tipos: una pregunta de sí/no, una pregunta de velocidad, una alternativa de gusto/deseo, finalmente varios tipos de encuestas: de texto libre, de opción múltiple y encuestas numéricas.",
	"toolbar-queue": "La cola permite al estudiante hacer preguntas. Están todas dispuestas en secuencia, de ahí el nombre.",
	"toolbar-sketchpad": "El bloc de dibujo permite tomar notas de forma gráfica. Son persistentes, por lo que pueden ser recuperadas más tarde. Las notas del profesor se transmiten a todos los estudiantes en tiempo real, por lo tanto son visibles públicamente.",
	"toolbar-ticketing": "Aquí los usuarios pueden crear un boleto señalando un error de programación u otro problema en la lección."
}
