{
	"finish": "Nüüd olete lõpetanud ISLE-tunni erinevate kasutajaliidese elementide tutvustamise. Jälgige täiendavaid õpetusnuppe, mis on lisatud üksikutele komponentidele õppetunnis, et õppida rohkem nende funktsionaalsusest ja kasutamisest.",
	"instructor-view-handler": "Juhendaja paneel on õpetaja jaoks kõige olulisem vahend. Siin näete täpselt, mida teie õpilased teevad, ja saate ülevaate, mis klassis toimub.",
	"language-switcher": "Paremal allosas asuv keele valija võimaldab teil määrata kasutajaliidese valitud keelele. Kui õppetüki sisu on saadaval mitmes keeles, võib teil olla õnne - ja näete kogu asja näiteks hiina keeles. Igal juhul kuvatakse kasutajaliides teie keeles.",
	"statusbar-blackscreen-mode": "Aeg-ajalt on mõistlik keskenduda täielikult kõneleja häälele. Siit ka pimedus, nii-öelda programmeeritud seiskumine. Sellega ei pimenda mitte ainult enda, vaid ka õpilaste ekraani. Veel üks klõps - ja elu läheb edasi!",
	"statusbar-dashboard-button": "Juhtpaneel on koht, kus ISLE salvestab kõik teie liikumised. Kui klõpsate sellel, jõuate oma kontole ja saate juurdepääsu oma läbitud kursustele, vaadata oma edusamme, muuta oma seadeid ja palju muud.....",
	"statusbar-group-manager": "Grupihaldur on väga võimas vahend. Kui soovite määrata oma õpilased rühmadesse, et nad saaksid omavahel vestelda või koos tekstidokumentide kallal töötada, peate vaid sisestama rühmade arvu - ja voilà! Iga õpilane määratakse juhuslikult rühma.",
	"statusbar-info": "Seisundiriba on teie infopaneel. See ütleb teile, kas olete sisse logitud või mitte, näitab teie nime ja profiilipilti (kui olete selle üles laadinud) ning võimaldab teil pääseda oma ISLE kontole armatuurlaual.",
	"statusbar-login-button": "Sisselogimine peaks olema iseenesestmõistetav. Sisestate oma kasutajaandmed - ja olete võrgus. Kui soovite olla kindlalt, saate oma ISLE armatuurlaual aktiveerida 2-faktoorse autentimise.",
	"statusbar-logout-button": "Nii saate välja logida. Hüvasti ...",
	"statusbar-presence": "Vaikimisi on ringikoon täidetud rohelisega, mis näitab, et õppetund saab ISLE serveriga ühendust võtta. Kui server ei tööta või teie ühendus internetiga on katkenud, kuvatakse see hoopis tumepunase värviga.",
	"statusbar-presentation-mode": "Esitlusrežiim on mõeldud juhendajatele, et lihtsustada kuvatavat kasutajaliidest ekraanide jagamisel. Kui klõpsate sellel, siis peidetakse olekuriba ja muud kasutajaliidese elemendid. Esialgse vaate taastamiseks vajutage funktsiooniklahvi F7 või klõpsake vasakul ülalpool asuvat silmanuppu.",
	"statusbar-signup-button": "Registreerimisprotsess on lihtne. Sisestate oma nime, e-posti aadressi ja salasõna - ja ongi kõik.",
	"statusbar-text-chat": "Tekstivestlus võimaldab teil suhelda teiste liikmetega, kes on õppetunnis võrgus, anonüümselt või oma nimega. Vajaduse korral näete ikooni all chatis olevate postituste arvu.",
	"statusbar-username": "Siin peaksite nägema oma nime, kui olete sisse loginud. Kui te ei ole veel sisse logitud, määratakse teile unikaalne identifikaator, mis on loodud teie jaoks ja mille ees on \"Anonymous\".",
	"statusbar-video-chat": "ISLE-l on sisseehitatud konverentsivahend, mis võimaldab teil pidada videovestlust teiste kasutajatega, kes on seal samal ajal. Ja kui soeng ei sobi, lülitad lihtsalt kaamera välja - ja teine inimene kuuleb sind ikkagi.",
	"statusbar-voice-info": "Reaalajas tekstide loomiseks või kasutajaliidese elementide juhtimiseks hääle abil saate kasutada oma mikrofoni. Lihtsalt klõpsake ikoonil ja see muutub punaseks, et näidata, et see salvestab. Samuti näete transkriptsiooni, mis ütleb teile, mida on mõistetud. Transkriptsiooni kopeerimiseks ja kleepimiseks klõpsake lihtsalt CC ikoonil, mis ilmub sellest paremale. Avaneb redaktsiooniga aken ja selles leiate oma salvestatud teksti. Kui soovite salvestusrežiimi lõpetada, klõpsake lihtsalt uuesti mikrofonil ja see muutub taas halliks.",
	"sticky-note": "Kui klõpsate paremal, saate luua õppetöö jaoks püsivaid isiklikke kleepsu märkmeid (mis kuvatakse rohelisena). Lisaks võivad õpetajad jätta märkmeid kõigile õpilastele, mis on oranži värvi.",
	"toolbar-calculator": "Siin saate juurdepääsu kalkulaatorile, mis võimaldab teil teha lihtsaid, kuid ka teaduslikke arvutusi.",
	"toolbar-help": "Küsitlused võimaldavad juhendajal teha osalejate seas väikeseid küsitlusi. Küsitlusi on nelja tüüpi: jah/ei-küsimus, kiirusküsimus, meeldib/ei meeldi-variant ning lõpuks erinevad küsitlustüübid: vabatekstilised, valikvastustega ja numbriküsitlused.",
	"toolbar-queue": "Järjekord võimaldab õpilasel esitada küsimusi. Need on kõik järjestatud, sellest ka nimi.",
	"toolbar-sketchpad": "Sketchpad võimaldab teil teha märkmeid graafilisel kujul. Need on püsivad, nii et neid saab hiljem uuesti välja otsida. Õpetaja märkmed edastatakse kõigile õpilastele reaalajas, seega on need avalikult nähtavad.",
	"toolbar-ticketing": "Siin saavad kasutajad luua pileti, milles osutavad programmeerimisveale või muule probleemile õppetunnis.",
	"toolbar-toggle": "Järgmise nupu abil saate tööriistariba avada või sulgeda. Sealt leiate mõned väga kasulikud tööriistad..."
}
