{
	"finish": "Olet nyt tutustunut ISLE-oppitunnin eri käyttöliittymäelementteihin. Katso oppitunnin sisällä oleviin yksittäisiin komponentteihin liitettyjä lisäopetuspainikkeita, jotta voit oppia lisää niiden toiminnoista ja käytöstä.",
	"instructor-view-handler": "Opettajan paneeli on opettajan tärkein työkalu. Täältä näet tarkalleen, mitä oppilaasi tekevät, ja saat yleiskuvan siitä, mitä luokassa tapahtuu.",
	"language-switcher": "Oikeassa alakulmassa olevan kielivalitsimen avulla voit asettaa käyttöliittymän haluamallesi kielelle. Jos oppitunnin sisältö on saatavilla useilla kielillä, saatat olla onnekas - ja nähdä koko oppitunnin esimerkiksi kiinaksi. Joka tapauksessa käyttöliittymä näkyy omalla kielelläsi.",
	"statusbar-blackscreen-mode": "Ajoittain on järkevää keskittyä kokonaan puhujan ääneen. Tästä johtuu pimennys, niin sanottu ohjelmoitu pysäytys. Sen avulla pimennät paitsi oman näyttösi myös oppilaidesi näytön. Vielä yksi klikkaus - ja elämä jatkuu!",
	"statusbar-dashboard-button": "Kojelauta on paikka, johon ISLE tallentaa kaikki liikkeesi. Kun napsautat sitä, pääset tilillesi ja pääset katsomaan käymiäsi kursseja, katsomaan edistymistäsi, muuttamaan asetuksiasi ja paljon muuta.....",
	"statusbar-group-manager": "Ryhmänhallinta on erittäin tehokas työkalu. Jos haluat jakaa oppilaasi ryhmiin, jotta he voivat keskustella keskenään tai työskennellä yhdessä tekstidokumenttien parissa, sinun tarvitsee vain syöttää ryhmien lukumäärä - ja voilà! Jokainen oppilas osoitetaan satunnaisesti ryhmään.",
	"statusbar-info": "Tilapalkki on tietopaneeli. Se kertoo, oletko kirjautuneena vai et, se näyttää nimesi ja profiilikuvasi (jos olet ladannut sellaisen) - ja sen avulla pääset ISLE-tilillesi kojelaudassa.",
	"statusbar-login-button": "Kirjautumisen pitäisi olla itsestään selvää. Syötät käyttäjätiedot - ja olet verkossa. Jos haluat olla varman päälle, voit aktivoida 2-tekijätodennuksen ISLE-kojelaudassasi.",
	"statusbar-logout-button": "Näin voit kirjautua ulos. Hyvästi ...",
	"statusbar-presence": "Oletusarvoisesti ympyrän kuvake täyttyy vihreällä merkiksi siitä, että oppitunti voi muodostaa yhteyden ISLE-palvelimeen. Jos palvelin on alhaalla tai yhteys Internetiin on katkaistu, se näkyy sen sijaan tummanoranssina.",
	"statusbar-presentation-mode": "Esitystila on tarkoitettu ohjaajille, jotka haluavat yksinkertaistaa näytettävää käyttöliittymää, kun he jakavat näyttöjä. Kun napsautat sitä, tilarivi ja muut käyttöliittymäelementit piilotetaan. Voit palauttaa alkuperäisen näkymän painamalla toimintonäppäintä F7 tai napsauttamalla vasemmassa yläkulmassa olevaa silmäpainiketta.",
	"statusbar-signup-button": "Rekisteröitymisprosessi on yksinkertainen. Syötät nimesi, sähköpostiosoitteesi ja salasanasi - ja se on siinä.",
	"statusbar-text-chat": "Tekstikeskustelun avulla voit kommunikoida muiden jäsenten kanssa, jotka ovat verkossa oppitunnilla, nimettömänä tai omalla nimelläsi. Tarvittaessa näet chatissa olevien viestien määrän kuvakkeen alapuolella.",
	"statusbar-username": "Täällä sinun pitäisi nähdä nimesi, jos olet kirjautunut sisään. Jos et ole vielä kirjautunut sisään, sinulle annetaan yksilöllinen tunniste, joka on luotu sinua varten ja jota edeltää Anonymous.",
	"statusbar-video-chat": "ISLEssä on sisäänrakennettu konferenssityökalu, jonka avulla voit käydä videokeskustelua muiden samaan aikaan paikalla olevien käyttäjien kanssa. Ja jos kampaus ei sovi, voit vain sammuttaa kameran - ja toinen henkilö voi silti kuulla sinut.",
	"statusbar-voice-info": "Voit luoda reaaliaikaisia kuvatekstejä tai ohjata käyttöliittymäelementtejä äänellä käyttämällä mikrofonia. Napsauta vain kuvaketta, jolloin se muuttuu punaiseksi merkiksi siitä, että äänitys on käynnissä. Näet myös transkription, joka kertoo, mitä on ymmärretty. Voit kopioida ja liittää transkriptiota napsauttamalla CC-kuvaketta, joka näkyy sen oikealla puolella. Avautuu editori-ikkuna, josta löydät nauhoitetun tekstin. Jos haluat lopettaa nauhoitustilan, napsauta mikrofonia uudelleen, jolloin se muuttuu jälleen harmaaksi.",
	"sticky-note": "Jos napsautat hiiren oikealla painikkeella, voit luoda pysyviä henkilökohtaisia muistilappuja oppitunnille (jotka näkyvät vihreinä). Lisäksi opettajat voivat jättää kaikille oppilaille muistiinpanoja, jotka näkyvät oranssina.",
	"toolbar-calculator": "Täällä voit käyttää laskinta, jolla voit tehdä yksinkertaisia mutta myös tieteellisiä laskelmia.",
	"toolbar-help": "Kyselyiden avulla ohjaaja voi tehdä pieniä kyselyitä osallistujien keskuudessa. Kyselytyyppejä on neljä: kyllä/ei-kysymys, nopeuskysymys, tykkää/ei tykkää -vaihtoehto ja lopuksi erilaisia kyselytyyppejä: vapaateksti-, monivalinta- ja numerokyselyt.",
	"toolbar-queue": "Jonossa opiskelija voi esittää kysymyksiä. Ne on järjestetty järjestykseen, mistä nimi johtuu.",
	"toolbar-sketchpad": "Luonnoslehti mahdollistaa muistiinpanojen tekemisen graafisessa muodossa. Ne ovat pysyviä, joten ne voidaan hakea myöhemmin. Opettajan muistiinpanot välitetään kaikille opiskelijoille reaaliajassa, joten ne ovat julkisesti näkyvissä.",
	"toolbar-ticketing": "Täällä käyttäjät voivat luoda tiketin, jossa he ilmoittavat ohjelmointivirheestä tai muusta ongelmasta oppitunnilla.",
	"toolbar-toggle": "Seuraavalla painikkeella voit avata tai sulkea työkalurivin. Sieltä löydät joitakin erittäin hyödyllisiä työkaluja..."
}
