{
	"instructor-view-handler": "Le panel d'instructeurs est l'outil le plus important pour l'enseignant. Vous pouvez y voir exactement ce que font vos élèves et avoir un aperçu de ce qui se passe en classe",
	"language-switcher": "Le sélecteur de langue vous permet de régler l'interface dans la langue de votre choix. Si le contenu de la leçon est disponible en plusieurs langues, vous aurez peut-être de la chance - et vous pourrez voir le tout en chinois, par exemple. Dans tous les cas, l'interface sera affichée dans votre langue.",
	"statusbar-blackscreen-mode": "De temps en temps, il est logique de se concentrer entièrement sur la voix de l'orateur. D'où le black-out, un arrêt programmé, pour ainsi dire. Avec lui, vous n'assombrissez pas seulement votre propre écran, mais aussi celui de vos élèves. Un clic de plus - et la vie continue !",
	"statusbar-dashboard-button": "Le Dashboard est l'endroit où l'ISLE enregistre tous vos mouvements. Lorsque vous cliquez dessus, vous arrivez sur votre compte et vous pouvez accéder aux cours auxquels vous avez participé, voir votre progression, modifier vos paramètres, et plus encore....",
	"statusbar-group-manager": "Le gestionnaire de groupe est un outil très puissant. Si vous souhaitez répartir vos élèves en groupes afin qu'ils puissent discuter entre eux ou travailler ensemble sur des documents textuels, il vous suffit d'entrer le nombre de groupes - et voilà ! Chaque élève est affecté à un groupe de façon aléatoire.",
	"statusbar-info": "La barre d'état est votre panneau d'information. Elle vous indique si vous êtes connecté ou non, elle affiche votre nom et votre photo de profil (si vous en avez téléchargé une) - et elle vous permet d'accéder à votre compte ISLE dans le tableau de bord.",
	"statusbar-login-button": "Le login doit être explicite. Vous entrez vos données d'utilisateur - et vous êtes en ligne. Si vous voulez être sûr, vous pouvez activer l'authentification à deux facteurs dans votre tableau de bord ISLE.",
	"statusbar-logout-button": "Vous pouvez ainsi vous déconnecter. Au revoir ...",
	"statusbar-presence": "Par défaut, l'icône en forme de cercle sera remplie en vert pour signaler que la leçon peut se connecter au serveur ISLE. Si le serveur est en panne ou si vous êtes déconnecté d'Internet, il apparaîtra en orange foncé à la place.",
	"statusbar-presentation-mode": "Le mode de présentation est destiné aux formateurs afin de simplifier l'interface affichée lorsqu'ils partagent leurs écrans. Lorsque vous cliquez dessus, la barre d'état et les autres éléments de l'interface sont masqués. Pour restaurer la vue originale, appuyez sur la touche de fonction F7 ou cliquez sur le bouton de l'œil en haut à gauche.",
	"statusbar-signup-button": "La procédure d'enregistrement est simple. Vous saisissez votre nom, votre adresse électronique et un mot de passe - et c'est tout.",
	"statusbar-text-chat": "Le chat textuel vous permet de communiquer avec les autres membres qui sont en ligne dans la leçon, de manière anonyme ou avec votre nom. Le cas échéant, vous pouvez voir le nombre de messages dans le chat sous l'icône.",
	"statusbar-username": "Ici, vous devriez voir votre nom affiché si vous êtes connecté. Si vous n'êtes pas encore connecté, vous recevrez un identifiant unique créé pour vous, précédé de Anonymous.",
	"statusbar-video-chat": "ISLE dispose d'un outil de conférence intégré qui vous permet d'avoir un chat vidéo avec d'autres utilisateurs qui sont là en même temps. Et si la coiffure ne vous convient pas, il vous suffit d'éteindre la caméra - et l'autre personne peut toujours vous entendre.",
	"statusbar-voice-info": "Pour créer des sous-titres en temps réel ou contrôler des éléments d'interface par la voix, vous pouvez utiliser votre microphone. Il vous suffit de cliquer sur l'icône et elle deviendra rouge pour indiquer qu'elle est en train d'enregistrer. Vous verrez également une transcription vous indiquant ce qui a été compris. Pour copier et coller la transcription, il suffit de cliquer sur l'icône CC qui apparaîtra à droite de celle-ci. Une fenêtre avec un éditeur s'ouvrira et vous y trouverez votre texte enregistré. Si vous souhaitez arrêter le mode d'enregistrement, il vous suffit de cliquer à nouveau sur le microphone et il redeviendra gris.",
	"toolbar-buttongroup": "Le bouton suivant vous permet d'ouvrir ou de fermer la barre d'outils. Vous y trouverez des outils très utiles..."
}
