{
	"finish": "Ezzel befejezte az ISLE leckék különböző felületi elemeinek bemutatását. Figyelje a leckén belül az egyes elemekhez csatolt további oktatógombokat, hogy többet tudjon meg azok működéséről és használatáról.",
	"instructor-view-handler": "Az oktatói panel a legfontosabb eszköz a tanár számára. Itt pontosan láthatja, hogy mit csinálnak a diákjai, és áttekintheti, hogy mi történik az órán.",
	"language-switcher": "A jobb alsó sarokban található nyelvválasztó lehetővé teszi, hogy a felületet az Ön által választott nyelvre állítsa be. Ha a lecke tartalma több nyelven is elérhető, akkor szerencséje lehet - és például az egészet kínaiul láthatja. Mindenesetre a felület az Ön nyelvén fog megjelenni.",
	"statusbar-blackscreen-mode": "Időről időre érdemes teljes mértékben a beszélő hangjára összpontosítani. Ezért van az áramszünet, egy programozott leállás, hogy úgy mondjam. Ezzel nemcsak a saját képernyőjét sötétíti el, hanem a diákokét is. Még egy kattintás - és az élet megy tovább!",
	"statusbar-dashboard-button": "A műszerfal az a hely, ahol az ISLE tárolja az összes mozgását. Ha rákattintasz, a fiókodban landolsz, és hozzáférhetsz a részt vett kurzusaidhoz, megtekintheted a fejlődésedet, módosíthatod a beállításaidat, és még sok minden mást.....",
	"statusbar-group-manager": "A csoportmenedzser egy nagyon hatékony eszköz. Ha csoportokhoz szeretné rendelni a diákjait, hogy azok egymással cseveghessenek vagy együtt dolgozhassanak szöveges dokumentumokon, csak meg kell adnia a csoportok számát - és voilá! Minden diák véletlenszerűen kerül egy csoportba.",
	"statusbar-info": "Az állapotsor az információs panel. Megmutatja, hogy be vagy-e jelentkezve, mutatja a nevedet és a profilképedet (ha feltöltöttél egyet) - és lehetővé teszi, hogy hozzáférj az ISLE-fiókodhoz a műszerfalon.",
	"statusbar-login-button": "A bejelentkezésnek magától értetődőnek kell lennie. Megadod a felhasználói adataidat - és máris online vagy. Ha biztosra akar menni, aktiválhatja a 2-faktoros hitelesítést az ISLE műszerfalán.",
	"statusbar-logout-button": "Így ki tudsz jelentkezni. Viszlát ...",
	"statusbar-presence": "Alapértelmezés szerint a kör ikon zöld színnel jelzi, hogy a lecke csatlakozni tud az ISLE-kiszolgálóhoz. Ha a szerver leállt, vagy nincs internetkapcsolat, akkor helyette sötét narancssárga színnel jelenik meg.",
	"statusbar-presentation-mode": "A prezentációs módot az oktatóknak szánjuk, hogy a képernyő megosztásakor egyszerűsítsék a megjelenített felületet. Ha rákattint, az állapotsor és más kezelőfelületi elemek elrejtőznek. Az eredeti nézet visszaállításához nyomja meg az F7 funkcióbillentyűt, vagy kattintson a bal felső sarokban lévő szem gombra.",
	"statusbar-signup-button": "A regisztrációs folyamat egyszerű. Megadja a nevét, e-mail címét és jelszavát - és ennyi.",
	"statusbar-text-chat": "A szöveges csevegés lehetővé teszi, hogy névtelenül vagy a neveddel kommunikálj a többi taggal, akik online vannak az órán. Adott esetben az ikon alatt láthatja a csevegésben lévő hozzászólások számát.",
	"statusbar-username": "Itt kell látnia a nevét, ha bejelentkezett. Ha még nem vagy bejelentkezve, akkor egy egyedi azonosítót kapsz, amelyet az Anonim előtt az Anonymus szóval jelöltek.",
	"statusbar-video-chat": "Az ISLE rendelkezik egy beépített konferenciaeszközzel, amely lehetővé teszi, hogy videobeszélgetést folytasson más felhasználókkal, akik ugyanabban az időben ott vannak. Ha pedig nem áll jól a frizura, egyszerűen kikapcsolhatod a kamerát - és a másik fél továbbra is hall téged.",
	"statusbar-voice-info": "A mikrofon segítségével valós idejű feliratokat hozhat létre, vagy hanggal vezérelheti a kezelőfelület elemeit. Csak kattintson az ikonra, és az pirosra váltva jelzi, hogy felvétel készül. Egy átirat is megjelenik, amely megmondja, hogy mit értett meg. Az átirat másolásához és beillesztéséhez csak kattintson a CC ikonra, amely a jobb oldalon jelenik meg. Megnyílik egy szerkesztőablak, és abban megtalálja a felvett szöveget. Ha le szeretné állítani a felvételi módot, csak kattintson újra a mikrofonra, és az ismét szürkévé válik.",
	"sticky-note": "Ha jobb egérgombbal kattint, létrehozhatja a leckéhez tartozó állandó, személyes öntapadós jegyzeteket (amelyek zöld színben jelennek meg). Ezenkívül a tanárok az összes diák számára hagyhatnak jegyzeteket, amelyek narancssárga színűek lesznek.",
	"toolbar-calculator": "Itt hozzáférhet egy számológéphez, amellyel egyszerű, de tudományos számításokat is végezhet.",
	"toolbar-help": "A közvélemény-kutatások lehetővé teszik az oktató számára, hogy kisebb felméréseket készítsen a résztvevők körében. Négy típusa van: igen/nem kérdés, gyorskérdés, tetszik/nem tetszik alternatíva, végül különböző felmérési típusok: szabad szöveges, feleletválasztós és számkérdések.",
	"toolbar-queue": "A sorban állás lehetővé teszi, hogy a tanuló kérdéseket tegyen fel. Ezek mind sorba vannak rendezve, innen a név.",
	"toolbar-sketchpad": "A vázlatfüzet lehetővé teszi, hogy grafikus formában jegyzeteket készítsen. Ezek tartósak, így később is előhívhatók. A tanár jegyzetei valós időben továbbítódnak az összes diáknak, tehát nyilvánosan láthatóak.",
	"toolbar-ticketing": "Itt a felhasználók jegyet hozhatnak létre, amelyben programozási hibára vagy egyéb problémára hívják fel a figyelmet a leckében.",
	"toolbar-toggle": "A következő gombbal megnyithatja vagy bezárhatja az eszköztárat. Itt talál néhány nagyon hasznos eszközt..."
}
