{
	"finish": "これで、ISLEレッスンの様々なインターフェース要素のツアーが完了しました。レッスン内の個々のコンポーネントには、その機能と使用方法について詳しく知るためのチュートリアルボタンが追加されていますので、ご注意ください。",
	"instructor-view-handler": "インストラクターパネルは教師にとって最も重要なツールです。ここでは学生が何をしているのかを正確に確認したり、授業中に何が起こっているのかを把握することができます。",
	"language-switcher": "言語選択機能では、インターフェイスを選択した言語に設定することができます。レッスンの内容が複数の言語で利用可能な場合、運が良ければ中国語で全体を見ることができるかもしれません。いずれにしても、インターフェイスはあなたの言語で表示されます。",
	"statusbar-blackscreen-mode": "時折、話者の声に完全に集中するのは理にかなっている。それゆえに、ブラックアウト、いわばプログラムされた停止状態になります。これを使えば、自分の画面だけでなく、生徒の画面も暗くなります。もう一回クリックしてください。",
	"statusbar-dashboard-button": "ダッシュボードは、ISLEがあなたのすべての動きを保存する場所です。ダッシュボードをクリックすると、あなたのアカウントが表示され、受講したコースにアクセスしたり、進捗状況を確認したり、設定を変更したりすることができます....。",
	"statusbar-group-manager": "グループマネージャーは非常に強力なツールです。学生をグループに割り当てて、お互いにチャットをしたり、テキスト文書で一緒に作業したりしたい場合は、グループの数を入力するだけです。各学生はランダムにグループに割り当てられます。",
	"statusbar-info": "ステータスバーは情報パネルです。ログインしているかどうか、名前とプロフィール写真（アップロードされている場合）が表示され、ダッシュボードからISLEアカウントにアクセスすることができます。",
	"statusbar-login-button": "ログインはわかりやすいものでなければなりません。ユーザーデータを入力すれば、オンラインになります。安全性を確保したい場合は、ISLEのダッシュボードで2要素認証を有効にすることができます。",
	"statusbar-logout-button": "この方法でログアウトできます。さようなら",
	"statusbar-presence": "デフォルトでは、円形のアイコンが緑色に塗りつぶされ、レッスンがISLEサーバーに接続できることを示しています。サーバーがダウンしていたり、インターネットから切断された場合は、濃いオレンジ色で表示されます。",
	"statusbar-presentation-mode": "プレゼンテーションモードは、インストラクターが画面を共有する際に表示されるインターフェイスをシンプルにすることを目的としています。クリックすると、ステータスバーなどのインターフェース要素が非表示になります。元の表示に戻すには、ファンクションキーF7を押すか、左上のアイボタンをクリックします。",
	"statusbar-signup-button": "登録プロセスは簡単です。お名前、メールアドレス、パスワードを入力するだけです。",
	"statusbar-text-chat": "テキストチャットでは、レッスン中にオンラインになっている他のメンバーと、匿名または自分の名前でコミュニケーションをとることができます。該当する場合は、アイコンの下にチャットの投稿数が表示されます。",
	"statusbar-username": "ログインしている場合は、ここにあなたの名前が表示されているはずです。まだログインしていない場合は、Anonymousの前に作成された一意の識別子が割り当てられます。",
	"statusbar-video-chat": "ISLEには会議ツールが内蔵されていて、同時にその場にいる他のユーザーとビデオチャットをすることができます。また、髪型が合わなくても、カメラをオフにするだけで、相手はまだあなたの声を聞くことができます。",
	"statusbar-voice-info": "リアルタイムのキャプションを作成したり、音声でインターフェース要素をコントロールしたりするには、マイクを使用することができます。アイコンをクリックするだけで、録音中であることを示すために赤くなります。また、何が理解されたかを伝えるトランスクリプトが表示されます。トランスクリプトをコピー＆ペーストするには、ちょうどそれの右に表示されるCCアイコンをクリックします。エディター付きのウィンドウが開き、その中にあなたの録音されたテキストが表示されます。あなたが録音モードを停止したい場合は、マイクを再度クリックするだけで、それは再び灰色になります。",
	"sticky-note": "右クリックすると、レッスン用の永久的な個人用付箋紙を作成することができます(緑で表示されます)。さらに、教師はすべての学生のためにメモを残すことができます。",
	"toolbar-calculator": "ここでは、簡単な計算だけでなく、科学的な計算もできる電卓にアクセスすることができます。",
	"toolbar-help": "ポールは、講師が参加者の間で小さなアンケートを取ることができます。4つのタイプがあります：はい/いいえの質問、スピードの質問、好き/嫌いの代替案、最後に様々な調査のタイプ：フリーテキスト、多肢選択式、数字の調査です。",
	"toolbar-queue": "キューには、学生が質問できるようになっています。それらはすべて順番に並べられているので、名前の由来となっています。",
	"toolbar-sketchpad": "スケッチパッドでは、グラフィカルな形でメモを作成することができます。メモは永続的に保存されるので、後で取り出すことができます。教師のノートはリアルタイムですべての学生に送信されます。",
	"toolbar-ticketing": "ここでは、ユーザーはレッスンのプログラミングエラーやその他の問題を指摘するチケットを作成することができます。",
	"toolbar-toggle": "次のボタンでツールバーを開いたり閉じたりすることができます。そこには、いくつかの非常に便利なツールがあります..."
}
