{
	"finish": "Dabar baigėte pažintį su įvairiais ISLE pamokos sąsajos elementais. Atkreipkite dėmesį į papildomus mokomuosius mygtukus, esančius prie atskirų pamokos komponentų, kad sužinotumėte daugiau apie jų funkcionalumą ir naudojimą.",
	"instructor-view-handler": "Instruktoriaus skydelis yra svarbiausias mokytojo įrankis. Čia galite tiksliai matyti, ką daro jūsų mokiniai, ir apžvelgti, kas vyksta klasėje.",
	"language-switcher": "Dešinėje apačioje esantis kalbos pasirinkimo įrankis leidžia nustatyti sąsają pasirinkta kalba. Jei pamokos turinys pateikiamas keliomis kalbomis, jums gali pasisekti ir visą pamoką matysite, pavyzdžiui, kinų kalba. Bet kuriuo atveju sąsaja bus rodoma jūsų kalba.",
	"statusbar-blackscreen-mode": "Kartais tikslinga sutelkti dėmesį tik į kalbėtojo balsą. Taigi, taip sakant, užtemimas, užprogramuotas sustojimas. Jį naudodami užtemdysite ne tik savo, bet ir mokinių ekraną. Dar vienas spustelėjimas - ir gyvenimas tęsiasi!",
	"statusbar-dashboard-button": "Prietaisų skydelyje saugomi visi jūsų judesiai. Ją spustelėję pateksite į savo paskyrą ir galėsite pasiekti lankomus kursus, peržiūrėti savo pažangą, keisti nustatymus ir dar daugiau.....",
	"statusbar-group-manager": "Grupės tvarkyklė yra labai galingas įrankis. Jei norite mokinius suskirstyti į grupes, kad jie galėtų bendrauti tarpusavyje arba kartu dirbti su tekstiniais dokumentais, tereikia įvesti grupių skaičių - ir voilà! Kiekvienas mokinys atsitiktine tvarka priskiriamas grupei.",
	"statusbar-info": "Būsenos juosta yra informacinis skydelis. Joje nurodoma, ar esate prisijungęs, ar ne, rodomas jūsų vardas ir profilio nuotrauka (jei ją įkėlėte), taip pat galite pasiekti savo ISLE paskyrą prietaisų skydelyje.",
	"statusbar-login-button": "Prisijungimas turėtų būti suprantamas. Įveskite savo naudotojo duomenis - ir esate prisijungę. Jei norite būti saugūs, ISLE prietaisų skydelyje galite įjungti 2 veiksnių autentifikavimą.",
	"statusbar-logout-button": "Taip galėsite atsijungti. Iki pasimatymo...",
	"statusbar-presence": "Pagal numatytuosius nustatymus apskritimo piktograma bus užpildyta žaliai, kad pamoka gali prisijungti prie ISLE serverio. Jei serveris neveikia arba jūs esate atsijungę nuo interneto, vietoj to ji bus rodoma tamsiai oranžine spalva.",
	"statusbar-presentation-mode": "Pateikimo režimas skirtas dėstytojams, kad jie galėtų supaprastinti rodomą sąsają dalydamiesi savo ekranais. Jį spustelėjus, būsenos juosta ir kiti sąsajos elementai bus paslėpti. Norėdami atkurti pradinį vaizdą, paspauskite funkcinį klavišą F7 arba spustelėkite viršutiniame kairiajame kampe esantį akies mygtuką.",
	"statusbar-signup-button": "Registracijos procesas yra paprastas. Įveskite savo vardą ir pavardę, el. pašto adresą, slaptažodį ir viskas.",
	"statusbar-text-chat": "Teksto pokalbiuose galite bendrauti su kitais nariais, kurie pamokoje yra prisijungę, anonimiškai arba nurodydami savo vardą. Jei taikoma, po piktograma galite matyti pokalbio pranešimų skaičių.",
	"statusbar-username": "Čia turėtumėte matyti savo vardą, jei esate prisijungę. Jei dar nesate prisijungę, jums bus priskirtas unikalus jums sukurtas identifikatorius, prieš kurį rašoma Anoniminis.",
	"statusbar-video-chat": "ISLE turi integruotą konferencijų įrankį, kuriuo galite vesti vaizdo pokalbius su kitais tuo pačiu metu esančiais naudotojais. O jei šukuosena netinka, tiesiog išjunkite kamerą - ir kitas asmuo vis tiek jus girdės.",
	"statusbar-voice-info": "Norėdami kurti antraštes realiuoju laiku arba valdyti sąsajos elementus balsu, galite naudoti mikrofoną. Tiesiog spustelėkite piktogramą ir ji taps raudona, kad būtų nurodyta, jog įrašinėjama. Taip pat matysite transkripciją, kurioje bus nurodyta, ką jis suprato. Norėdami nukopijuoti ir įklijuoti transkripciją, tiesiog spustelėkite CC piktogramą, kuri bus rodoma dešinėje. Atsidarys langas su redaktoriumi ir jame rasite įrašytą tekstą. Jei norite sustabdyti įrašymo režimą, tiesiog dar kartą spustelėkite mikrofoną ir jis vėl taps pilkas.",
	"sticky-note": "Dešiniuoju pelės klavišu spustelėję galite sukurti nuolatinius asmeninius lipnius užrašus, skirtus pamokai (jie bus rodomi žalia spalva). Be to, mokytojai gali palikti užrašus visiems mokiniams, kurie bus nuspalvinti oranžine spalva.",
	"toolbar-calculator": "Čia galite naudotis skaičiuotuvu, kuriuo galite atlikti paprastus ir mokslinius skaičiavimus.",
	"toolbar-help": "Apklausos leidžia instruktoriui atlikti nedideles dalyvių apklausas. Yra keturių tipų: klausimas \"taip/ne\", greitasis klausimas, \"patinka/nepatinka\" alternatyva, galiausiai įvairių tipų apklausos: laisvo teksto, su keliais atsakymų variantais ir skaičių apklausos.",
	"toolbar-queue": "Eilėje mokinys gali užduoti klausimus. Visi jie išdėstyti iš eilės, todėl ir pavadinimas toks.",
	"toolbar-sketchpad": "Eskizų bloknotas leidžia grafiškai daryti užrašus. Jos yra nuolatinės, todėl jas galima atkurti vėliau. Mokytojo pastabos realiuoju laiku perduodamos visiems mokiniams, todėl yra viešai matomos.",
	"toolbar-ticketing": "Čia naudotojai gali sukurti bilietą, nurodydami programavimo klaidą ar kitą problemą pamokoje.",
	"toolbar-toggle": "Šiuo mygtuku galite atidaryti arba uždaryti įrankių juostą. Joje rasite keletą labai naudingų įrankių..."
}
