{
	"finish": "Tagad esat pabeidzis ekskursiju pa dažādiem ISLE mācību stundas saskarnes elementiem. Lai uzzinātu vairāk par to funkcionalitāti un lietošanu, pievērsiet uzmanību papildu pamācību pogām, kas pievienotas atsevišķiem elementiem mācību stundā.",
	"instructor-view-handler": "Skolotāja panelis ir vissvarīgākais skolotāja rīks. Šeit jūs varat precīzi redzēt, ko dara jūsu skolēni, un iegūt pārskatu par to, kas notiek klasē.",
	"language-switcher": "Valodas atlasītājs labajā apakšējā stūrī ļauj iestatīt saskarni izvēlētajā valodā. Ja nodarbības saturs ir pieejams vairākās valodās, jums var paveicies - un viss saturs būs redzams, piemēram, ķīniešu valodā. Jebkurā gadījumā saskarne tiks parādīta jūsu valodā.",
	"statusbar-blackscreen-mode": "Laiku pa laikam ir lietderīgi koncentrēties tikai uz runātāja balsi. Tāpēc ir nepieciešams aptumšojums, tā sakot, ieprogrammēts apstāšanās režīms. Ar to jūs aptumtināsiet ne tikai savu, bet arī savu skolēnu ekrānu. Vēl viens klikšķis - un dzīve turpinās!",
	"statusbar-dashboard-button": "Vadības panelis ir vieta, kur ISLE glabā visas jūsu kustības. Noklikšķinot uz tā, jūs nokļūsiet savā kontā un varēsiet piekļūt apmeklētajiem kursiem, apskatīt savu progresu, mainīt iestatījumus un daudz ko citu.....",
	"statusbar-group-manager": "Grupas pārvaldnieks ir ļoti spēcīgs rīks. Ja vēlaties sadalīt skolēnus grupās, lai viņi varētu tērzēt cits ar citu vai kopīgi strādāt ar teksta dokumentiem, jums tikai jāievada grupu skaits - un voilà! Katram skolēnam pēc nejaušības principa tiek piešķirta grupa.",
	"statusbar-info": "Statusa josla ir informācijas panelis. Tā norāda, vai esat pieteicies vai ne, tajā ir redzams jūsu vārds un profila attēls (ja esat augšupielādējis šādu attēlu), un tā ļauj jums piekļūt savam ISLE kontam vadības panelī.",
	"statusbar-login-button": "Pieteikšanās vajadzētu būt pašsaprotamai. Ievadiet savus lietotāja datus - un esat tiešsaistē. Ja vēlaties būt drošībā, varat aktivizēt 2 faktoru autentifikāciju savā ISLE vadības panelī.",
	"statusbar-logout-button": "Šādā veidā varat iziet no sistēmas. Labdien...",
	"statusbar-presence": "Pēc noklusējuma apļa ikona būs aizpildīta zaļā krāsā, lai signalizētu, ka mācību stunda var izveidot savienojumu ar ISLE serveri. Ja serveris nedarbosies vai jūs būsiet atvienojies no interneta, tā vietā ikona tiks parādīta tumši oranžā krāsā.",
	"statusbar-presentation-mode": "Prezentācijas režīms ir paredzēts pasniedzējiem, lai vienkāršotu rādīto saskarni, koplietojot ekrānus. Noklikšķinot uz tā, statusa josla un citi saskarnes elementi kļūst slēpti. Lai atjaunotu sākotnējo skatu, nospiediet funkcionālo taustiņu F7 vai noklikšķiniet uz acs pogas kreisajā augšējā stūrī.",
	"statusbar-signup-button": "Reģistrācijas process ir vienkāršs. Ievadiet savu vārdu, e-pasta adresi un paroli - un viss.",
	"statusbar-text-chat": "Teksta tērzēšana ļauj sazināties ar citiem dalībniekiem, kuri ir tiešsaistē nodarbībā, anonīmi vai ar savu vārdu. Attiecīgā gadījumā zem ikonas varat redzēt čata ziņu skaitu.",
	"statusbar-username": "Ja esat pieteicies, šeit ir redzams jūsu vārds un uzvārds. Ja vēl neesat pieteicies, jums tiks piešķirts unikāls identifikators, pirms kura rakstīts Anonīms.",
	"statusbar-video-chat": "ISLE ir iebūvēts konferenču rīks, kas ļauj veikt videotērzēšanu ar citiem lietotājiem, kuri tajā pašā laikā atrodas vietnē. Un, ja frizūra neder, vienkārši izslēdziet kameru, un otrs cilvēks jūs joprojām var dzirdēt.",
	"statusbar-voice-info": "Lai veidotu uzrakstus reālajā laikā vai pārvaldītu saskarnes elementus ar balsi, varat izmantot mikrofonu. Vienkārši noklikšķiniet uz ikonas, un tā kļūs sarkana, norādot, ka notiek ierakstīšana. Jūs redzēsiet arī transkripciju, kurā būs norādīts, kas ir saprasts. Lai kopētu un ielīmētu transkripciju, vienkārši noklikšķiniet uz ikonas CC, kas parādīsies pa labi no tās. Atvērsies logs ar redaktoru, un tajā atradīsiet ierakstīto tekstu. Ja vēlaties pārtraukt ierakstīšanas režīmu, vienkārši vēlreiz noklikšķiniet uz mikrofona, un tas atkal kļūs pelēks.",
	"sticky-note": "Ja noklikšķināsiet ar peles labo pogu, varat izveidot pastāvīgas personīgās uzlīmlapas (kas tiks parādītas zaļā krāsā). Turklāt skolotāji var atstāt piezīmes visiem skolēniem, kas tiks iekrāsotas oranžā krāsā.",
	"toolbar-calculator": "Šeit varat piekļūt kalkulatoram, kas ļauj veikt vienkāršus, bet arī zinātniskus aprēķinus.",
	"toolbar-help": "Aptaujas ļauj pasniedzējam veikt nelielas dalībnieku aptaujas. Ir četri veidi: jā/nē jautājums, ātruma jautājums, patīk/nepatīk alternatīva, visbeidzot, dažādi aptauju veidi: brīvā teksta, ar atbilžu variantiem un skaitļu aptaujas.",
	"toolbar-queue": "Rinda ļauj skolēnam uzdot jautājumus. Tie visi ir sakārtoti pēc kārtas, tāpēc arī nosaukums.",
	"toolbar-sketchpad": "Skiču bloknots ļauj veikt piezīmes grafiskā veidā. Tās ir paliekošas, tāpēc vēlāk tās var atgūt. Skolotāja piezīmes tiek pārraidītas visiem skolēniem reāllaikā, tāpēc tās ir publiski redzamas.",
	"toolbar-ticketing": "Šeit lietotāji var izveidot biļeti, norādot uz programmēšanas kļūdu vai citu problēmu mācību stundā.",
	"toolbar-toggle": "Ar šo pogu varat atvērt vai aizvērt rīkjoslu. Tajā atradīsiet dažus ļoti noderīgus rīkus..."
}
