{
	"instructor-view-handler": "Het instructeurspanel is het belangrijkste instrument voor de docent. Hier kun je precies zien wat je leerlingen doen en heb je een overzicht van wat er in de klas gebeurt.",
	"language-switcher": "Met de taalkiezer kunt u de interface instellen op de taal van uw keuze. Als de inhoud van de les in meerdere talen beschikbaar is, heeft u misschien geluk - en ziet u het geheel bijvoorbeeld in het Chinees. In ieder geval wordt de interface in uw taal weergegeven.",
	"statusbar-blackscreen-mode": "Van tijd tot tijd is het zinvol om zich volledig te richten op de stem van de spreker. Vandaar de black-out, een geprogrammeerde stilstand, bij wijze van spreken. Hiermee verduistert u niet alleen uw eigen scherm, maar ook dat van uw leerlingen. Nog één klik - en het leven gaat verder!",
	"statusbar-dashboard-button": "Het Dashboard is waar ISLE al uw bewegingen opslaat. Als u erop klikt, komt u in uw account terecht en heeft u toegang tot uw gevolgde cursussen, kunt u uw voortgang bekijken, uw instellingen wijzigen en meer....",
	"statusbar-group-manager": "De groepsmanager is een zeer krachtig instrument. Als u uw leerlingen aan groepen wilt toewijzen zodat ze met elkaar kunnen chatten of samen aan tekstdocumenten kunnen werken, hoeft u alleen het aantal groepen in te voeren - en voilà! Elke leerling wordt willekeurig aan een groep toegewezen.",
	"statusbar-info": "De statusbalk is uw infopaneel. Het vertelt u of u bent ingelogd of niet, het toont uw naam en profielfoto (als u er een heeft geüpload) - en het geeft u toegang tot uw ISLE-account in het dashboard.",
	"statusbar-login-button": "Het inloggen moet vanzelfsprekend zijn. U voert uw gebruikersgegevens in - en u bent online. Als u op veilig wilt zijn, kunt u de 2-factor-authenticatie in uw ISLE-dashboard activeren.",
	"statusbar-logout-button": "Op deze manier kun je uitloggen. Tot ziens...",
	"statusbar-presence": "Standaard wordt het cirkelicoontje groen ingevuld om aan te geven dat de les verbinding kan maken met de ISLE-server. Mocht de server uitvallen of u wordt losgekoppeld van het internet, dan zal deze in plaats daarvan in het donker oranje verschijnen.",
	"statusbar-presentation-mode": "De presentatiemodus is bedoeld voor instructeurs om de weergegeven interface te vereenvoudigen bij het delen van hun schermen. Wanneer u erop klikt, worden de statusbalk en andere interface-elementen verborgen. Om de oorspronkelijke weergave te herstellen, drukt u op de functietoets F7 of klikt u op de oogknop linksboven.",
	"statusbar-signup-button": "Het registratieproces is eenvoudig. U voert uw naam, e-mailadres en een wachtwoord in - en dat is het.",
	"statusbar-text-chat": "De tekstchat maakt het mogelijk om te communiceren met andere leden die online zijn in de les, anoniem of met je naam. Indien van toepassing kun je het aantal berichten in de chat zien onder het icoontje.",
	"statusbar-username": "Hier zou u uw naam moeten zien als u bent ingelogd. Als u nog niet bent ingelogd, krijgt u een unieke identificatiecode die voor u is aangemaakt, voorafgegaan door Anonymous.",
	"statusbar-video-chat": "ISLE heeft een ingebouwde conferencing tool die het mogelijk maakt om te videochatten met andere gebruikers die er tegelijkertijd zijn. En als het kapsel niet past, zet je gewoon de camera uit - en de andere persoon kan je nog steeds horen.",
	"statusbar-voice-info": "Voor het maken van real-time bijschriften of het bedienen van interface-elementen via de stem, kunt u uw microfoon gebruiken. Klik op het pictogram en het zal rood worden om aan te geven dat er wordt opgenomen. U ziet ook een transcriptie die u vertelt wat er is begrepen. Om het transcript te kopiëren en te plakken, klikt u op het CC-icoontje dat rechts ervan verschijnt. Een venster met een editor wordt geopend en daarin vindt u uw opgenomen tekst. Als u de opnamemodus wilt stoppen, klikt u nogmaals op de microfoon en deze zal weer grijs worden.",
	"toolbar-buttongroup": "Met de volgende knop kunt u de werkbalk openen of sluiten. Daar vindt u een aantal zeer nuttige hulpmiddelen..."
}
