{
	"instructor-view-handler": "Panel instruktora jest najważniejszym narzędziem dla nauczyciela. Tutaj możesz zobaczyć, co dokładnie robią Twoi uczniowie i mieć przegląd tego, co dzieje się w klasie",
	"language-switcher": "Picker języka pozwala na ustawienie interfejsu w wybranym języku. Jeśli zawartość lekcji jest dostępna w wielu językach, możesz mieć szczęście - i zobaczyć całość np. w języku chińskim. W każdym razie, interfejs będzie wyświetlany w twoim języku.",
	"statusbar-blackscreen-mode": "Od czasu do czasu sensowne jest skupienie się wyłącznie na głosie mówcy. Stąd to zaciemnienie, zaprogramowany postój, że tak powiem. Dzięki niemu można nie tylko zaciemnić własny ekran, ale także ekran uczniów. Jeszcze jedno kliknięcie - i życie toczy się dalej!",
	"statusbar-dashboard-button": "Dashboard jest miejscem, gdzie ISLE przechowuje wszystkie twoje ruchy. Kiedy na nią klikniesz, wylądujesz na swoim koncie i będziesz mógł uzyskać dostęp do swoich kursów, zobaczyć swoje postępy, zmienić swoje ustawienia i więcej....",
	"statusbar-group-manager": "Menedżer grupy jest bardzo potężnym narzędziem. Jeśli chcesz przypisać swoich uczniów do grup, aby mogli rozmawiać ze sobą lub pracować razem nad dokumentami tekstowymi, wystarczy, że wprowadzisz liczbę grup - i voila! Każdy uczeń jest losowo przypisany do grupy.",
	"statusbar-info": "Pasek stanu jest twoim panelem informacyjnym. Pokazuje on, czy jesteś zalogowany, czy nie, pokazuje Twoje imię i nazwisko oraz zdjęcie profilowe (jeśli je wgrałeś) - i umożliwia dostęp do Twojego konta ISLE w desce rozdzielczej.",
	"statusbar-login-button": "Logowanie powinno być oczywiste. Wprowadzasz swoje dane użytkownika - i jesteś online. Jeśli chcesz być po bezpiecznej stronie, możesz aktywować 2-stopniową autoryzację w swojej desce rozdzielczej ISLE.",
	"statusbar-logout-button": "W ten sposób możesz się wylogować. Do widzenia...",
	"statusbar-presence": "Domyślnie, ikona okręgu będzie wypełniona na zielono, aby zasygnalizować, że lekcja może się połączyć z serwerem ISLE. Jeśli serwer jest wyłączony lub odłączony od Internetu, pojawi się on w kolorze ciemnopomarańczowym.",
	"statusbar-presentation-mode": "Tryb prezentacji jest przeznaczony dla instruktorów w celu uproszczenia wyświetlanego interfejsu podczas udostępniania swoich ekranów. Po kliknięciu na niego, pasek stanu i inne elementy interfejsu zostaną ukryte. Aby przywrócić oryginalny widok, naciśnij klawisz funkcyjny F7 lub kliknij przycisk \"Oko\" w lewym górnym rogu.",
	"statusbar-signup-button": "Proces rejestracji jest prosty. Wprowadzasz swoje imię i nazwisko, adres e-mail i hasło - i to wszystko.",
	"statusbar-text-chat": "Czat tekstowy pozwala na komunikację z innymi użytkownikami, którzy są online na lekcji, anonimowo lub z Twoim imieniem i nazwiskiem. Jeśli dotyczy, możesz zobaczyć liczbę postów na czacie pod ikoną.",
	"statusbar-username": "Tutaj powinieneś zobaczyć swoje imię i nazwisko, jeśli jesteś zalogowany. Jeśli nie jesteś jeszcze zalogowany, zostanie Ci przydzielony unikalny identyfikator stworzony dla Ciebie, poprzedzony anonimem.",
	"statusbar-video-chat": "ISLE posiada wbudowane narzędzie konferencyjne, które pozwala na prowadzenie wideorozmów z innymi użytkownikami, którzy są tam w tym samym czasie. A jeśli fryzura nie pasuje, po prostu wyłączasz kamerę - a druga osoba nadal będzie Cię słyszeć.",
	"statusbar-voice-info": "Aby tworzyć napisy w czasie rzeczywistym lub sterować elementami interfejsu za pomocą głosu, można użyć mikrofonu. Wystarczy kliknąć na ikonę, a ona zmieni kolor na czerwony, aby wskazać, że jest nagrywana. Zobaczysz również transkrypcję mówiącą o tym, co zostało zrozumiane. Aby skopiować i wkleić transkrypcję, po prostu kliknij na ikonę CC, która pojawi się po jej prawej stronie. Otworzy się okno z edytorem, w którym znajdziesz swój nagrany tekst. Jeśli chcesz zatrzymać tryb nagrywania, po prostu kliknij ponownie na mikrofon, a on znowu zrobi się szary.",
	"toolbar-buttongroup": "Za pomocą poniższego przycisku można otworzyć lub zamknąć pasek narzędzi. Znajdziesz tam kilka bardzo pomocnych narzędzi..."
}
