{
	"finish": "Agora você completou o tour dos vários elementos de interface de uma lição ISLE. Fique atento aos botões adicionais do tutorial anexados aos componentes individuais dentro da lição para aprender mais sobre sua funcionalidade e uso.",
	"instructor-view-handler": "O painel do instrutor é a ferramenta mais importante para o professor. Aqui você pode ver exatamente o que seus alunos estão fazendo e ter uma visão geral do que está acontecendo na sala de aula",
	"language-switcher": "O selecionador de idiomas permite que você defina a interface para o idioma de sua escolha. Se o conteúdo da lição estiver disponível em vários idiomas, você pode ter sorte - e ver tudo isso em chinês, por exemplo. Em qualquer caso, a interface será exibida em seu idioma.",
	"statusbar-blackscreen-mode": "De vez em quando, faz sentido focar inteiramente na voz do orador. Daí o apagão, uma paralisação programada, por assim dizer. Com ele, você não só escurecerá sua própria tela, mas também a de seus alunos. Mais um clique - e a vida continua!",
	"statusbar-dashboard-button": "O Painel de Controle é onde a ISLE armazena todos os seus movimentos. Quando você clicar nele, você vai pousar em sua conta e poderá acessar seus cursos freqüentados, ver seu progresso, mudar suas configurações e mais....",
	"statusbar-group-manager": "O gerente do grupo é uma ferramenta muito poderosa. Se você quiser designar seus alunos para grupos para que possam conversar uns com os outros ou trabalhar juntos em documentos de texto, você só precisa informar o número de grupos - e voilà! Cada aluno é designado aleatoriamente a um grupo.",
	"statusbar-info": "A barra de status é o seu painel informativo. Ela informa se você está logado ou não, mostra seu nome e imagem de perfil (se você fez upload de uma) - e permite que você acesse sua conta ISLE no painel de controle.",
	"statusbar-login-button": "O login deve ser auto-explicativo. Você digita seus dados de usuário - e você está online. Se você quiser estar no lado seguro, você pode ativar a autenticação de 2 fatores em seu painel de controle ISLE.",
	"statusbar-logout-button": "Desta forma, você pode sair do site. Adeus ...",
	"statusbar-presence": "Por padrão, o ícone do círculo será preenchido em verde para sinalizar que a lição pode se conectar com o servidor ISLE. Caso o servidor esteja desligado ou você esteja desconectado da Internet, ele aparecerá em laranja escuro em seu lugar.",
	"statusbar-presentation-mode": "O modo de apresentação é destinado aos instrutores para simplificar a interface exibida ao compartilhar suas telas. Ao clicar sobre ela, a barra de status e outros elementos da interface ficarão ocultos. Para restaurar a visualização original, pressione a tecla de função F7 ou clique no botão do olho na parte superior esquerda.",
	"statusbar-signup-button": "O processo de registro é simples. Você digita seu nome, endereço de e-mail e uma senha - e pronto.",
	"statusbar-text-chat": "O bate-papo de texto permite que você se comunique com outros membros que estão online na lição, anonimamente ou com seu nome. Se aplicável, você pode ver o número de mensagens no bate-papo embaixo do ícone.",
	"statusbar-username": "Aqui você deve ver seu nome afixado se estiver logado. Se você ainda não estiver logado, ser-lhe-á atribuído um identificador único criado para você, precedido por Anônimo.",
	"statusbar-video-chat": "ISLE tem uma ferramenta de conferência integrada que permite conversar por vídeo com outros usuários que estão lá ao mesmo tempo. E se o penteado não couber, você simplesmente desliga a câmera - e a outra pessoa ainda pode ouvi-lo.",
	"statusbar-voice-info": "Para criar legendas em tempo real ou elementos de interface de controle por voz, você pode usar seu microfone. Basta clicar sobre o ícone e ele ficará vermelho para indicar que está gravando. Você também verá uma transcrição que lhe diz o que foi compreendido. Para copiar e colar a transcrição, basta clicar sobre o ícone CC que aparecerá à direita dela. Uma janela com um editor se abrirá e nela você encontrará seu texto gravado. Se você quiser parar o modo de gravação, basta clicar novamente no microfone e ele ficará cinza novamente.",
	"sticky-note": "Se você clicar com o botão direito do mouse, você pode criar notas pessoais permanentes para a lição (que aparecerão em verde). Além disso, os professores poderão deixar notas para todos os alunos, que serão coloridas em laranja.",
	"toolbar-calculator": "Aqui você pode acessar uma calculadora que lhe permite fazer cálculos simples, mas também científicos.",
	"toolbar-help": "As pesquisas permitem que o instrutor faça pequenas pesquisas entre os participantes. Há quatro tipos: uma pergunta de sim/não, uma pergunta rápida, uma alternativa parecida/desejada, finalmente vários tipos de pesquisas: pesquisas de texto livre, de múltipla escolha e de número.",
	"toolbar-queue": "A fila permite que o estudante faça perguntas. Todas elas estão organizadas em seqüência, daí o nome.",
	"toolbar-sketchpad": "O sketchpad permite que você faça anotações de forma gráfica. Eles são persistentes, para que possam ser recuperados posteriormente. As anotações do professor são transmitidas a todos os alunos em tempo real e, portanto, visíveis publicamente.",
	"toolbar-ticketing": "Aqui os usuários podem criar um ticket apontando um erro de programação ou outro problema na lição.",
	"toolbar-toggle": "Com o seguinte botão, você pode abrir ou fechar a barra de ferramentas. Lá você encontrará algumas ferramentas muito úteis..."
}
