{
	"finish": "Ați finalizat turul diferitelor elemente de interfață ale unei lecții ISLE. Fiți atenți la butoanele de tutorial suplimentare atașate la componentele individuale din cadrul lecției pentru a afla mai multe despre funcționalitatea și utilizarea acestora.",
	"instructor-view-handler": "Panoul Instructor este cel mai important instrument pentru profesor. Aici puteți vedea exact ce fac elevii dvs. și aveți o imagine de ansamblu a ceea ce se întâmplă în clasă.",
	"language-switcher": "Selectorul de limbă din dreapta jos vă permite să setați interfața în limba dorită. În cazul în care conținutul lecției este disponibil în mai multe limbi, este posibil să aveți noroc și să vedeți totul în chineză, de exemplu. În orice caz, interfața va fi afișată în limba dumneavoastră.",
	"statusbar-blackscreen-mode": "Din când în când, are sens să ne concentrăm în întregime pe vocea vorbitorului. De aici și blackout-ul, o oprire programată, ca să spunem așa. Cu ajutorul acestuia, nu numai că vă veți întuneca propriul ecran, ci și pe cel al studenților dumneavoastră. Încă un clic - și viața merge mai departe!",
	"statusbar-dashboard-button": "Tabloul de bord este locul în care ISLE stochează toate mișcările dumneavoastră. Atunci când faceți clic pe el, veți ajunge în contul dvs. și veți putea accesa cursurile la care ați participat, vă veți vedea progresul, vă veți putea modifica setările și multe altele....",
	"statusbar-group-manager": "Managerul de grup este un instrument foarte puternic. Dacă doriți să vă repartizați elevii în grupuri pentru ca aceștia să poată discuta între ei sau să lucreze împreună la documente de text, trebuie doar să introduceți numărul de grupuri - și iată! Fiecare elev este repartizat aleatoriu într-un grup.",
	"statusbar-info": "Bara de stare este panoul de informații. Vă spune dacă sunteți conectat sau nu, vă afișează numele și poza de profil (dacă ați încărcat una) și vă permite să vă accesați contul ISLE din tabloul de bord.",
	"statusbar-login-button": "Autentificarea ar trebui să fie de la sine înțeleasă. Introduceți datele dumneavoastră de utilizator și sunteți online. Dacă doriți să fiți în siguranță, puteți activa autentificarea cu 2 factori în tabloul de bord ISLE.",
	"statusbar-logout-button": "În acest fel, vă puteți deconecta. La revedere ...",
	"statusbar-presence": "În mod implicit, pictograma cercului va fi umplută cu verde pentru a semnala că lecția se poate conecta la serverul ISLE. În cazul în care serverul nu funcționează sau dacă sunteți deconectat de la internet, aceasta va apărea în schimb în portocaliu închis.",
	"statusbar-presentation-mode": "Modul de prezentare este destinat instructorilor pentru a simplifica interfața afișată atunci când își partajează ecranele. Atunci când faceți clic pe el, bara de stare și alte elemente ale interfeței vor fi ascunse. Pentru a restabili vizualizarea inițială, apăsați tasta funcțională F7 sau faceți clic pe butonul cu ochi din stânga sus.",
	"statusbar-signup-button": "Procesul de înregistrare este simplu. Vă introduceți numele, adresa de e-mail și o parolă - și asta este tot.",
	"statusbar-text-chat": "Chat-ul text vă permite să comunicați cu alți membri care sunt online în timpul lecției, anonim sau cu numele dumneavoastră. Dacă este cazul, sub pictogramă puteți vedea numărul de mesaje din chat.",
	"statusbar-username": "Aici ar trebui să vedeți numele dvs. afișat dacă sunteți conectat. Dacă nu sunteți încă conectat, vi se va atribui un identificator unic creat pentru dvs. precedat de Anonymous.",
	"statusbar-video-chat": "ISLE are un instrument de conferință integrat care vă permite să discutați video cu alți utilizatori care se află acolo în același timp. Iar dacă nu vă convine coafura, puteți opri camera - iar cealaltă persoană vă poate auzi în continuare.",
	"statusbar-voice-info": "Pentru a crea subtitrări în timp real sau pentru a controla elementele interfeței prin voce, puteți utiliza microfonul. Trebuie doar să faceți clic pe pictograma și aceasta va deveni roșie pentru a indica faptul că înregistrează. De asemenea, veți vedea o transcriere care vă va spune ce a înțeles. Pentru a copia și lipi transcrierea, trebuie doar să faceți clic pe pictograma CC care va apărea în dreapta acesteia. Se va deschide o fereastră cu un editor și în ea veți găsi textul înregistrat. Dacă doriți să opriți modul de înregistrare, faceți din nou clic pe microfon și acesta va deveni din nou gri.",
	"sticky-note": "Dacă dați clic dreapta, puteți crea note autocolante personale permanente pentru lecție (care vor apărea în verde). În plus, profesorii pot lăsa notițe pentru toți elevii, care vor fi colorate în portocaliu.",
	"toolbar-calculator": "Aici puteți accesa un calculator care vă permite să efectuați calcule simple, dar și calcule științifice.",
	"toolbar-help": "Sondajele permit instructorului să efectueze mici sondaje în rândul participanților. Există patru tipuri: o întrebare de tip \"da/nu\", o întrebare rapidă, o alternativă \"îmi place/nu-mi place\" și, în final, diverse tipuri de sondaje: sondaje cu text liber, cu alegere multiplă și cu numere.",
	"toolbar-queue": "Coada permite elevului să pună întrebări. Toate sunt aranjate în ordine succesivă, de unde și numele.",
	"toolbar-sketchpad": "Blocul de schițe vă permite să luați notițe sub formă grafică. Acestea sunt persistente, astfel încât pot fi recuperate ulterior. Notele profesorului sunt transmise tuturor elevilor în timp real, fiind astfel vizibile public.",
	"toolbar-ticketing": "Aici utilizatorii pot crea un bilet în care să semnaleze o eroare de programare sau o altă problemă din lecție.",
	"toolbar-toggle": "Cu ajutorul următorului buton puteți deschide sau închide bara de instrumente. Acolo veți găsi câteva instrumente foarte utile..."
}
