{
	"instructor-view-handler": "Панель \"Инструктор\" - самый важный инструмент для учителя. Здесь вы можете увидеть, что именно делают ваши студенты, и получить общее представление о том, что происходит на уроке.",
	"language-switcher": "Языковой манипулятор позволяет настроить интерфейс на выбранный вами язык. Если содержание урока доступно на нескольких языках, вам может повезти - и вы увидите все это, например, на китайском языке. В любом случае, интерфейс будет отображаться на вашем языке.",
	"statusbar-blackscreen-mode": "Время от времени имеет смысл полностью сосредоточиться на голосе говорящего. Отсюда и отключение звука, запрограммированная остановка, так сказать. Этим вы затемните не только свой собственный экран, но и экран своих учеников. Еще один щелчок - и жизнь продолжается!",
	"statusbar-dashboard-button": "Приборная панель - это то место, где ISLE хранит все ваши движения. При нажатии на нее вы попадете в свой аккаунт и сможете получить доступ к посещенным курсам, просмотреть прогресс, изменить настройки и многое другое.....",
	"statusbar-group-manager": "Менеджер группы - очень мощный инструмент. Если вы хотите распределить учеников по группам так, чтобы они могли общаться друг с другом или работать вместе над текстовыми документами, вам нужно только ввести количество групп - и вуаля! Каждый ученик случайным образом назначается в группу.",
	"statusbar-info": "Строка состояния - это ваша информационная панель. Она сообщает вам, вошли вы в систему или нет, показывает ваше имя и фотографию профиля (если вы его загрузили) - и позволяет вам получить доступ к вашей учетной записи ISLE в панели инструментов.",
	"statusbar-login-button": "Логин должен быть понятным. Вы вводите свои данные пользователя - и вы находитесь в режиме онлайн. Если вы хотите быть в безопасности, вы можете активировать двухфакторную аутентификацию в ISLE панели.",
	"statusbar-logout-button": "Так ты сможешь выйти из системы. До свидания...",
	"statusbar-presence": "По умолчанию значок круга будет заполнен зеленым цветом, чтобы показать, что урок может быть подключен к серверу ISLE. Если сервер не работает или вы отключены от сети Интернет, то вместо этого он будет показан темно-оранжевым цветом.",
	"statusbar-presentation-mode": "Режим презентации предназначен для инструкторов с целью упрощения отображаемого интерфейса при совместном использовании экранов. При нажатии на него панель состояния и другие элементы интерфейса будут скрыты. Чтобы восстановить исходный вид, нажмите функциональную клавишу F7 или кнопку \"глаз\" в левом верхнем углу.",
	"statusbar-signup-button": "Процесс регистрации прост. Вы вводите свое имя, адрес электронной почты и пароль - и все.",
	"statusbar-text-chat": "Текстовый чат позволяет вам общаться с другими участниками, которые находятся в сети во время урока, анонимно или с вашим именем. Если применимо, вы можете увидеть количество сообщений в чате под иконкой.",
	"statusbar-username": "Здесь должно отображаться ваше имя, если вы вошли в систему. Если Вы еще не вошли в систему, Вам будет присвоен уникальный идентификатор, созданный для Вас, перед которым появится Anonymous.",
	"statusbar-video-chat": "ISLE имеет встроенный инструмент для проведения видеоконференций, который позволяет вам общаться по видеочату с другими пользователями, которые находятся там в то же время. А если прическа не подойдет, вы просто выключите камеру - и другой человек все равно вас услышит.",
	"statusbar-voice-info": "Для создания подписей в режиме реального времени или управления элементами интерфейса с помощью голоса можно использовать микрофон. Просто нажмите на значок, и он загорится красным цветом, чтобы показать, что это запись. Вы также увидите транскрипцию, говорящую о том, что вы поняли. Чтобы скопировать и вставить транскрипт, просто нажмите на иконку CC, которая будет отображаться справа от него. Откроется окно с редактором, в котором вы найдете записанный текст. Если вы хотите остановить режим записи, просто щелкните по микрофону еще раз, и он снова станет серым.",
	"sticky-note": "При нажатии правой кнопки мыши вы можете создать постоянные персональные примечания к уроку (которые будут отображаться зеленым цветом). Кроме того, учителя могут оставлять для всех учеников заметки, которые будут окрашены в оранжевый цвет.",
	"toolbar-buttongroup": "Следующей кнопкой можно открыть или закрыть панель инструментов. Там вы найдете некоторые очень полезные инструменты....",
	"toolbar-calculator": "Здесь вы можете получить доступ к калькулятору, который позволяет производить не только простые, но и научные вычисления.",
	"toolbar-help": "Опросы позволяют инструктору проводить небольшие опросы среди участников. Существует четыре типа опросов: вопрос \"да/нет\", вопрос \"скорость\", альтернатива \"нравится/не нравится\", наконец, различные типы опросов: опросы со свободным текстом, опросы с множественными вариантами выбора и опросы с количеством участников.",
	"toolbar-queue": "Очередь позволяет ученику задавать вопросы. Все они расположены последовательно, отсюда и название.",
	"toolbar-sketchpad": "Эскизная панель позволяет делать заметки в графическом виде. Они настойчивы, поэтому их можно получить позже. Заметки учителя передаются всем ученикам в режиме реального времени, поэтому они видны всем.",
	"toolbar-ticketing": "Здесь пользователи могут создать тикет, указывающий на программную ошибку или другую проблему в уроке."
}
