{
	"finish": "Teraz ste dokončili prehliadku rôznych prvkov rozhrania lekcie ISLE. Dávajte pozor na ďalšie výukové tlačidlá pripojené k jednotlivým komponentom vo vnútri lekcie, aby ste sa dozvedeli viac o ich funkčnosti a použití.",
	"instructor-view-handler": "Panel inštruktora je najdôležitejším nástrojom pre učiteľa. Tu môžete presne vidieť, čo vaši študenti robia, a mať prehľad o tom, čo sa v triede deje.",
	"language-switcher": "Výber jazyka v pravom dolnom rohu vám umožní nastaviť rozhranie na vami zvolený jazyk. Ak je obsah lekcie dostupný vo viacerých jazykoch, môžete mať šťastie - a uvidíte ho celý napríklad v čínštine. V každom prípade sa rozhranie zobrazí vo vašom jazyku.",
	"statusbar-blackscreen-mode": "Z času na čas má zmysel sústrediť sa výlučne na hlas rečníka. Preto ten výpadok, takpovediac naprogramované zastavenie. Pomocou neho zatemníte nielen svoju vlastnú obrazovku, ale aj obrazovku svojich študentov. Ešte jedno kliknutie - a život ide ďalej!",
	"statusbar-dashboard-button": "Na prístrojovej doske sú uložené všetky vaše pohyby v systéme ISLE. Keď na ňu kliknete, ocitnete sa vo svojom konte a budete mať prístup k navštevovaným kurzom, budete si môcť prezerať svoj pokrok, meniť nastavenia a ďalšie....",
	"statusbar-group-manager": "Správca skupiny je veľmi výkonný nástroj. Ak chcete priradiť študentov do skupín, aby mohli navzájom chatovať alebo spoločne pracovať na textových dokumentoch, stačí zadať počet skupín - a voilá! Každý študent je náhodne priradený do skupiny.",
	"statusbar-info": "Stavový riadok je informačný panel. Informuje vás o tom, či ste prihlásení alebo nie, zobrazuje vaše meno a profilový obrázok (ak ste ho nahrali) - a umožňuje vám prístup k vášmu účtu ISLE na paneli.",
	"statusbar-login-button": "Prihlásenie by malo byť samozrejmé. Zadáte svoje používateľské údaje - a ste online. Ak chcete byť na bezpečnej strane, môžete si na svojom ovládacom paneli ISLE aktivovať dvojfaktorové overovanie.",
	"statusbar-logout-button": "Takto sa môžete odhlásiť. Nashledanú...",
	"statusbar-presence": "Ikona kruhu bude predvolene vyplnená zelenou farbou, čo signalizuje, že sa lekcia môže pripojiť k serveru ISLE. Ak by bol server nefunkčný alebo by ste boli odpojení od internetu, zobrazí sa namiesto toho tmavoranžovo.",
	"statusbar-presentation-mode": "Prezentačný režim je určený pre inštruktorov na zjednodušenie zobrazeného rozhrania pri zdieľaní obrazoviek. Po kliknutí naň sa stavový riadok a ostatné prvky rozhrania skryjú. Ak chcete obnoviť pôvodné zobrazenie, stlačte funkčné tlačidlo F7 alebo kliknite na tlačidlo oka v ľavom hornom rohu.",
	"statusbar-signup-button": "Proces registrácie je jednoduchý. Zadáte svoje meno, e-mailovú adresu a heslo - a to je všetko.",
	"statusbar-text-chat": "Textový chat vám umožňuje komunikovať s ostatnými členmi, ktorí sú na hodine online, anonymne alebo s vaším menom. V prípade potreby môžete pod ikonou vidieť počet príspevkov v chate.",
	"statusbar-username": "Tu by sa malo zobraziť vaše meno, ak ste prihlásení. Ak ešte nie ste prihlásení, bude vám priradený jedinečný identifikátor vytvorený pre vás, pred ktorým je uvedené Anonym.",
	"statusbar-video-chat": "ISLE má zabudovaný nástroj na konferencie, ktorý vám umožňuje videochatovať s ostatnými používateľmi, ktorí sú tam v rovnakom čase. A ak sa vám účes nehodí, stačí vypnúť kameru - a druhá osoba vás stále počuje.",
	"statusbar-voice-info": "Ak chcete vytvárať titulky v reálnom čase alebo ovládať prvky rozhrania hlasom, môžete použiť mikrofón. Stačí kliknúť na ikonu a tá sa zmení na červenú, čo znamená, že sa nahráva. Zobrazí sa aj prepis, ktorý vás informuje o tom, čomu rozumie. Ak chcete prepis skopírovať a vložiť, stačí kliknúť na ikonu CC, ktorá sa zobrazí napravo od neho. Otvorí sa okno s editorom a v ňom nájdete nahraný text. Ak chcete zastaviť režim nahrávania, stačí opäť kliknúť na mikrofón a ten sa opäť zmení na sivý.",
	"sticky-note": "Ak kliknete pravým tlačidlom myši, môžete si vytvoriť trvalé osobné samolepiace poznámky k lekcii (ktoré sa zobrazia zelenou farbou). Okrem toho môžu učitelia zanechať poznámky pre všetkých žiakov, ktoré budú podfarbené oranžovou farbou.",
	"toolbar-calculator": "Tu máte prístup ku kalkulačke, ktorá vám umožní vykonávať jednoduché, ale aj vedecké výpočty.",
	"toolbar-help": "Ankety umožňujú inštruktorovi robiť malé prieskumy medzi účastníkmi. K dispozícii sú štyri typy: otázka áno/nie, rýchla otázka, alternatíva páči sa mi/nepáči sa mi, a napokon rôzne typy ankiet: ankety s voľným textom, s výberom odpovede a s číslami.",
	"toolbar-queue": "Fronta umožňuje študentom klásť otázky. Všetky sú usporiadané v poradí, preto ten názov.",
	"toolbar-sketchpad": "Náčrtník umožňuje robiť poznámky v grafickej podobe. Sú trvalé, takže ich možno neskôr obnoviť. Poznámky učiteľa sa prenášajú všetkým študentom v reálnom čase, sú teda verejne viditeľné.",
	"toolbar-ticketing": "Tu môžu používatelia vytvoriť lístok, v ktorom upozornia na chybu v programovaní alebo iný problém v lekcii.",
	"toolbar-toggle": "Pomocou nasledujúceho tlačidla môžete otvoriť alebo zatvoriť panel nástrojov. Nájdete tu niekoľko veľmi užitočných nástrojov..."
}
