{
	"finish": "S tem ste zaključili ogled različnih elementov vmesnika lekcije ISLE. Bodite pozorni na dodatne učne gumbe, priložene posameznim elementom znotraj lekcije, da bi izvedeli več o njihovi funkcionalnosti in uporabi.",
	"instructor-view-handler": "Plošča za učitelja je najpomembnejše orodje za učitelja. Tu lahko natančno vidite, kaj počnejo vaši učenci, in imate pregled nad dogajanjem v razredu.",
	"language-switcher": "Z izbirnikom jezika v spodnjem desnem kotu lahko nastavite vmesnik na izbrani jezik. Če je vsebina lekcije na voljo v več jezikih, boste morda imeli srečo in boste na primer videli celotno lekcijo v kitajščini. V vsakem primeru bo vmesnik prikazan v vašem jeziku.",
	"statusbar-blackscreen-mode": "Občasno se je smiselno v celoti osredotočiti na glas govorca. Od tod izpad glasu, tako rekoč programiran zastoj. Z njim ne boste zatemnili le svojega zaslona, temveč tudi zaslone svojih učencev. Še en klik - in življenje se nadaljuje!",
	"statusbar-dashboard-button": "Na nadzorni plošči so shranjeni vsi vaši premiki v storitvi ISLE. Ko jo kliknete, pristanete v svojem računu in lahko dostopate do obiskovanih tečajev, pregledujete svoj napredek, spreminjate nastavitve in še več....",
	"statusbar-group-manager": "Upravitelj skupin je zelo zmogljivo orodje. Če želite učence razporediti v skupine, da se lahko med seboj pogovarjajo ali skupaj delajo na besedilnih dokumentih, morate le vnesti število skupin - in voilà! Vsak učenec je naključno dodeljen skupini.",
	"statusbar-info": "Vrstica stanja je vaša informacijska plošča. Pove vam, ali ste prijavljeni ali ne, prikaže vaše ime in profilno sliko (če ste jo naložili) ter omogoča dostop do vašega računa ISLE na nadzorni plošči.",
	"statusbar-login-button": "Prijava mora biti samoumevna. Vnesete svoje uporabniške podatke in ste na spletu. Če želite biti na varni strani, lahko v nadzorni plošči ISLE aktivirate dvofaktorsko preverjanje pristnosti.",
	"statusbar-logout-button": "Tako se lahko odjavite. Zbogom ...",
	"statusbar-presence": "Privzeto je ikona kroga zelene barve, kar pomeni, da se učna ura lahko poveže s strežnikom ISLE. Če strežnik ne deluje ali če ste odklopljeni od interneta, bo namesto tega prikazana v temno oranžni barvi.",
	"statusbar-presentation-mode": "Način predstavitve je namenjen inštruktorjem za poenostavitev prikazanega vmesnika, ko delijo svoje zaslone. Ko kliknete nanj, se vrstica stanja in drugi elementi vmesnika skrijejo. Če želite obnoviti prvotni pogled, pritisnite funkcijsko tipko F7 ali kliknite gumb za oči v levem zgornjem kotu.",
	"statusbar-signup-button": "Postopek registracije je preprost. Vnesete svoje ime, e-poštni naslov in geslo - in to je vse.",
	"statusbar-text-chat": "V besedilnem klepetu lahko komunicirate z drugimi člani, ki so v učni uri na spletu, anonimno ali z vašim imenom. Če je primerno, lahko pod ikono vidite število objav v klepetu.",
	"statusbar-username": "Če ste prijavljeni, mora biti prikazano vaše ime. Če še niste prijavljeni, vam bo dodeljen edinstven identifikator, ustvarjen za vas, pred katerim je zapisano Anonymous.",
	"statusbar-video-chat": "ISLE ima vgrajeno orodje za konference, ki vam omogoča videoklepet z drugimi uporabniki, ki so tam ob istem času. In če vam pričeska ne ustreza, preprosto izklopite kamero - in druga oseba vas še vedno lahko sliši.",
	"statusbar-voice-info": "Če želite ustvariti napise v realnem času ali glasovno upravljati elemente vmesnika, lahko uporabite mikrofon. Kliknite na ikono, ki se bo obarvala rdeče, kar pomeni, da se snema. Prikazal se bo tudi prepis, ki vam bo povedal, kaj je razumel. Če želite kopirati in prilepiti prepis, kliknite ikono CC, ki se bo prikazala desno od njega. Odprlo se bo okno z urejevalnikom in v njem boste našli zapisano besedilo. Če želite ustaviti način snemanja, samo še enkrat kliknite na mikrofon in spet bo postal siv.",
	"sticky-note": "Če kliknete z desno tipko miške, lahko ustvarite trajne osebne samolepilne opombe za lekcijo (ki bodo prikazane v zeleni barvi). Poleg tega lahko učitelji pustijo opombe za vse učence, ki bodo obarvane oranžno.",
	"toolbar-calculator": "Tu lahko dostopate do kalkulatorja, ki omogoča preproste in tudi znanstvene izračune.",
	"toolbar-help": "Z anketami lahko inštruktor med udeleženci izvede manjše ankete. Na voljo so štiri vrste: vprašanje da/ne, hitro vprašanje, alternativa všeč/neprijetno, na koncu pa različne vrste anket: ankete s prostim besedilom, ankete z več možnimi odgovori in ankete s številkami.",
	"toolbar-queue": "V vrsti lahko učenec postavlja vprašanja. Vsa vprašanja so razvrščena po zaporedju, od tod tudi ime.",
	"toolbar-sketchpad": "V skicirki si lahko zapisujete opombe v grafični obliki. Te so trajne, zato jih lahko pozneje prikličete. Učiteljeve opombe se v realnem času prenašajo vsem učencem, zato so javno vidne.",
	"toolbar-ticketing": "Tu lahko uporabniki ustvarijo vozovnico, v kateri opozorijo na programsko napako ali drugo težavo v lekciji.",
	"toolbar-toggle": "Z naslednjim gumbom lahko odprete ali zaprete orodno vrstico. V njej boste našli nekaj zelo uporabnih orodij..."
}
