{
	"finish": "Du har nu avslutat rundvandringen till de olika gränssnittsdelarna i en ISLE-lektion. Håll utkik efter ytterligare knappar för handledning som är kopplade till enskilda komponenter i lektionen för att lära dig mer om deras funktionalitet och användning.",
	"instructor-view-handler": "Instruktörspanelen är det viktigaste verktyget för läraren. Här kan du se exakt vad dina elever gör och få en överblick över vad som händer i klassen.",
	"language-switcher": "Med språkväljaren längst ner till höger kan du ställa in gränssnittet på det språk du vill ha. Om lektionens innehåll finns på flera språk kan du ha tur och se allt på till exempel kinesiska. I vilket fall som helst kommer gränssnittet att visas på ditt språk.",
	"statusbar-blackscreen-mode": "Ibland är det klokt att fokusera helt och hållet på talarens röst. Därav mörkläggningen, ett programmerat stillestånd, så att säga. Med den kommer du inte bara att mörka din egen skärm, utan även dina elevers. Ett klick till - och livet fortsätter!",
	"statusbar-dashboard-button": "På instrumentpanelen lagrar ISLE alla dina rörelser. När du klickar på den hamnar du på ditt konto och kan få tillgång till de kurser du deltagit i, se dina framsteg, ändra dina inställningar med mera....",
	"statusbar-group-manager": "Grupphanteraren är ett mycket kraftfullt verktyg. Om du vill dela in dina elever i grupper så att de kan chatta med varandra eller arbeta tillsammans med textdokument behöver du bara ange antalet grupper - och voilà! Varje elev tilldelas slumpmässigt en grupp.",
	"statusbar-info": "Statusfältet är din informationspanel. Den talar om för dig om du är inloggad eller inte, den visar ditt namn och din profilbild (om du har laddat upp en) - och den ger dig tillgång till ditt ISLE-konto i instrumentpanelen.",
	"statusbar-login-button": "Inloggningen bör vara självförklarande. Du anger dina användaruppgifter - och så är du online. Om du vill vara på den säkra sidan kan du aktivera 2-faktorsautentisering i din ISLE-instrumentpanel.",
	"statusbar-logout-button": "På så sätt kan du logga ut. Hej då ...",
	"statusbar-presence": "Som standard fylls cirkelsymbolen med grönt för att visa att lektionen kan ansluta till ISLE-servern. Om servern är nere eller om du inte är ansluten till Internet kommer den att visas i mörk orange istället.",
	"statusbar-presentation-mode": "Presentationsläget är avsett för instruktörer som vill förenkla gränssnittet när de delar sina skärmar. När du klickar på den döljs statusfältet och andra gränssnittselement. Om du vill återställa den ursprungliga visningen trycker du på funktionstangenten F7 eller klickar på ögonknappen uppe till vänster.",
	"statusbar-signup-button": "Registreringsprocessen är enkel. Du anger ditt namn, din e-postadress och ett lösenord - och det är allt.",
	"statusbar-text-chat": "Med textchatten kan du kommunicera med andra medlemmar som är online under lektionen, anonymt eller med ditt namn. I förekommande fall kan du se antalet inlägg i chatten under ikonen.",
	"statusbar-username": "Här bör du se ditt namn om du är inloggad. Om du inte är inloggad ännu kommer du att tilldelas en unik identifierare som skapats för dig och som föregås av Anonymous.",
	"statusbar-video-chat": "ISLE har ett inbyggt konferensverktyg som gör att du kan videochatta med andra användare som är där samtidigt. Och om frisyren inte passar, är det bara att stänga av kameran - och den andra personen kan fortfarande höra dig.",
	"statusbar-voice-info": "Du kan använda din mikrofon för att skapa text i realtid eller styra gränssnittselement med rösten. Klicka bara på ikonen så blir den röd för att visa att den spelar in. Du kommer också att se en transkription som talar om vad den har förstått. Om du vill kopiera och klistra in transkriptionen klickar du bara på CC-ikonen som visas till höger om den. Ett fönster med en redigerare öppnas och i det hittar du din inspelade text. Om du vill stoppa inspelningsläget klickar du bara på mikrofonen igen så blir den grå igen.",
	"sticky-note": "Om du högerklickar kan du skapa permanenta personliga klisterlappar för lektionen (de visas i grönt). Dessutom kan läraren lämna anteckningar för alla elever, som kommer att färgas orange.",
	"toolbar-calculator": "Här kan du få tillgång till en miniräknare som gör det möjligt att göra enkla, men också vetenskapliga beräkningar.",
	"toolbar-help": "Med hjälp av omröstningar kan instruktören göra små undersökningar bland deltagarna. Det finns fyra typer: en ja/nej-fråga, en hastighetsfråga, ett alternativ för att tycka om eller inte tycka om, och slutligen olika typer av enkäter: fritext, flervalsfrågor och sifferenkäter.",
	"toolbar-queue": "I kön får eleven möjlighet att ställa frågor. De är alla ordnade i ordning, därav namnet.",
	"toolbar-sketchpad": "Med skissblocket kan du göra anteckningar i grafisk form. De är beständiga, så de kan hämtas senare. Lärarens anteckningar överförs till alla elever i realtid och är därför offentligt synliga.",
	"toolbar-ticketing": "Här kan användarna skapa ett ärende för att påpeka ett programmeringsfel eller ett annat problem i lektionen.",
	"toolbar-toggle": "Med följande knapp kan du öppna eller stänga verktygsfältet. Där hittar du några mycket användbara verktyg..."
}
