{
	"finish": "您现在已经完成了ISLE课程的各种界面元素的浏览。请注意附加在课程中各个组件上的教程按钮，以了解更多关于它们的功能和用法。",
	"instructor-view-handler": "教员面板是教师最重要的工具。在这里，你可以看到你的学生正在做什么，并对课堂上发生的事情有一个概述。",
	"language-switcher": "语言选择器允许您将界面设置为您选择的语言。如果课程的内容有多种语言，您可能会很幸运--比如说，您可以看到整个课程的中文内容。在任何情况下，界面都会以您的语言显示。",
	"statusbar-blackscreen-mode": "时不时地，把注意力完全集中在说话者的声音上，这是有道理的。因此，停电，可以说是一个程序化的停顿。有了它，你不仅可以让自己的屏幕变暗，还可以让学生的屏幕变暗。再点击一下--生活就会继续",
	"statusbar-dashboard-button": "仪表盘是ISLE存储您所有动作的地方。当你点击它的时候，你就会进入你的账户，你就可以访问你参加的课程，查看你的进度，改变你的设置，以及更多....。",
	"statusbar-group-manager": "群组管理器是一个非常强大的工具。如果你想把学生分配到小组，这样他们就可以互相聊天或者一起处理文本文档，你只需要输入小组的数量，然后就可以了。每个学生都会被随机分配到一个组。",
	"statusbar-info": "状态栏是你的信息面板。它告诉你是否已经登录，它显示你的名字和个人资料图片（如果你上传了图片），并允许你在仪表板中访问你的ISLE账户。",
	"statusbar-login-button": "登录应该是不言自明的。您输入您的用户数据 - 然后您就可以在线了。如果你想在安全方面，你可以在你的ISLE仪表板中激活双因素认证。",
	"statusbar-logout-button": "这样你就可以退出了。再见...",
	"statusbar-presence": "默认情况下，圆圈图标将被填充为绿色，表示课程可以连接到ISLE服务器。如果服务器瘫痪或您与互联网断开连接，它将显示为深橙色。",
	"statusbar-presentation-mode": "演示模式是为了让教师在共享屏幕时简化显示界面。当您点击它时，状态栏和其他界面元素将变得隐藏。要恢复原视图，请按功能键F7或点击左上方的眼睛按钮。",
	"statusbar-signup-button": "注册过程很简单。您只需输入您的姓名、电子邮件地址和密码，仅此而已。",
	"statusbar-text-chat": "通过文字聊天，您可以与课程中在线的其他成员进行交流，可以匿名，也可以用您的名字进行交流。如果适用，您可以在图标下方看到聊天中的帖子数量。",
	"statusbar-username": "如果您已登录，在这里您应该可以看到您的名字。如果您还没有登录，您将被分配一个为您创建的唯一标识符，前面是匿名。",
	"statusbar-video-chat": "ISLE内置了一个会议工具，可以让你与同时在场的其他用户进行视频聊天。而如果发型不合适，你只需关闭摄像头--对方仍然可以听到你的声音。",
	"statusbar-voice-info": "要创建实时字幕或通过语音控制界面元素，你可以使用麦克风。只要点击图标，它就会变成红色，表示正在录音。你还会看到一个转录，告诉你什么是已经理解。要复制和粘贴抄本，只需点击它右边的CC图标。一个带有编辑器的窗口将打开，你将在其中找到你录制的文本。如果你想停止录音模式，只需再次点击麦克风，它将再次变成灰色。",
	"sticky-note": "如果你右击，你可以为课程创建永久的个人便签（会显示为绿色）。此外，教师还可以为所有学生留下便签，便签的颜色为橙色。",
	"toolbar-calculator": "在这里，你可以访问一个计算器，让你做简单的，但也科学的计算。",
	"toolbar-help": "民意调查可以让教师在学员中进行小型调查。有四种类型：\"是/否 \"问题、\"快速问题\"、\"喜欢/不喜欢 \"选项，最后是各种调查类型：自由文本、多项选择和数字调查。",
	"toolbar-queue": "队列允许学生提出问题。它们都是按顺序排列的，所以叫 \"排队\"。",
	"toolbar-sketchpad": "草图板允许您以图形的形式做笔记。它们是持久性的，因此可以在以后检索。教师的笔记会实时传送给所有学生，因此是公开可见的。",
	"toolbar-ticketing": "用户可以在这里创建一个票据，指出课程中的编程错误或其他问题。",
	"toolbar-toggle": "通过以下按钮，您可以打开或关闭工具栏。在那里你会发现一些非常有用的工具... ..."
}
