{
	"anonymous-survey": "Sondaj anonim",
	"anonymous-survey-tooltip": "Alegeți dacă datele din sondaj trebuie să fie colectate anonim sau nu",
	"answer-options-new-line-delimited": "Opțiuni de răspuns (delimitate prin linii noi)",
	"answer-recorded": "Răspuns înregistrat",
	"answer-recorded-message": "Răspunsul dvs. a fost înregistrat cu succes.",
	"answer-slow-fast": "Viteza este \"Prea lentă\" sau \"Prea rapidă\"?",
	"answer-yes-no": "Vă rugăm să răspundeți cu \"Da\" sau \"Nu\".",
	"attach-file": "Atașați fișierul",
	"attachments": "Atașamente",
	"calculator": "Calculator",
	"chat": "Chat",
	"chat-tooltip": "Începeți discuția cu elevul",
	"close": "Închideți",
	"component": "Componentă:",
	"create-ticket": "Creați un bilet",
	"description": "Descriere:",
	"description-placeholder": "Introduceți descrierea...",
	"documentation": "Documentație",
	"finish-poll": "Finish Poll",
	"finish-survey": "Termină sondajul",
	"help-click-instruction": "Faceți clic pe un element din meniu pentru a afla mai multe despre...",
	"help-data-explorer": "<0>Exploratorul de date ISLE vă permite să analizați seturi de date utilizând o interfață de tip \"point-and-click\". Exploratorul de date este împărțit în două panouri, un panou din stânga în care puteți comuta între o vizualizare în foaie de calcul a datelor care urmează să fie analizate și alte componente opționale, cum ar fi un editor de redactare a rapoartelor sau o listă de întrebări. Partea din dreapta este un panou de ieșire care conține toate rezultatele (statistici de sinteză, diagrame, rezultate ale testului de ipoteză) pe care le-ați creat.</0><2>Noi ieșiri pot fi generate prin intermediul casetei de instrumente, care poate fi deschisă făcând clic pe butonul &quot;Show Toolbox&quot; (Afișați caseta de instrumente). Un grafic sau un tabel nou generat va fi adăugat la lista de elemente de ieșire afișată în partea dreaptă:</2><4>Butoanele roșii cu pictogramele &quot;x&quot; pot fi utilizate pentru a șterge elemente de ieșire individuale, în timp ce butonul &quot;Clear All&quot; din partea de jos va șterge toate elementele de ieșire.</4><5>Utilizarea butoanelor cu semnul întrebării pe foaia de calcul a datelor, pe editorul de rapoarte sau în caseta de instrumente vă va permite să începeți un tur ghidat prin capacitățile diferitelor piese.</5>",
	"help-queue": "Coadă de ajutor",
	"hide-toolbar": "Ascundeți bara de instrumente",
	"like-dislike": "Îmi place / Nu-mi place",
	"maximum-num-attachments": "A fost atins numărul maxim de atașamente",
	"maximum-num-attachments-message": "Nu puteți încărca mai mult de șase atașamente pe bilet.",
	"mean": "Media",
	"meter-prompt": "Vă rugăm să indicați răspunsul dvs. pe scara de mai jos, trăgând bara portocalie.",
	"name": "Nume",
	"num-open-questions": "# de întrebări deschise",
	"open": "Deschideți",
	"open-poll-menu": "Deschideți meniul de sondaj",
	"open-queue": "Coadă deschisă",
	"poll": "Sondaj",
	"poll-responses": "Răspunsuri la sondaj",
	"polls": "Sondaje",
	"posted-to-queue": "Cineva a postat o întrebare în coada de așteptare",
	"question": "Întrebare",
	"queue": "Coadă de așteptare",
	"range": "Gama",
	"response": "Răspuns",
	"show-toolbar": "Afișați bara de instrumente",
	"sketchpad": "Sketchpad",
	"slow-fast": "Prea lent / Prea rapid",
	"start-survey": "Începeți sondajul",
	"stop-survey": "Opriți sondajul",
	"submit": "Trimiteți",
	"survey": "Sondaj",
	"survey-anonymous": "Datele sunt colectate în mod anonim"
}
