{
	"1st-stdev": "1-во стандартно отклонение",
	"2nd-stdev": "2-ро стандартно отклонение",
	"action-required": "Необходими действия",
	"actions": "действия",
	"addition": "Добавяне",
	"alternate-color-scheme": "Алтернативна цветова схема",
	"and": "и",
	"attach-clusters-table": "Прикрепване на клъстери към таблица?",
	"axis-label-rotation": "Завъртане на етикета на оста",
	"bandwidth-adjustment": "Регулиране на честотната лента",
	"Bar Chart": "Бар диаграма",
	"Bar Chart-description": "Стълбовидната диаграма е графика, която показва категорични данни като правоъгълни стълбове, като височината на стълбовете е пропорционална на честотата на всяка категория. Когато се групира по втора променлива, стълбовидната диаграма се превръща в групирана стълбовидна диаграма, в която за всяка категория се показват няколко стълба. Алтернативен вариант е да се подредят стълбовете един върху друг; в този случай диаграмата се нарича подредена стълбова диаграма.",
	"bars-represent": "Баровете представляват:",
	"bin-quantitative": "Превръщане на количествените променливи в категорични",
	"bin-transformer-header": "Създаване на нова променлива чрез разделяне на количествена променлива на категории",
	"binning-strategy": "Стратегия за биниране:",
	"bins": "Кошчета",
	"Box Plot": "Кутийна диаграма",
	"Box Plot-description": "Графиката на карето и мустаците е представяне на количествени данни. За всяка променлива боксовият график показва нейния 25% квантил (стойност, по-голяма от 25% от данните), медианата и 75% квантил като кутия. Уисковете се простират до долната ограда при най-малката стойност в извадката, която е по-малка от Q1, но по-голяма от (Q1 - 1,5*IQR), и до аналогично определената горна ограда.",
	"calculate": "Изчислете",
	"categorical": "Категорични:",
	"categorical-transformer-header": "Създаване на нова променлива чрез преименуване или комбиниране на категории",
	"center-values-subtract-the-mean": "Центриране на стойностите (= изваждане на средната стойност)?",
	"central-tendency-measures": "Мерки за централна тенденция",
	"change-tree-features": "Промяна на функциите на дървото...",
	"Chi-square Independence Test-description": "Тест, който определя дали има връзка между две категорични променливи.",
	"Chi-squared Independence Test": "Тест за независимост по метода на Хи-квадрат",
	"choose-category-labels": "Избор на категорични етикети за интервалните интервали",
	"clear-all": "Изчистване на всички",
	"clear-data": "Изчистване на данни",
	"clear-plots": "Ясни парцели",
	"close": "Затвори",
	"close-tutorial": "Затвори урока",
	"closing-parenthesis": "Затварящи скоби",
	"color": "Цвят",
	"column-variable": "Променлива в колона:",
	"columns": "Колони",
	"common-x-axis": "Обща ос x?",
	"common-y-axis": "Обща ос y?",
	"components-to-add": "# на компонентите за добавяне към таблицата с данни",
	"Contingency Table": "Таблица за непредвидени обстоятелства",
	"Contingency Table-description": "Таблицата на контингентите показва суровите абсолютни или относителни честоти на стойностите на две категорични променливи, заедно с техните общи стойности в редовете и колоните.",
	"contingency-table-group-tooltip": "Генериране на таблица на контингентите за всяка категория на избрана променлива за групиране",
	"Contour Chart": "Диаграма на контура",
	"Contour Chart-description": "Контурната диаграма може да се използва за изобразяване на съвместното разпределение на две количествени променливи. Тя изобразява триизмерна повърхност чрез нанасяне на постоянни разрези, наречени контури, върху двуизмерна мрежа.",
	"Correlation": "Корелация",
	"Correlation Test": "Тест за корелация",
	"Correlation Test-description": "Тест, използван за оценка на корелацията на Пиърсън между две променливи, която измерва линейната връзка между тях.",
	"count": "Граф",
	"counts": "Бройки",
	"create-filtered-dataset": "Създаване на филтриран набор от данни",
	"create-filtered-dataset-tooltip": "Създаване на нов набор от данни от активните в момента филтри",
	"create-groups": "Създаване на групи (напр. за разделяне на набора за обучение и теста или за кръстосано валидиране)",
	"create-new-variable": "Създаване на нова променлива",
	"data": "Данни",
	"data-empty": "Наборът от данни е празен.",
	"data-explorer": "Изследовател на данни",
	"decimal-places": "десетична(и) запетая(и).",
	"Decision Tree": "Дърво на решенията",
	"Decision Tree-description": "Изграждане на дърво на решенията за регресия или класификация. За количествени отговори при всяка итерация на алгоритъма данните се разделят по променливата, която води до разделяне с най-голямо намаляване на дисперсията за отговора. За категорични отговори данните се разделят по признака, който води до най-голямо нарастване на информацията (измерено или като индекс на Джини, или като ентропия)."
}
