{
	"binomial-intro": "Ora passeremo a fare una domanda Sì/No su una popolazione. Siamo interessati a stimare la reale proporzione di popolazione <1 /> delle risposte \"Sì\" (per esempio, quale proporzione della popolazione ha gli occhi azzurri?) Possiamo prendere un campione di dimensioni <3 />, trovare quante osservazioni nel nostro campione sono un \"Sì\" (X), e poi stimare la vera proporzione <5 /> con <7 />. Poi <9 />. Il nostro intervallo di confidenza è quindi <11 />",
	"binomial-intro-end": "Per la nostra scelta della dimensione del campione (n), della proporzione reale <1 /> e del livello di confidenza, simuleremo <3 /> campioni diversi dalla nostra distribuzione normale e calcoleremo le proporzioni del campione e gli intervalli di confidenza corrispondenti.",
	"capture-true-proportion": "Dei 20 intervalli di confidenza, {{nTrapped}} cattura la vera proporzione",
	"change-parameters": "Modifica dei parametri",
	"click-pop-proportion": "Clicca per utilizzare la percentuale di popolazione",
	"click-pop-stdev": "Fare clic per utilizzare la deviazione standard della popolazione",
	"click-sample-proportion": "Fare clic per utilizzare la proporzione del campione",
	"click-sample-stdev": "Fare clic per utilizzare la deviazione standard del campione",
	"confidence-interval-coverage": "Copertura dell'intervallo di confidenza per la quota di campione",
	"confidence-Interval-coverage-mean": "Intervallo di confidenza Copertura dell'intervallo di confidenza per la media del campione",
	"confidence-intervals": "Intervalli di fiducia",
	"confidence-intervals-for": "Intervalli di fiducia per",
	"confidence-level": "Livello di fiducia",
	"coverage": "copertura",
	"mean": "Significato",
	"normal-intro": "Il nostro intervallo di fiducia è quindi",
	"normal-intro-end": "Per la nostra scelta della dimensione del campione (n), <1 >, <3 />, e del livello di confidenza, simuleremo 20 campioni diversi dalla nostra distribuzione normale e calcoleremo i mezzi di campionamento e gli intervalli di confidenza corrispondenti.",
	"number-of-confidence-intervals": "Numero di intervalli di confidenza che coprono la popolazione {{{center}} di",
	"parameters": "Parametri",
	"sample-size": "Dimensione del campione",
	"standard-deviation": "deviazione standard",
	"statistics": "Statistiche",
	"then": "Poi",
	"true-proportion": "La vera proporzione"
}
